[
  {
    "title": "Senior Machine Learning Engineer - (Vendor Data)",
    "company": "Delivery Hero",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-machine-learning-engineer-vendor-data-at-delivery-hero-4308205972",
    "posted_date": "12 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFOZbu6XEJUAw/company-logo_100_100/company-logo_100_100/0/1688740737160/delivery_hero_se_logo?e=2147483647&v=beta&t=jzixay9Wvsb0wQ7XPJDP1NDW_wPdZvs-PYut-TqyEOc",
    "description": "As the world’s pioneering local delivery platform, our mission is to deliver an amazing experience, fast, easy, and to your door. We operate in over 70+ countries worldwide, powered by tech, designed by people. As one of Europe’s largest tech platforms, headquartered in Berlin, Germany. Delivery Hero has been listed on the Frankfurt Stock Exchange since 2017 and is part of the MDAX stock market index. We enable creative minds to deliver solutions that create impact within our ecosystem. We move fast, take action and adapt. No matter where you're from or what you believe in, we build, we deliver, we lead. We are Delivery Hero.Job DescriptionBe our next Hero! - Join the world’s leading local delivery platform.We are looking for a Senior Machine Learning Engineer -Vendor Data(all genders) to join the Vendor Data tribe in our mission to deliver consistently amazing experiences.As part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.The Vendor Data tribe’s mission is to drive innovation, insight-driven decision making and to solve business problems through a culture of excellence and openness. The tribe comprises teams of skilled analysts, engineers, and scientists working together to deliver data solutions covering a host of business opportunities across all of Delivery Hero’s 70+ markets. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility and reach.We are looking for a talented and motivated Senior Machine Learning Engineer (all genders) to work with best-in-class data science and AI models to drive our fundamental shift to machine learning in the Vendor vertical at Delivery Hero. You will be working with a team of ML Engineers and Data Scientists deploying advanced ML services to solve complex problems, delivering revenue for Delivery Hero at the frontline of our profitability journey.If you're a builder in machine learning who is hungry for a new adventure, an international workplace is waiting for you in the heart of Berlin!Your mission:Drive the design, build and maintain large-scale machine learning systems, ensuring they align with the Vendor strategic product goals, while optimising for performance and efficiencyArchitect scalable, reliable, and cost-efficient ML infrastructure to manage the entire ML lifecycle at scale.Set and uphold best practices for productionising ML, including monitoring, testing, reproducibility, and responsible AI practices.Collaborate with product, engineering, analysts, and data science teams to understand their needs and build solutions that optimise their workflows.Leverage cloud technologies to build reliable, efficient and robust systems for multiple teams. Influence by proactively suggesting how to leverage new technologies to support multiple downstream use cases.Raise the technical bar and foster a culture of excellence in ML engineering.Stay ahead of industry and academic trends, evaluating and introducing emerging technologies and methodologies that can shape Delivery Hero’s future ML capabilities.QualificationsWhat you'll need to be successful:Expert knowledge of data management, storage, and best MLOps and DataOps practices to enable performant and cost-efficient ML systems at scale.Deep expertise with modern ML frameworks and libraries (e.g. TensorFlow, PyTorch) and the ability to guide adoption of best practices across diverse ML use cases.Experience in designing, deploying, and operating large-scale machine learning systems in production, with a track record of delivering high-impact solutions.Hands-on experience with cloud platforms and distributed infrastructure (AWS, GCP, Azure) and proficiency in containerisation and orchestration technologies (eg Docker, Kubernetes) for building resilient ML services.Experience with CI/CD pipelines and commonly used tools in ML Engineering such as Metaflow, MLflow, Airflow, Grafana, and similar.Strong systems-level problem-solving skills, with the ability to balance performance, scalability, maintainability, and business impact.Great communication and collaboration skills, with the ability to partner effectively across product, engineering, and business stakeholders.Highly desirable:Proven ability to design and scale ML systems under strict latency, throughput, and cost constraints, balancing innovation with operational excellence.Demonstrated impact in translating advanced research into production systems that drive measurable business outcomes.Additional InformationWhat's in it for you?Ensuring you and all our Heroes are looked after, happy, and healthy is always on the menu. Because if you’re in good shape, then we’re in good shape.Make the most of our hybrid working model and join the team for face-to-face connection and collaboration in our beautiful Berlin campus 2 days a weekWe offer 27 days holiday with an extra day on 2nd and 3rd year of serviceWe will support you in developing yourself and your career growth opportunities: 1.000 € Educational Budget, Language Courses, Parental Support and access to the Udemy Business platform to explore a variety of online courses.Get moving and release those wonderful, mind-boosting endorphins: Health Checkups, Meditation, Gym & Bicycle SubsidyCash. Dough. Cheddar. Whatever you call it, we’ll help you with it: Employee Share Purchase Plan, Sabbatical Bank, Public Transportation Ticket Discount, Life & Accident Insurance, Corporate Pension PlanThe power of getting together over some food is unrivaled. Here are a few ways to help you do that. All the yum: Digital Meal Vouchers, Food Vouchers, Corporate Discounts. Courses.Ready to join our team? If you’re excited to grow, collaborate and be part of the world’s leading delivery platform, we’d love to hear from you.Apply today!We believe diversity and inclusion are key to creating not only an exciting product, but also an amazing customer and employee experience. Fostering this starts with hiring - therefore we do not discriminate on the basis of racial identities, religious beliefs, color, national origin, gender identities or expressions, sexual orientations, age, marital or disability statuses, or any other aspect that makes you, you. We encourage you to let us know if you need any accommodations or specific accessibility support to ensure a smooth interview experience—just include it in your application. You're welcome to share your pronouns (he/she/they) right from the start so we can address you respectfully from our first contact.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFOZbu6XEJUAw/company-logo_100_100/company-logo_100_100/0/1688740737160/delivery_hero_se_logo?e=2147483647&v=beta&t=jzixay9Wvsb0wQ7XPJDP1NDW_wPdZvs-PYut-TqyEOc",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Briink - Backend Engineer, AI/ML & Climate Tech (Mid to Senior)",
    "company": "Briink",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/briink-backend-engineer-ai-ml-climate-tech-mid-to-senior-at-briink-4340586464",
    "posted_date": "13 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQHX0layf3nGjw/company-logo_100_100/company-logo_100_100/0/1671718136637/briinkedin_logo?e=2147483647&v=beta&t=GotQAAEHzUxYhuITacEh0BsPak3gCsw2rWwEHLPtyeg",
    "description": "What we doAt Briink, we're helping accelerate the transition to a sustainable future by creating the next-generation of AI powered tools for sustainability and ESG teams on the frontlines of solving the climate crisis.We believe that AI is the key to unlocking the future of sustainable business. With over 50 enterprise clients—including some of the world's largest firms—we’re already transforming how organizations manage their ESG data with AI. Our technology helps sustainability teams uncover actionable insights from unstructured data sources, making it easier to drive compliance, efficiency, and impact at scale.Backed by over €7 million in capital, including a freshly closed funding round, and supported by leading venture capital funds, Briink is at the forefront of ESG innovation. We’re based at the heart of Europe’s AI revolution—the AI Campus in Berlin—where we are building a future where AI helps accelerate the transition to a sustainable future.READ BEFORE APPLYING: Adding ashort intro video ()is mandatory for this position. We do this to get a better sense of candidates before continuing the process and find it really helps. Any application without a video will be rejected by default. Find instructions at the bottom of the post. No cover letter is required. Thank you!Your roleAs Briink’s Senior Backend Engineer, you will work as part of the product and engineering team to bring the cutting edge of LLMs to environmental and sustainability teams and help advance Briink’s mission to use AI to accelerate the transition to a sustainable economy! This includes both using your knowledge and experience as backend engineer to design and build new backend services, as well as helping ensure the scalability, robustness, and maintainability of our platform as it scales. Your main responsibilities will include:Ideate, design and scope new backend functionalityin collaboration with the team to support new AI powered functionality and meet users needsBuild new backend functionalityand deliver on backend tasks, both as a individual contributor and while pair-programming with the team through to production and into the hands of our usersBe the guardian of the backend servicesand ensure they are high quality, maintaining them and striving to improve their robustness as we scaleBe a core member of the product and engineering team.Briink is a collaborative team and we really enjoy working together to build Briink into a successful company that has mission impact at scale. You will therefore work closely as part of a cross-discipline team spanning frontend, backend and AI systems, contributing your thoughts to a range of problems from across the stack as well as the wider business to help ensure all the work we do pushes in the same direction an helps achieve our mission!Your profileTechnical Requirements4+ years of backend engineering experience,ideally building SaaS or AI productsFluency in python:Including strong proficiency with base python as well as modern libraries and frameworks from backend engineering in python (e.g. fastAPI)Experience building APIs: Including experience building modern API services, strong understanding of REST principles, and preferably experience developing production-grade external-facing APIs (e.g. rate-limiting, versioning, client-SDKs, monitoring)Experience with databases:Especially Postgres or other relational database systems, as well as ORMs like sqlalchemy and data migration tooling such as AlembicExperience with Cloud Services:Especially experience building scalable cloud infrastructure and deep familiarly with cloud services beyond compute (preferably in GCP), including experience designing cloud systems that can distribute heavy-processing jobs such as AI workloadsSoftware quality focus:CI/CD, containerization, observability (logging, tracing, metrics), and robust testing practicesFluency in English (C1 level):With the ability to clearly communicate complex topics to diverse stakeholders from both technical and non-technical backgroundsTechnical Nice to havesAI/LLMs:Any hands-on experience with building or working with AI systems and especially LLM systems (either through foundation model providers or OS hosted models) and the challenges of these systems would be a major plusAI agents:Strong interest in AI agents and emerging autonomous system architecturesServerless frameworks:Experience with Modal or other serverless/orchestration frameworks for scalable AI workloadsDistributed-systems:Expertise in distributed-systems patterns (e.g i/o task queue), make code run fast and safely in parallel; testing for speed, load, and failure casesCaching:Hands-on experience with caching layers (e.g Redis) and CDN strategiesIntegration test:Experience with setting up tests (e.g. integration tests)Observability:Experience with advanced observability (logging, metrics, tracing), especially with API services and cloud systemsDomain driven design:Experience with domain-driven design for backend architectureSecurity:Any experience with AuthN/AuthZ (e.g OAuth 2.0, JWT) and secrets management as well as any experience with security/compliance methodologies, such as least-privilege principlesUnderstanding or interest in sustainability:Including an interest in sustainability climate, or ESG topics and a desire to use your skills to help accelerate the climate transitionEven if your experience doesn’t align precisely with all the criteria, we encourage you to apply! This is just our wishlist but many people miss out on opportunities because they feel they don’t fit every requirement—we believe in growth, not perfection!The type of person we're looking for...Technically minded:You enjoy building software product and have experience solving technical challenges in real world settings. Any experience with building backend services for B2B SaaS products and/or AI LLM systems would be a major plus but we’re really looking for technically minded people who enjoy solving hard problems and want to apply their knowledge, experience and energy to building the next generation of AI tools for ESG and sustainability professionalsStrong communicator and collaborator:You communicate proactively and in a structured way, considering trade-offs and keeping different stakeholders informed, with strong ability to communicate clearly, share ideas freely, and are not afraid to admit when we they don’t know something. You have clear communication, both verbal and written, in English, and can build strong internal and external relationships in order to collaborative effectively. You use your strong communication skills to develop clear documentation standards, architectural decision records and a rigorous code-review culture.Low-ego:You understand the importance of being kind and respectful, you practice active listening and help set the tone for healthy and productive communication. You genuinely appreciates others’ contributions and have a high level of trust in others and respects their expertise (while also being confident in their own expertise)Giving and receiving clear, helpful feedback- You are used to giving and receiving feedback and understand how to address issues in a productive and clear way. You give and receive feedback with care and clarity, and always with the intention of making each other better. It would be a major plus if you have any experience and/or enjoy mentoringPragmaticattitude: You can adjust plans, priorities, or approaches when the context changes, whether it’s a product pivot, shifting timelines, or new team structures. You have high personal agency, drive and ability to figure things out, learn and iterate in a positive way and are able to “disagree and commit” where necessary to stay focused on achieving our goals. You are a ‘builder’ and aim to pragmatically integrate AI into real-world products, moving beyond research to create tangible, impactful solutionsWhat we offerCompetitive Remuneration:As a core member of our team, you will receive a competitive salary and equity package, reflecting your ownership of Briink's success and your role in shaping Briink’s futurePurpose-Driven Mission:ESG data has the power to create a more sustainable world, but today it presents more challenges than solutions. We believe AI can change that. Be part of the transition to an AI-powered, sustainable worldFlexible Working:Our work philosophy is built on flexibility. While we do like to come to the office (in Berlin or London) to collaborate in person, this is a hybrid role with opportunities for some remote work within European time zonesTrust and Ownership:At Briink, we empower you to own your projects with the option for growing into new roles. We believe in giving people purpose, mastery and autonomy of their craft and trust to drive your own initiativesDynamic Work Environment:Based at the Merantix AI Campus, Berlin’s hub for AI innovation, you’ll work in a diverse, collaborative environment. With frequent events and opportunities for cross-company collaboration, you’ll be part of a thriving ecosystem of AI startups and expertsQuarterly hackathons:We truly believe in the importance of curiosity and experimentation as both a learning opportunity and strategic advantage. We therefore have a learning budget to explore new technologies and regular hackathons to prototype new ideasREAD BEFORE APPLYING: Adding ashort intro video ()is mandatory for this position. We do this to get a better sense of candidates before continuing the process and find it really helps. Any application without a video will be rejected by default. Find instructions at the bottom of the post. No cover letter is required. Thank you!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQHX0layf3nGjw/company-logo_100_100/company-logo_100_100/0/1671718136637/briinkedin_logo?e=2147483647&v=beta&t=GotQAAEHzUxYhuITacEh0BsPak3gCsw2rWwEHLPtyeg",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Senior AI Developer (m/w/d)",
    "company": "Shift Agency",
    "location": "Frankfurt am Main, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-ai-developer-m-w-d-at-shift-agency-4336096587",
    "posted_date": "15 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGrRisezedGjA/company-logo_100_100/B4EZl6jUX4IUAQ-/0/1758697703317/shiftshift_logo?e=2147483647&v=beta&t=-VF3lRCqZH9Z72PM81HaSHexrLoahRqm-2BKTt2K5mQ",
    "description": "Wir suchenZur Verstärkung unseres Teams suchen wir zum nächstmöglichen Zeitpunkt einen erfahrenen AI Developer (m/w/d), der unsere KI-Projekte vorantreibt und in produktionsreife Lösungen überführt.Als Shift Agency Senior AI Developer (m/w/d) arbeitest Du an den drei zentralen Handlungsfeldern moderner generativer KI-Systeme:Agentische Systeme:Du entwickelst autonome AI-Agenten, die selbstständig Aufgaben planen, Tools nutzen und mehrstufige Workflows ausführen. Dabei implementierst Du Reasoning-Chains, Tool-Calling und Multi-Agent-Orchestrierung.Model Context Protocol (MCP):Du integrierst externe Datenquellen und Services über standardisierte Schnittstellen, ermöglichst kontextbewusste Interaktionen zwischen LLMs und Anwendungssystemen und implementierst sichere Kommunikationsprotokolle.RAG-Architekturen:Du baust Retrieval-Augmented Generation Pipelines auf, optimierst Embedding-Strategien und Vektor-Datenbanken für effiziente Wissensabfragen und verbesserst kontinuierlich Retrieval-Qualität und Relevanz.Als technische Basis bringst Du solide Python-Skills mit, beherrschst moderne LLM-APIs (OpenAI, Anthropic, etc.) und Orchestrierungs-Frameworks (LangChain, LlamaIndex, etc.). Mittels Monitoring- und Evaluations-Tools sorgst Du für Qualität und Stabilität unserer KI-Lösungen.Interessiert? Dann lies weiter.Das sind Deine AufgabenEntwicklung und Implementierung von KI-Anwendungen mit Schwerpunkt auf agentischer Programmierung und Model Context Protocol (MCP)Aufbau und Optimierung von Retrieval‑Augmented‑Generation (RAG) Workflows (Dokumentenaufnahme, Embedding, Indexierung, semantische Suche)Nutzung und Integration von LangChain sowie anderer marktführender Frameworks zur Orchestrierung von LLM‑WorkflowsArbeit mit Vektor‑Datenbanken zur effizienten WissensabfrageEntwicklung und Betreuung von Multi‑Agent‑Systemen und agentischen ArchitekturenMonitoring und Evaluation LLM‑gestützter SystemeDas solltest Du mitbringenErfolgreich abgeschlossenes Informatikstudium oder eine vergleichbare Ausbildung im IT-BereichMindestens 5 Jahre Berufserfahrung in Digital-Agenturen, Startups oder in einem ähnlichen UmfeldErfahrung in der Anwendung von KI-Technologien zur Entwicklung innovativer Lösungen und zur Optimierung von ProzessenErfahrung in agentischer Programmierung und Interesse an MCPErfahrung mit LangChain oder ähnlichen FrameworksSicherer Umgang mit Python und relevanten KI‑BibliothekenKenntnisse in Retrieval‑ und VektorsucheErfahrungen mit LLM‑APIsSolide Kenntnisse in Containerisierung und Deployment mit PipelinesAnalytisches und lösungsorientiertes DenkenBegeisterung für neue Technologien und digitale Trends, insbesondere für KI-EntwicklungenBereitschaft, sich schnell in neue Themen und komplexe Sachverhalte hineinzudenkenSelbständiges und eigenverantwortliches ArbeitenTeamgeist und Freude an innovativen ProjektenSehr gute Deutschkenntnisse und gute Englischkenntnisse in Wort und SchriftDas bieten wir DirSpannende Projekte für namhafte KundenAbwechslungsreiche Aufgaben, Raum für Eigenverantwortung und eigene IdeenSchnelle Entscheidungswege und flache HierarchienArbeiten in einem kompetenten TeamAufgeschlossene, innovative Kolleg:innen und eine entspannte ArbeitsatmosphäreModerne, agile Arbeitsweisen mit cloudbasierten ToolsIndividuelle persönliche Weiterbildungs- und EntwicklungsmöglichkeitenEin attraktives Agenturumfeld direkt am Main und hybrides ArbeitenRegelmäßige gemeinsame Teamaktivitäten wie Wandern, Theater- und Museumsbesuche, MittagessenEinen festen jährlichen Gesundheitszuschuss für Maßnahmen wie Yoga, Rücken-Fitness oder Fitness StudioBetriebliche AltersvorsorgeTeilnahme an unserem Nachhaltigkeits-Programm #greenagencyInteressiert?Dann freuen wir uns über Deine aussagekräftige Bewerbung unter Angabe Deines Eintrittstermins und Deiner Gehaltsvorstellung.Über Shift AgencyWir sind eine inhabergeführte Human-First AI-Driven Agentur aus Frankfurt am Main. Wir unterstützen Unternehmen dabei, die Potenziale der Digitalisierung in Marketing und Vertrieb voll auszuschöpfen - mit kreativer Exzellenz, Leichtigkeit und Technologie.Seit mehr als 25 Jahren entwickelt unser Team digitale Lösungen für große und mittelständische, nationale und internationale Unternehmen. Mit der Integration von Generativer KI begleitet Shift Unternehmen in die neue Ära der Markenkommunikation. Zu unseren Kunden zählen namhafte Marken wie Entega, Frankfurter Buchmesse, Hyundai, Metaplan, PricewaterhouseCoopers und Rabobank.Mehr zu unseren Projekten:https://shift.agency/projekteMehr zu unseren Leistungen:https://shift.agency/leistungenUnser #greenagency Programm:https://shift.agency/greenagencyShift Perspectives:https://shift.agency/perspectives",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGrRisezedGjA/company-logo_100_100/B4EZl6jUX4IUAQ-/0/1758697703317/shiftshift_logo?e=2147483647&v=beta&t=-VF3lRCqZH9Z72PM81HaSHexrLoahRqm-2BKTt2K5mQ",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Data Scientist (all genders welcome)",
    "company": "ROSEN",
    "location": "Lingen, Lower Saxony, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-all-genders-welcome-at-rosen-4274343625",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQHoqmJenV7CDA/company-logo_100_100/company-logo_100_100/0/1714116244044/rosen_logo?e=2147483647&v=beta&t=i4BOelEaLlBsrZHuzBy8upSF25egwdglSxfjXaF-Iq0",
    "description": "Location: Lingen/OsnabrückApply nowWhat you can expectJoin Us in Shaping the Future of AI-Powered Pipeline Evaluation!At ROSEN, we are at the forefront of the digital transformation of critical infrastructure anomaly assessment. As part of our strategic vision, we are developing a state-of-the-art, AI-driven solution designed to modernize our evaluation processes, increase efficiency, and deliver high-quality results to our customers.Our new project is a key pillar of our digital transformation strategy and focuses on cloud-native architectures, advanced AI models and a modern JavaScript technology stack to streamline workflows, modernize the portfolio, and revolutionize how we analyze and interpret pipeline integrity data. By leveraging machine learning, advanced data processing, and cutting-edge web technologies, we aim to significantly reduce cycle times, increase customer satisfaction, and provide an intuitive, seamless user experience.For our development team in Lingen (Ems) or Osnabrück we are looking for aData Scientist (all genders welcome)At ROSEN data science problems are never off-the-shelf problems but require creativity and out-of-the-box thinking to find the right solutionRESPONSIBILITY:Solve real-world business problems by applying machine learning, optimization and statistical models to complex heterogeneous data streamsDesing and develop new models and algorithms to analyze, classify, interpret and align several signal data streamsImplement training and validation pipelines to derive a robust estimate of performance in productionActively support your team in deploying your model as a serviceCollaborate closely with Cloud & Data teams to enable and monitor real-time analyticsEnsure robustness, performance, observability, and scalability of your modelsDrive automation of data evaluation with a zero-incident mindsetWhat you will bringTo become part of the ROSEN family,you are team minded and convince by an independent and structured work behavior. Moreover, you should bring with you:Completed degree or doctorate in information technology, physics, mathematics, computer science or a comparable field of study such as cognitive science or psychology with a focus on data analysis or machine learningMinimum of 5 years professional experience in deep learning, statistics and signal data processingProficiency in the python deep learning ecosystem (python, tensorflow,pytorch, pandas,...)A problem-solving mindset, strong collaboration skills, and a passion for building high-performance systemsSolid experience in deploying models to productionGood German and English language skillsWhat we offerDevelopment opportunities and career opportunities in a global, innovative and long-term oriented group of companies with family characterFlexible working hours & working time accounts as well as partial home office for a good work-life balance (38 hours/week)An open, informal corporate culture, where we celebrate success with social eventsCompatibility of work and family through our company-owned bilingual day care center ROKIDS as well as our bilingual elementary school ROBIGS (optional: day care during the holiday)Employer funded pension and capital accumulation benefitsCompany Restaurant (only in Lingen) and fresh fruit is available dailyVarious in-house sports activities (EGYM Wellpass and other offers)Attractive leasing offers for IT-products and bikes for private useCorporate Benefits - employee offers in changing online shops at top conditionsWho we areThe ROSEN Group is a leading global provider of cutting-edge solutions in all areas of the integrity process chain. Since its beginnings as a one-man business in 1981, ROSEN has grown rapidly and is today a technology group that operates in more than 110 countries with over 4,000 highly qualified employees.ROSEN’s products and services:Inspection of critical industrial assets to ensure reliable operations of the highest standards and effectivenessCustomized engineering consultancy providing efficient asset integrity managementProduction and supply of customized novel products and systemsMarket-driven, topical state-of-the-art research and development providing “added-value” products and servicesFor more information about the ROSEN Group, go to www.rosen-group.com.Do you have any questions?Kerstin LangeRecruitment",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQHoqmJenV7CDA/company-logo_100_100/company-logo_100_100/0/1714116244044/rosen_logo?e=2147483647&v=beta&t=i4BOelEaLlBsrZHuzBy8upSF25egwdglSxfjXaF-Iq0",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "entry_level"
  },
  {
    "title": "Künstliche Intelligenz Entwickler",
    "company": "Neue Osnabrücker Zeitung GmbH & Co. KG",
    "location": "Hamburg, Hamburg, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/k%C3%BCnstliche-intelligenz-entwickler-at-neue-osnabr%C3%BCcker-zeitung-gmbh-co-kg-4336185610",
    "posted_date": "20 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQEg5epK6xWDBg/company-logo_100_100/company-logo_100_100/0/1630462812586/neue_osnabrcker_zeitung_gmbh__co_kg_logo?e=2147483647&v=beta&t=xzijqTMfRYqIbMyaN-Nzr1YZqKdgxVXdn3ML0U6N5f8",
    "description": "Du bist Tech-Talent mit Python-Skills, liebst KI-Innovationen und bringst Ideen in produktive Anwendungen? Gestalte bei uns die Zukunft mit AI: von Chatbots bis Workflows – starte mit uns durch!Wir suchen ab sofort in VollzeitAI Engineer (m/w/d)HamburgHybrides Arbeiten möglichSo Bringst Du Dich EinAnwendungsentwicklung: Du entwickelst Tools mit Python, bindest APIs ein, nutzt Technologien wie Docker oder GCP und arbeitest eng mit UX, Data Science und Cloud Engineering zusammenGenerative KI: Du implementierst Komponenten wie RAG (Retrieval-Augmented Generation), Modell-Fine-Tuning oder Embeddings in produktiven AnwendungenPrompt Engineering: Du schreibst präzise Prompts für Chatbots und Analyse-Tools und entwickelst Best Practices für die SkalierungAutomatisierung: Du baust automatisierte Workflows mit Tools wie make.com oder n8n, um manuelle Prozesse in Vermarktung, Logistik, kaufmännischen Bereichen und Redaktion effizient zu unterstützenEnablement & Trainings: Du teilst dein Wissen aktiv mit Kolleg:innen und hilfst dabei, KI-Kompetenz unternehmensweit zu fördernDas Bringst Du MitProgrammierkenntnisse: Du beherrschst Python und/oder verfügst über Expertise in weiteren relevanten ProgrammiersprachenAI & Data Science: Idealerweise hast du Erfahrungen mit gängigen KI-Techniken und Frameworks wie z.B. LangChain, OpenAI Agents, TensorFlow oder PyTorchCloud-Kenntnisse: Idealerweise hast du Erfahrung mit Google Cloud Platform (GCP) oder anderen Cloud-AnbieternWorkflow-Tools: Erfahrung mit make.com, n8n oder vergleichbaren No-/Low-Code-Tools ist von VorteilKommunikation: Du kommunizierst sicher auf Deutsch (mind. B2) und kannst komplexe technische Zusammenhänge verständlich vermitteln – auch an Nicht-TechiesTeamplayer-Mentalität: Du arbeitest gerne crossfunktional und gestaltest deine Arbeit anschlussfähig für alle DisziplinenDas Bieten Wir DirFlexibilität Hybrides Arbeiten, flexible Arbeitszeiten, Dienstlaptop (auch zur privaten Nutzung) sowie 30 Tage wohlverdienter Urlaub.Altersvorsorge Sorgenfrei alt werden: Betriebliche Altersvorsorge und vermögenswirksame Leistungen.Gesundheit Diverse Angebote für dein Wohlbefinden, z.B. mit Firmenfitness (EGYM Wellpass & Hansefit) und betriebsärztliche Vorsorge.Durstlöscher Ob leckerer Kaffee oder spritziges Wasser - bei uns sitzt niemand auf dem Trockenen.Vergünstigungen Schnäppchenalarm: Vergünstigtes Deutschlandticket, Corporate Benefits, JobLunch, JobBike, Zeitungsabo u.v.m.Familie Family First! Wir unterstützen dich z.B. durch Sonderurlaube oder Zuschuss zur Kinderbetreuung.Weiterbildung Lebenslanges Lernen durch internen Wissensaustausch, Trainings & individuelle Angebote.Veranstaltungen Sommerfest, Teamevents, Firmenläufe & Co. – bei uns ist immer was los.Die Neue Osnabrücker Zeitung steht für die Zukunft im Journalismus auf der Basis einer beeindruckenden Historie. Wir schauen hin, wo andere wegsehen. Wir zeigen Zusammenhänge auf, die kaum einer auf den ersten Blick sieht. Wir erzählen die spannenden Geschichten dort, wo sie unsere User erreichen, auf Bildschirmen aller Art und sogar noch auf Papier. Digital an der Spitze der Bewegung in Deutschland, arbeitet unsere Redaktion für zahlreiche Titel in vier Bundesländern. So sprechen wir Millionen von Leser:innen an. 365 Tage im Jahr.Haben wir dich überzeugt?Dann freuen wir uns auf deine Bewerbung.Neue Osnabrücker Zeitung GmbH & Co. KGRecruiting: Katrin Neehoff0541/310 861 Fachbereich: Daniel Pleus0541/310 869 www.noz-mhn.deEin Unternehmen der",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQEg5epK6xWDBg/company-logo_100_100/company-logo_100_100/0/1630462812586/neue_osnabrcker_zeitung_gmbh__co_kg_logo?e=2147483647&v=beta&t=xzijqTMfRYqIbMyaN-Nzr1YZqKdgxVXdn3ML0U6N5f8",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Specialist Solution Engineer - Marketing Cloud",
    "company": "Salesforce",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/specialist-solution-engineer-marketing-cloud-at-salesforce-4331124731",
    "posted_date": "12 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.Job CategorySalesJob DetailsAbout SalesforceSalesforce is the #1 AI CRM, where humans with agents drive customer success together. Here, ambition meets action. Tech meets trust. And innovation isn’t a buzzword — it’s a way of life. The world of work as we know it is changing and we're looking for Trailblazers who are passionate about bettering business and the world through AI, driving innovation, and keeping Salesforce's core values at the heart of it all.Ready to level-up your career at the company leading workforce transformation in the agentic era? You’re in the right place! Agentforce is the future of AI, and you are the future of Salesforce.Job DescriptionSalesforce is seeking a highly motivated and experienced Lead Solution Engineer to join our dynamic Marketing Cloud team in Austria and Germany. In this pivotal role, you will be a key player in aligning innovative digital marketing strategies with our cutting-edge technology solutions for our most strategic accounts. You will act as a trusted advisor to our clients, architecting how a unified data strategy using Salesforce Data Cloud (CDP) powers personalized customer engagement. If you are passionate about technology, a creative problem-solver, and a compelling storyteller who understands the power of data, we want to hear from you.ResponsibilitiesBusiness Problem Solving: Take on complex business challenges, utilizing research and business assessment to define problems, generate innovative ideas, identify opportunities, and recommend actionable next steps.Solution Development & Innovation: Collaborate with business stakeholders and technical teams to identify and address challenges and goals related to digital marketing. Develop comprehensive solutions and roadmaps that leverage the full power of the Marketing Cloud, including designing how Salesforce Data Cloud (CDP) can be used to create a single source of truth for hyper-personalized customer experiences.Engaging Demonstrations: Showcase the power of the Salesforce Marketing Cloud and Data Cloud through compelling software demonstrations and rapid prototyping. Deliver executive-level presentations that illustrate how connected, data-driven customer experiences are brought to life.Strategic Guidance: Construct future-state customer journey strategies and develop long-term IT roadmaps for our clients. Assist the customer, Account Executive, and Professional Services teams with discovery, analysis, and strategic solution recommendations centered on data activation.Thought Leadership & Continuous Learning: Stay current on product developments, industry trends, and new technologies, with a special focus on Customer Data Platforms and data-driven marketing. Act as a thought leader in the marketing technology space, sharing your expertise with clients and internal teams.Team Collaboration: Support the wider Marketing Cloud team and other business units to achieve excellent customer outcomes and drive growth.QualificationsExperience: 5+ years of experience in a similar role such as Solution Engineering, Digital Marketing, or technical consulting, with a strong focus on marketing technology and customer engagement solutions.Technical Proficiency: A strong technical understanding of data-driven solutions. This includes a deep knowledge of Salesforce Data Cloud (formerly Salesforce CDP) and a clear understanding of how to leverage customer data platforms. Knowledge of programming languages (e.g., Ampscript), integrations, and APIs is also required. A minimum of 2 years of hands-on experience with Salesforce Marketing Cloud is highly preferred.Industry Expertise: Experience in B2C industries such as Retail, Consumer Goods, or Financial Services, with a solid understanding of both B2B and B2C marketing dynamics.Presentation and Communication Skills: Excellent communication and presentation skills, with the ability to persuasively present complex technical and data-centric concepts to a variety of audiences, from technical teams to C-level executives.Strategic Mindset: Proven ability to develop and articulate a strategic vision for utilizing marketing and data technologies to drive business outcomes and enhance customer experiences.Problem-Solving Skills: A creative and analytical problem-solver who is a self-starter and can effectively lead and prioritize in a fast-paced environment.Collaborative Spirit: A team player with a proven track record of working effectively with cross-functional teams, including sales, product management, and customer success.Language Skills: Fluency in both German and English is required.Unleash Your PotentialWhen you join Salesforce, you’ll be limitless in all areas of your life. Our benefits and resources support you to find balance andbe your best, and our AI agents accelerate your impact so you cando your best. Together, we’ll bring the power of Agentforce to organizations of all sizes and deliver amazing experiences that customers love. Apply today to not only shape the future — but to redefine what’s possible — for yourself, for AI, and the world.AccommodationsIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.We warmly invite applications from individuals with a severe disability status (Schwerbehinderung). Salesforce is committed to equality and creating a workplace that reflects society. We set ambitious goals for representation, emphasize accessibility and inclusion, and continuously learn and improve. Learn more about our inclusion initiatives here (https://www.salesforce.com/company/accessibility/workplace-resources/#ally-sf-benefits). In 2019, Salesforce joined The Valuable 500 to champion disability inclusion in business leadership.Posting StatementSalesforce is an equal opportunity employer and maintains a policy of non-discrimination with all employees and applicants for employment. What does that mean exactly? It means that at Salesforce, we believe in equality for all. And we believe we can lead the path to equality in part by creating a workplace that’s inclusive, and free from discrimination. Know your rights: workplace discrimination is illegal. Any employee or potential employee will be assessed on the basis of merit, competence and qualifications – without regard to race, religion, color, national origin, sex, sexual orientation, gender expression or identity, transgender status, age, disability, veteran or marital status, political viewpoint, or other classifications protected by law. This policy applies to current and prospective employees, no matter where they are in their Salesforce employment journey. It also applies to recruiting, hiring, job assignment, compensation, promotion, benefits, training, assessment of job performance, discipline, termination, and everything in between. Recruiting, hiring, and promotion decisions at Salesforce are fair and based on merit. The same goes for compensation, benefits, promotions, transfers, reduction in workforce, recall, training, and education.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Senior TypeScript Full Stack Developer (all)",
    "company": "Sonia",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-typescript-full-stack-developer-all-at-sonia-4340875362",
    "posted_date": "18 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQF5ZEGlIne7Wg/company-logo_100_100/company-logo_100_100/0/1697103371036/soniasolutions_logo?e=2147483647&v=beta&t=fgf1UAjT4ZPMa5Z1PUBL9dsgq7CEAqtPVQ7oq8xvaXM",
    "description": "Let me introduce...With Sonia, doctors are successful doctors. We create and deploy AI enhanced solutions that make doctors’ lives easier, patients’ care better, and healthcare systems more efficient. If you’re proactive, impact-driven, and ready to shape the future of healthcare, join us.This is what you’ll ownWe’re looking for aSenior Full-Stack Engineer(all)to help us build modern, high-performing web applications. You’ll play a key role in shaping our architecture, mentoring team members, and contributing to the scalability of our product.Design and implementrobust, scalable full-stack web applicationsWrite clean, maintainable, and testable codefollowing best practicesCollaborate on architecture decisionsand long-term technical planningOptimize application performanceand improve system reliabilityMentor junior developersand support their growthConduct code reviewsand share constructive feedbackContribute to technical documentationand knowledge sharingYou’ll thrive in this role if you bring8+ years of professional software development experienceStrong expertise inTypeScript / JavaScriptandNode.jsProven experience withReactand modern front-end developmentSolid understanding offull-stack development principlesHands-on experience withORM tools, especiallyPrismaExperience inbackend development with Node.jsFamiliarity withRESTful API design and implementationUnderstanding ofCI/CD pipelinesProficiency withGit version controlExperience withdatabase design and data modelingNice to HaveFamiliarity withChakra UIExperience withtesting frameworks(e.g., Playwright, Vitest)Why you’ll love working with usAn engineering-driven culture with modern tools and clean code practicesA product-focused environment where quality and performance matterA collaborative team that values learning, pragmatism, and ownershipAttractive compensation aligned with your skillsFlexible work arrangements30 days of vacation per yearReady to apply?If you enjoy building meaningful relationships, driving customer satisfaction, and contributing to the transformation of healthcare, we’d love to hear from you!I'm Margarita and will be guiding you through the application process.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQF5ZEGlIne7Wg/company-logo_100_100/company-logo_100_100/0/1697103371036/soniasolutions_logo?e=2147483647&v=beta&t=fgf1UAjT4ZPMa5Z1PUBL9dsgq7CEAqtPVQ7oq8xvaXM",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "entry_level"
  },
  {
    "title": "Senior Staff Software Integration Engineer (f/m/d)",
    "company": "Orbem",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-staff-software-integration-engineer-f-m-d-at-orbem-4336168577",
    "posted_date": "2 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQEZeTccU5y7nw/company-logo_100_100/company-logo_100_100/0/1637160940545/orbem_ai_logo?e=2147483647&v=beta&t=EwQrA8QagPUuMcH_S2_wCkAG4grLS1Jgj9m1w2AAKac",
    "description": "Job DescriptionOrbem is an impact-driven deep-tech scaleup with global reach, founded in Munich, Germany and now expanding internationally with our newest office in Houston, Texas.We develop fast, accurate, and accessible imaging solutions that provide access to otherwise unattainable sources of knowledge.We seek to make a difference – and develop solutions to sustainably feed the world, accelerate the transition to a green economy, and transform disease detection.Join us on our mission to unleash AI-powered imaging for everything and everyone.Senior Staff Software Integration Engineer (f/m/d)Starting date: As soon as possibleYearly Salary: € 100,000 - € 110,000 in yearly salaryEquity: € 80,000 - € 120,000 in company sharesBenefits: Up to €5,000 annuallyWork model: Full-time, Hybrid in MunichYour roleWe’re looking for a Senior Staff Software Integration Engineer tolead the technical integration of our software stack across diverse industrial imaging products. In this pivotal role, you will drive the development of architectures that support Orbem’s rapid growth and global impact.You’ll bring deep technical expertise and leadership to tackle complex system integrations, define and uphold engineering standards, and guide senior engineers across multiple teams. Your work will be foundational tobuilding a scalable, robust platform that powers our cutting-edge AI imaging technology.Your day to dayGuide the architecture of Orbem’s industrial software platform, ensuring it is scalable, reliable, and adaptable across diverse applications.Lead strategic refactoring efforts to streamline development and improve maintainability.Tackle complex integration challenges hands-on—working with industrial automation systems, sensors, MRI technology, and edge AI/ML solutions.Promote engineering excellence by driving pragmatic best practices in testing, architecture, and software quality, always balancing technical rigor with business goals.Build foundational platform components that accelerate the development and deployment of new applications by our product teams.Job requirementsYour Experiences And SkillsFit to our valuesWe own every challenge: we enjoy complexity and thrive under uncertainty.We strive for better: we seize any opportunity for growth and challenge the status quo. We are constantly learning and improving.We imagine new frontiers: we think beyond ‘doable’ and ‘reasonable.’ We design a sustainable and healthy future together.Technical ExpertiseAdvanced Python proficiency with a track record of building and deploying complex, scalable software systems in production environments.Deep expertise in modern infrastructure, including Docker, Kubernetes (k3s), Linux, and CI/CD pipelines for edge or embedded systems.Hands-on integration experience with industrial hardware, sensor technologies, and deploying AI/ML models on edge devices.Architectural ownership of large-scale software platforms, demonstrating a deep understanding of resilient system design and real-world trade-offs.Proven success in refactoring and unifying complex legacy codebases into cohesive, maintainable, and well-tested platforms.Leadership and business acumenProven technical leadership on large-scale, cross-functional initiatives, successfully guiding complex projects that span multiple engineering teams.Strategic influence in shaping the long-term technical roadmap for a product or platform, ensuring engineering decisions align with business goals.High technical judgment and a pragmatic approach to decision-making, with a demonstrated ability to balance deep technical work with product deadlines.Fit to our technical cultureWe are in a journey towards a technical culture that values:Knowledge sharing and social coding.Experimentation and learning from failures.Robust testing and simplicity in design.Continuous improvement through rapid feedback from production.Aligning our technology with our business domains.What Makes You Stand Out From Other CandidatesA genuine passion for using technology to solve real-world challenges in food sustainability or human health.Direct experience with MRI, medical imaging, or other complex sensor-based data acquisition systems.Experience with IoT technologies and industrial automation solutions.Experience thriving in a fast-paced scaleup environment, with a knack for navigating ambiguity and driving technical change.Experience in formal architectural governance, such as participating in or leading a technical steering committee.What We OfferInternational Environment:Join a team with 40+ nationalities across 5 continents, all driven by a shared purpose: shedding light on the world’s toughest challenges.Attractive Compensation PackageStock Options: Share in Orbem’s success.Visa & Relocation Support: Seamless support for your move to Germany.Learning & Development: €1,750 annual budget for personal growth.Fitness Membership: Access to Urban Sports Club or Wellpass.Childcare Reimbursement: Support for Kita/Kindergarten fees.Deutschland Ticket: Full coverage of public transportation.Work-Life IntegrationFlexible Hours & Home Office: Work when and where it suits you.WFH Perks: Get €185 to upgrade your home office + a sleek external monitor on us!30 Days Paid Leave: Plenty of time to recharge.Personal Leave: Flexibility for life’s important moments.Work from Anywhere: Experience new cultures and environments for up to 60 days per year.Make a Difference:Join an ambitious, fast-growing team working on breakthrough technology. In our scale-up environment, you’ll have the freedom to lead your projects and make an impact. We provide a platform for you to explore, innovate, and define your vision for the future. At Orbem, we’re committed to helping you discover your strengths, and while we aim to teach you, we also want to learn from you.Your teamAs aSeniorStaff Software Integration Engineer,you become part of our diverse and international team. Learn more about the team members, their work and challenges here: www.orbem.aiAt Orbem, we're committed to building a smart, diverse team, and we recognize that self-doubt can prevent talented individuals from applying. If you feel you don't meet every requirement, we'd love to hear from you anyway!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQEZeTccU5y7nw/company-logo_100_100/company-logo_100_100/0/1637160940545/orbem_ai_logo?e=2147483647&v=beta&t=EwQrA8QagPUuMcH_S2_wCkAG4grLS1Jgj9m1w2AAKac",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Specialist Solution Engineer - Marketing Cloud",
    "company": "Salesforce",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/specialist-solution-engineer-marketing-cloud-at-salesforce-4331126753",
    "posted_date": "12 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.Job CategorySalesJob DetailsAbout SalesforceSalesforce is the #1 AI CRM, where humans with agents drive customer success together. Here, ambition meets action. Tech meets trust. And innovation isn’t a buzzword — it’s a way of life. The world of work as we know it is changing and we're looking for Trailblazers who are passionate about bettering business and the world through AI, driving innovation, and keeping Salesforce's core values at the heart of it all.Ready to level-up your career at the company leading workforce transformation in the agentic era? You’re in the right place! Agentforce is the future of AI, and you are the future of Salesforce.Job DescriptionSalesforce is seeking a highly motivated and experienced Lead Solution Engineer to join our dynamic Marketing Cloud team in Austria and Germany. In this pivotal role, you will be a key player in aligning innovative digital marketing strategies with our cutting-edge technology solutions for our most strategic accounts. You will act as a trusted advisor to our clients, architecting how a unified data strategy using Salesforce Data Cloud (CDP) powers personalized customer engagement. If you are passionate about technology, a creative problem-solver, and a compelling storyteller who understands the power of data, we want to hear from you.ResponsibilitiesBusiness Problem Solving: Take on complex business challenges, utilizing research and business assessment to define problems, generate innovative ideas, identify opportunities, and recommend actionable next steps.Solution Development & Innovation: Collaborate with business stakeholders and technical teams to identify and address challenges and goals related to digital marketing. Develop comprehensive solutions and roadmaps that leverage the full power of the Marketing Cloud, including designing how Salesforce Data Cloud (CDP) can be used to create a single source of truth for hyper-personalized customer experiences.Engaging Demonstrations: Showcase the power of the Salesforce Marketing Cloud and Data Cloud through compelling software demonstrations and rapid prototyping. Deliver executive-level presentations that illustrate how connected, data-driven customer experiences are brought to life.Strategic Guidance: Construct future-state customer journey strategies and develop long-term IT roadmaps for our clients. Assist the customer, Account Executive, and Professional Services teams with discovery, analysis, and strategic solution recommendations centered on data activation.Thought Leadership & Continuous Learning: Stay current on product developments, industry trends, and new technologies, with a special focus on Customer Data Platforms and data-driven marketing. Act as a thought leader in the marketing technology space, sharing your expertise with clients and internal teams.Team Collaboration: Support the wider Marketing Cloud team and other business units to achieve excellent customer outcomes and drive growth.QualificationsExperience: 5+ years of experience in a similar role such as Solution Engineering, Digital Marketing, or technical consulting, with a strong focus on marketing technology and customer engagement solutions.Technical Proficiency: A strong technical understanding of data-driven solutions. This includes a deep knowledge of Salesforce Data Cloud (formerly Salesforce CDP) and a clear understanding of how to leverage customer data platforms. Knowledge of programming languages (e.g., Ampscript), integrations, and APIs is also required. A minimum of 2 years of hands-on experience with Salesforce Marketing Cloud is highly preferred.Industry Expertise: Experience in B2C industries such as Retail, Consumer Goods, or Financial Services, with a solid understanding of both B2B and B2C marketing dynamics.Presentation and Communication Skills: Excellent communication and presentation skills, with the ability to persuasively present complex technical and data-centric concepts to a variety of audiences, from technical teams to C-level executives.Strategic Mindset: Proven ability to develop and articulate a strategic vision for utilizing marketing and data technologies to drive business outcomes and enhance customer experiences.Problem-Solving Skills: A creative and analytical problem-solver who is a self-starter and can effectively lead and prioritize in a fast-paced environment.Collaborative Spirit: A team player with a proven track record of working effectively with cross-functional teams, including sales, product management, and customer success.Language Skills: Fluency in both German and English is required.Unleash Your PotentialWhen you join Salesforce, you’ll be limitless in all areas of your life. Our benefits and resources support you to find balance andbe your best, and our AI agents accelerate your impact so you cando your best. Together, we’ll bring the power of Agentforce to organizations of all sizes and deliver amazing experiences that customers love. Apply today to not only shape the future — but to redefine what’s possible — for yourself, for AI, and the world.AccommodationsIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.We warmly invite applications from individuals with a severe disability status (Schwerbehinderung). Salesforce is committed to equality and creating a workplace that reflects society. We set ambitious goals for representation, emphasize accessibility and inclusion, and continuously learn and improve. Learn more about our inclusion initiatives here (https://www.salesforce.com/company/accessibility/workplace-resources/#ally-sf-benefits). In 2019, Salesforce joined The Valuable 500 to champion disability inclusion in business leadership.Posting StatementSalesforce is an equal opportunity employer and maintains a policy of non-discrimination with all employees and applicants for employment. What does that mean exactly? It means that at Salesforce, we believe in equality for all. And we believe we can lead the path to equality in part by creating a workplace that’s inclusive, and free from discrimination. Know your rights: workplace discrimination is illegal. Any employee or potential employee will be assessed on the basis of merit, competence and qualifications – without regard to race, religion, color, national origin, sex, sexual orientation, gender expression or identity, transgender status, age, disability, veteran or marital status, political viewpoint, or other classifications protected by law. This policy applies to current and prospective employees, no matter where they are in their Salesforce employment journey. It also applies to recruiting, hiring, job assignment, compensation, promotion, benefits, training, assessment of job performance, discipline, termination, and everything in between. Recruiting, hiring, and promotion decisions at Salesforce are fair and based on merit. The same goes for compensation, benefits, promotions, transfers, reduction in workforce, recall, training, and education.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Specialist Solution Engineer - Marketing Cloud",
    "company": "Salesforce",
    "location": "Cologne Bonn Region",
    "job_link": "https://de.linkedin.com/jobs/view/specialist-solution-engineer-marketing-cloud-at-salesforce-4331124732",
    "posted_date": "13 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.Job CategorySalesJob DetailsAbout SalesforceSalesforce is the #1 AI CRM, where humans with agents drive customer success together. Here, ambition meets action. Tech meets trust. And innovation isn’t a buzzword — it’s a way of life. The world of work as we know it is changing and we're looking for Trailblazers who are passionate about bettering business and the world through AI, driving innovation, and keeping Salesforce's core values at the heart of it all.Ready to level-up your career at the company leading workforce transformation in the agentic era? You’re in the right place! Agentforce is the future of AI, and you are the future of Salesforce.Job DescriptionSalesforce is seeking a highly motivated and experienced Lead Solution Engineer to join our dynamic Marketing Cloud team in Austria and Germany. In this pivotal role, you will be a key player in aligning innovative digital marketing strategies with our cutting-edge technology solutions for our most strategic accounts. You will act as a trusted advisor to our clients, architecting how a unified data strategy using Salesforce Data Cloud (CDP) powers personalized customer engagement. If you are passionate about technology, a creative problem-solver, and a compelling storyteller who understands the power of data, we want to hear from you.ResponsibilitiesBusiness Problem Solving: Take on complex business challenges, utilizing research and business assessment to define problems, generate innovative ideas, identify opportunities, and recommend actionable next steps.Solution Development & Innovation: Collaborate with business stakeholders and technical teams to identify and address challenges and goals related to digital marketing. Develop comprehensive solutions and roadmaps that leverage the full power of the Marketing Cloud, including designing how Salesforce Data Cloud (CDP) can be used to create a single source of truth for hyper-personalized customer experiences.Engaging Demonstrations: Showcase the power of the Salesforce Marketing Cloud and Data Cloud through compelling software demonstrations and rapid prototyping. Deliver executive-level presentations that illustrate how connected, data-driven customer experiences are brought to life.Strategic Guidance: Construct future-state customer journey strategies and develop long-term IT roadmaps for our clients. Assist the customer, Account Executive, and Professional Services teams with discovery, analysis, and strategic solution recommendations centered on data activation.Thought Leadership & Continuous Learning: Stay current on product developments, industry trends, and new technologies, with a special focus on Customer Data Platforms and data-driven marketing. Act as a thought leader in the marketing technology space, sharing your expertise with clients and internal teams.Team Collaboration: Support the wider Marketing Cloud team and other business units to achieve excellent customer outcomes and drive growth.QualificationsExperience: 5+ years of experience in a similar role such as Solution Engineering, Digital Marketing, or technical consulting, with a strong focus on marketing technology and customer engagement solutions.Technical Proficiency: A strong technical understanding of data-driven solutions. This includes a deep knowledge of Salesforce Data Cloud (formerly Salesforce CDP) and a clear understanding of how to leverage customer data platforms. Knowledge of programming languages (e.g., Ampscript), integrations, and APIs is also required. A minimum of 2 years of hands-on experience with Salesforce Marketing Cloud is highly preferred.Industry Expertise: Experience in B2C industries such as Retail, Consumer Goods, or Financial Services, with a solid understanding of both B2B and B2C marketing dynamics.Presentation and Communication Skills: Excellent communication and presentation skills, with the ability to persuasively present complex technical and data-centric concepts to a variety of audiences, from technical teams to C-level executives.Strategic Mindset: Proven ability to develop and articulate a strategic vision for utilizing marketing and data technologies to drive business outcomes and enhance customer experiences.Problem-Solving Skills: A creative and analytical problem-solver who is a self-starter and can effectively lead and prioritize in a fast-paced environment.Collaborative Spirit: A team player with a proven track record of working effectively with cross-functional teams, including sales, product management, and customer success.Language Skills: Fluency in both German and English is required.Unleash Your PotentialWhen you join Salesforce, you’ll be limitless in all areas of your life. Our benefits and resources support you to find balance andbe your best, and our AI agents accelerate your impact so you cando your best. Together, we’ll bring the power of Agentforce to organizations of all sizes and deliver amazing experiences that customers love. Apply today to not only shape the future — but to redefine what’s possible — for yourself, for AI, and the world.AccommodationsIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.We warmly invite applications from individuals with a severe disability status (Schwerbehinderung). Salesforce is committed to equality and creating a workplace that reflects society. We set ambitious goals for representation, emphasize accessibility and inclusion, and continuously learn and improve. Learn more about our inclusion initiatives here (https://www.salesforce.com/company/accessibility/workplace-resources/#ally-sf-benefits). In 2019, Salesforce joined The Valuable 500 to champion disability inclusion in business leadership.Posting StatementSalesforce is an equal opportunity employer and maintains a policy of non-discrimination with all employees and applicants for employment. What does that mean exactly? It means that at Salesforce, we believe in equality for all. And we believe we can lead the path to equality in part by creating a workplace that’s inclusive, and free from discrimination. Know your rights: workplace discrimination is illegal. Any employee or potential employee will be assessed on the basis of merit, competence and qualifications – without regard to race, religion, color, national origin, sex, sexual orientation, gender expression or identity, transgender status, age, disability, veteran or marital status, political viewpoint, or other classifications protected by law. This policy applies to current and prospective employees, no matter where they are in their Salesforce employment journey. It also applies to recruiting, hiring, job assignment, compensation, promotion, benefits, training, assessment of job performance, discipline, termination, and everything in between. Recruiting, hiring, and promotion decisions at Salesforce are fair and based on merit. The same goes for compensation, benefits, promotions, transfers, reduction in workforce, recall, training, and education.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQHZ9xYomLW7zg/company-logo_100_100/company-logo_100_100/0/1630658255326/salesforce_logo?e=2147483647&v=beta&t=qTOWgVlA05Oyq4_yQSi790-w_uu88NQ3SNcgh9xl738",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Senior Software Engineer Embedded Linux/Android",
    "company": "HeadborneAI",
    "location": "Jena, Thuringia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-software-engineer-embedded-linux-android-at-headborneai-4340547030",
    "posted_date": "1 day ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGmXdfrAGAnfw/company-logo_100_100/B4EZnYqtA_J0AQ-/0/1760276698015?e=2147483647&v=beta&t=gqeuhGtHx5iPMra984urbPGVuOgtVq17KGpO2TYAjGI",
    "description": "About HEADBORNE.AISafe, mission-based AI solutions for first responders and defense.HEADBORNE's long-term mission is to defend free democracies of the world with ethical, interoperable, mission-based safe AI solutions for first responders, defense forces, and decision makers. We build a secure, AI-driven Cloud/OS platform integrated in the next generations of AR smart glasses, helmets, drones, robots, and training systems. We seamlessly connect them across air, land, sea, space, and cyberspace, delivering complete situational awareness, control, and command.About the RoleHEADBORNE seeks a Senior Embedded Linux/Android Software Engineer to join our rapidly growing team. Our core systems engineers are building the embedded intelligence behind next-generation AI edge devices for defense, forces and first responders.You will develop and integrate software for AI-enabled systems, driving advanced sensing, communications, and SOC/MCU integration. This is a hands-on, high-impact role spanning embedded architecture, system optimization, and mission-critical software reliability.We're looking for a brilliant, motivated engineer to join TEAM HEADBORNE—delivering mission-based, safe AI solutions that matter.ResponsibilitiesOwn and lead the implementation of software solutions for mission-critical imaging systems.Write efficient, well-tested code in C++ and PythonDevelop low-latency, high-bandwidth processing pipelines for airborne imaging sensors.Jump into and understand large codebases.Develop device drivers and perform hardware integration (IMX 95, AR Vision, Wi-Fi, Bluetooth, Audio, LCD, Backlight, Power Management, Battery/Charger management, Camera).Perform board bring-up, bootloader customization, and root filesystem generation.Integrate and adapt open-source software for embedded platforms.Define and implement embedded software architectures (daemons, libraries, device drivers).Collaborate with hardware engineers to define embedded hardware architectures.Contribute to team leadership, project management, and cross-functional collaboration.Develop and maintain server-side administration tools (package management, deployment, and build systems).Required QualificationsBS, MS, or PhD in Computer Science, Mathematics, Physics, or related field—or equivalent professional experience.5+ years of professional software development experience in a Linux environment.Expertise in C++ and Python.Experience in embedded software development (Linux/Android).Strong understanding of Linux command-line tools and system administration.Experience troubleshooting and analyzing remotely deployed software systems.Proficiency in English and German.Right to work in Germany, without sponsorship.Eligibility for German security clearances.Self-motivated, organized, and collaborative.Preferred QualificationsKnowledge of image processing and computer vision concepts.Ability to read and interpret electronic schematics.Experience with board-level debugging and system bring-up.Familiarity with Jenkins or similar CI/CD systems.LocationThis in-person role is based in Jena, Germany. Candidates are expected to be located near Jena or open to relocation.HEADBORNE.AI is an equal-opportunity employer, and we encourage candidates from all backgrounds to apply.What We OfferDefend free democracies through mission-based, safe AI solutionsClosely collaborate with a small, international team of world-leading experts on cutting-edge AI-driven systemsEarn a competitive salaryReceive highly competitive stock options",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGmXdfrAGAnfw/company-logo_100_100/B4EZnYqtA_J0AQ-/0/1760276698015?e=2147483647&v=beta&t=gqeuhGtHx5iPMra984urbPGVuOgtVq17KGpO2TYAjGI",
    "in_time_range": false,
    "time_note": "This job is not in your time range",
    "experience_level": "internship"
  },
  {
    "title": "Avionics Systems Engineer - Communication",
    "company": "Helsing",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/avionics-systems-engineer-communication-at-helsing-4272187535",
    "posted_date": "15 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "description": "Who We AreHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.As democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.We are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.The roleAs an Avionics Systems Engineer for communication, you will be responsible for defining the end-to-end architecture for airborne communication systems, spanning data, voice and mission critical data links. You will collaborate with industry partners and work closely with platform teams to integrate emerging technology onto air platforms. In this role you will engage with a diverse range of partners, suppliers and government stakeholders to align on standards and interoperability.Your work will be central to shaping the future of airborne mission systems. You will be responsible not only for defining the system, but also driving it through all development stages and ultimately onto the platform.In achieving this goal you will work with a diverse, high-calibre team of experts, strategists and partners.The day-to-dayLead the system design and development of airborne and ground-based communication architectures, leveraging modern technologiesManage the relationship with stakeholders, partners, suppliers and government stakeholdersManage the systems engineering lifecycle, from requirements development to qualification.Prepare and supervise tests at system and aircraft level, including flight testsCreate the certification and compliance documentation. Ensure adherence to aviation and regulatory standards throughout the development lifecycleProvide regular reporting on project status and technical changes to Chief Engineering and Programme ManagementYou should apply if youHold a relevant degree such as a Bachelor's or Master's in Aerospace Engineering, Electrical Engineering, Computer Science, or a related fieldHave led the design and development of a military or civil communication system for an air platformHave a deep knowledge of military and civil communication technology, including Software defined radios, data links, air to air and air to ground communications, cybersecurity, RF comms and SATCOM, Network management, jamming, antenna design, Electronic warfare, secure commsYou have familiarity with systems engineering, aircraft certification, and avionics integrationHave excellent communication skills and the ability to report and present findings clearly and efficiently both internally and externally.Are passionate about keeping up to date with current research and technology.Note: We operate in an industry where women, as well as other minority groups, are systematicallyunder-represented. We encourage you to apply even if you don’t meet all the listed qualifications; ability and impact cannot be summarised in a few bullet points.Join Helsing and work with world-leading experts in their fieldsHelsing’s work is important. You’ll be directly contributing to the protection of democratic countries while balancing both ethical and geopolitical concernsThe work is unique. We operate in a domain that has highly unusual technical requirements and constraints, and where robustness, safety, and ethical considerations are vital. You will face unique Engineering and AI challenges that make a meaningful impact in the worldOur work frequently takes us right up to the state of the art in technical innovation, be it reinforcement learning, distributed systems, generative AI, or deployment infrastructure. The defence industry is entering the most exciting phase of the technological development curve. Advances in our field of world are not incremental: Helsing is part of, and often leading, historic leaps forwardIn our domain, success is a matter of order-of-magnitude improvements and novel capabilities. This means we take bets, aim high, and focus on big opportunities. Despite being a relatively young company, Helsing has already been selected for multiple significant government contractsWe actively encourage healthy, proactive, and diverse debate internally about what we do and how we choose to do it. Teams and individual engineers are trusted (and encouraged) to practise responsible autonomy and critical thinking, and to focus on outcomes, not conformity. At Helsing you will have a say in how we (and you!) work, the opportunity to engage on what does and doesn’t work, and to take ownership of aspects of our culture that you care deeply aboutWhat we offerA focus on outcomes, not time-trackingCompetitive compensation and stock optionsRelocation supportSocial and education allowancesRegular company events and all-hands to bring together employees as one team across EuropeA hands-on onboarding program (affectionately labelled “Infraduction”), in which you will be building tooling and applications to be used across the company. This is your opportunity to learn our tech stack, explore the company, and learn how we get things done - all whilst working with other engineering teams from day oneHelsing is an equal opportunities employer. We are committed to equal employment opportunity regardless of race, religion, sexual orientation, age, marital status, disability or gender identity. Please do not submit personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, data concerning your health, or data concerning your sexual orientation.Helsing's Candidate Privacy and Confidentiality Regime can be found here.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Lead Manufacturing Engineer - Mechatronic Systems",
    "company": "Helsing",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-manufacturing-engineer-mechatronic-systems-at-helsing-4291788979",
    "posted_date": "15 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "description": "Who We AreHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.As democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.We are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.The roleThe Lead / Team Leader Manufacturing Engineer is a seasoned professional providing technical leadership and strategic direction to a team of manufacturing engineers, with a specialised focus on the production of complex mechatronic systems. This pivotal role is responsible for orchestrating the definition, planning, and realisation of manufacturing processes for integrated mechanical, electrical, and software components. The Team Leader guides the team in ensuring robust Design for Manufacturability (DFM), Design for Assembly (DFA), and Design for Testability (DFT) from the earliest product development stages for products like robotics, automated machinery, or smart devices. This includes meticulously planning and optimising assembly, integration, and testing processes, defining optimal cycle times, proactively identifying and mitigating potential bottlenecks, and overseeing the successful implementation and ramp-up of new production lines and technologies. This leadership position is crucial in transforming innovative mechatronic designs into high-quality, cost-effective, and scalable products, all while fostering a culture of technical excellence and continuous improvement within the team.The day-to-dayTechnical Leadership & Mentorship: Provide expert technical leadership, guidance, and mentorship to a team of Manufacturing Engineers, fostering their continuous learning, technical growth, and professional development in the context of mechatronic system production.Strategic Process Planning & Oversight for Mechatronics: Lead the strategic planning, definition, and realization of complex new manufacturing, assembly, integration, and testing processes specifically for mechatronic systems for New Product Introductions (NPI) or significant design changes. Oversee the entire lifecycle from concept to full-scale production.DFM/DFA/DFT Authority & Collaboration: Act as the ultimate technical authority and primary interface for Design for Manufacturability (DFM), Design for Assembly (DFA), and critically, Design for Testability (DFT) for integrated mechatronic products. Lead the collaboration with mechanical, electrical, and software design engineering teams to proactively influence product designs for optimal production efficiency, ease of integration, comprehensive test coverage, cost-effectiveness, and reliability.Capacity & Throughput Optimization: Guide the team in conducting detailed analysis and planning for manufacturing capacities, defining optimal cycle times (Taktzeiten) for complex mechatronic assembly and test sequences, performing line balancing, and leading efforts to achieve target throughput and overall equipment effectiveness (OEE).Bottleneck Management & Risk Mitigation for Integrated Systems: Proactively identify potential bottlenecks, inefficiencies, and risks in planned manufacturing, assembly, and testing processes specific to mechatronic systems. Direct the team in developing and implementing alternative solutions, process improvements, or equipment strategies to prevent and resolve production constraints, particularly those arising from component integration.Tooling, Equipment & Automation Strategy: Develop and oversee the strategy for the specification, design, procurement, and qualification of new manufacturing tools, assembly fixtures, specialized test equipment, and advanced automation solutions tailored for mechatronic product lines.New Product Introduction (NPI) Leadership: Own the manufacturing plan for NPIs involving mechatronic systems, overseeing the setup and validation of new assembly and test lines, managing pilot runs, and supporting the successful ramp-up to full-scale production, ensuring process stability, yield targets, and budget adherence for complex integrated products.Process Validation & Control Excellence: Ensure the establishment and rigorous implementation of robust process control plans and lead thorough validation activities (e.g., IQ/OQ/PQ) and statistical process capability studies (CpK, PpK) for all new and modified processes, especially concerning the integration and performance of mechatronic modules.Continuous Improvement & Lean/Six Sigma Champion: Champion the application of Lean Manufacturing principles (e.g., Value Stream Mapping, SMED, Poka-Yoke) and Six Sigma methodologies across all team activities, driving significant continuous improvement initiatives, waste reduction, and efficiency gains in the assembly and test of mechatronic products.Project & Resource Management: Manage project scope, budgets, resources, milestones, and timelines for complex manufacturing engineering projects related to mechatronic systems, ensuring successful delivery against agreed objectives and key performance indicators.Team Development & Recruiting: Participate in recruiting activities, candidate evaluation, and drive team development and growth initiatives, including performance reviews and goal setting.You should apply if youBachelor's degree in Manufacturing Engineering, Mechatronic Engineering, Robotics, Electrical Engineering, Mechanical Engineering with a strong mechatronics focus, or a closely related technical field from an accredited institution. A Master's degree or specific certifications (e.g., Six Sigma Black Belt, PMP) are often advantageous.Minimum of 5+ years of progressive experience in manufacturing engineering, with a significant portion dedicated to the assembly, integration, and testing of complex mechatronic systems (e.g., robotics, industrial automation, medical devices, consumer electronics with integrated functions). At least 1-3 years in a leadership, senior, or mentorship capacity.Proven experience leading, guiding, and mentoring a team of engineers and support personnel, with strong interpersonal and leadership skills, and the ability to lead by influence.Expert-level understanding and practical experience with Design for Manufacturability (DFM), Design for Assembly (DFA), and Design for Testability (DFT) principles for integrated mechanical, electrical, and software components, with a demonstrated ability to strategically influence product design for optimal production.Profound expertise in strategic process planning, capacity modeling, cycle time analysis (Taktzeitplanung), line balancing, and advanced bottleneck identification and resolution within complex mechatronic assembly and test environments.In-depth knowledge of various manufacturing processes, including but not limited to precision assembly, complex wiring/cabling, sensor integration, motor/actuator assembly, automated testing, and software flashing/configuration.Proficiency with CAD software (e.g., SolidWorks, NX, CATIA) for mechanical design, and familiarity with ECAD tools (e.g., Altium, Eagle) for electrical schematics. Experience with process simulation tools is a plus.Strong understanding of materials science relevant to mechanical and electrical components in mechatronic systems.Proven expertise in applying Lean Manufacturing principles and Six Sigma methodologies (Green Belt or Black Belt certification highly desirable).Strong project management skills, including the ability to manage multiple complex projects simultaneously, prioritise tasks effectively, and meet deadlines in a dynamic environment.Strong verbal and written communication skills, with the ability to present complex technical data, influence stakeholders at all levels, and collaborate effectively with internal and external partners (R&D, Quality, Supply Chain, Production, Software Engineering).Experience with New Product Introduction (NPI) processes and product lifecycle management for mechatronic systems at a strategic level.Familiarity with Manufacturing Execution Systems (MES), Enterprise Resource Planning (ERP) systems, and advanced factory automation technologies (e.g., robotics programming, PLC knowledge).Note: We operate in an industry where women, as well as other minority groups, are systematicallyunder-represented. We encourage you to apply even if you don’t meet all the listed qualifications; ability and impact cannot be summarised in a few bullet points.Join Helsing and work with world-leading experts in their fieldsHelsing’s work is important. You’ll be directly contributing to the protection of democratic countries while balancing both ethical and geopolitical concernsThe work is unique. We operate in a domain that has highly unusual technical requirements and constraints, and where robustness, safety, and ethical considerations are vital. You will face unique Engineering and AI challenges that make a meaningful impact in the worldOur work frequently takes us right up to the state of the art in technical innovation, be it reinforcement learning, distributed systems, generative AI, or deployment infrastructure. The defence industry is entering the most exciting phase of the technological development curve. Advances in our field of world are not incremental: Helsing is part of, and often leading, historic leaps forwardIn our domain, success is a matter of order-of-magnitude improvements and novel capabilities. This means we take bets, aim high, and focus on big opportunities. Despite being a relatively young company, Helsing has already been selected for multiple significant government contractsWe actively encourage healthy, proactive, and diverse debate internally about what we do and how we choose to do it. Teams and individual engineers are trusted (and encouraged) to practise responsible autonomy and critical thinking, and to focus on outcomes, not conformity. At Helsing you will have a say in how we (and you!) work, the opportunity to engage on what does and doesn’t work, and to take ownership of aspects of our culture that you care deeply aboutWhat we offerA focus on outcomes, not time-trackingCompetitive compensation and stock optionsRelocation supportSocial and education allowancesRegular company events and all-hands to bring together employees as one team across EuropeA hands-on onboarding program (affectionately labelled “Infraduction”), in which you will be building tooling and applications to be used across the company. This is your opportunity to learn our tech stack, explore the company, and learn how we get things done - all whilst working with other engineering teams from day oneHelsing is an equal opportunities employer. We are committed to equal employment opportunity regardless of race, religion, sexual orientation, age, marital status, disability or gender identity. Please do not submit personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, data concerning your health, or data concerning your sexual orientation.Helsing's Candidate Privacy and Confidentiality Regime can be found here.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Design Engineer - Electronics",
    "company": "Helsing",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/design-engineer-electronics-at-helsing-4288518417",
    "posted_date": "15 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "description": "Who We AreHelsing is a defence AI company. Our mission is to protect our democracies. We aim to achieve technological leadership, so that open societies can continue to make sovereign decisions and control their ethical standards.As democracies, we believe we have a special responsibility to be thoughtful about the development and deployment of powerful technologies like AI. We take this responsibility seriously.We are an ambitious and committed team of engineers, AI specialists and customer-facing programme managers. We are looking for mission-driven people to join our European teams – and apply their skills to solve the most complex and impactful problems. We embrace an open and transparent culture that welcomes healthy debates on the use of technology in defence, its benefits, and its ethical implications.The roleAs a Design Engineer focused on Electronics, you will create innovative concepts for the mechanical integration of electronic boards, connectors, and harnesses, ensuring their proper form, fit, and function. Your expertise will be vital in realising robust, scalable, and cost-effective solutions that enhance the performance of Helsing's systems, directly supporting our mission to provide advanced defence capabilities.The day-to-dayOwn the mechanical design and integration of electronic parts and full assemblies for current and future complex drone productsCreate design and integration concepts for electronic boards, connectors and harness under consideration of comprehensive requirements setsCreate 3D and 2D documents and ensure proper form, fit, function of components by using analytical and simulation toolsApply latest design and drawing standards, including consideration of manufacturing aspectsRealise robust, scalable and cost-effective componentsDefine and perform validation tests for technical maturationCreate comprehensive design documentation and under consideration of company guidelines and quality standardsYou should apply if youHave professional working experience in the field of mechanical and electrical design of aerospace structures or similar applicationsPossess outstanding hands-on experience in using 3D/2D CAD and PLM tools, preferably with Solidworks/PDM or Siemens NX/TeamcenterHave strong knowledge of electronic component integration, preferably in using ECAD/MCAD interfaces for component realizationCan perform hand calculations and setup simulations for component validationHave proven knowledge of ASME/ISO drawing standards, mechanical design standards and analysis capabilities for mechanical elementsCommunicate excellently in English, both written and verbalAre keen on fast track developments and realisationsEnjoy working in a highly flexible environmentNote: We operate in an industry where women, as well as other minority groups, are systematicallyunder-represented. We encourage you to apply even if you don’t meet all the listed qualifications; ability and impact cannot be summarised in a few bullet points.Join Helsing and work with world-leading experts in their fieldsHelsing’s work is important. You’ll be directly contributing to the protection of democratic countries while balancing both ethical and geopolitical concernsThe work is unique. We operate in a domain that has highly unusual technical requirements and constraints, and where robustness, safety, and ethical considerations are vital. You will face unique Engineering and AI challenges that make a meaningful impact in the worldOur work frequently takes us right up to the state of the art in technical innovation, be it reinforcement learning, distributed systems, generative AI, or deployment infrastructure. The defence industry is entering the most exciting phase of the technological development curve. Advances in our field of world are not incremental: Helsing is part of, and often leading, historic leaps forwardIn our domain, success is a matter of order-of-magnitude improvements and novel capabilities. This means we take bets, aim high, and focus on big opportunities. Despite being a relatively young company, Helsing has already been selected for multiple significant government contractsWe actively encourage healthy, proactive, and diverse debate internally about what we do and how we choose to do it. Teams and individual engineers are trusted (and encouraged) to practise responsible autonomy and critical thinking, and to focus on outcomes, not conformity. At Helsing you will have a say in how we (and you!) work, the opportunity to engage on what does and doesn’t work, and to take ownership of aspects of our culture that you care deeply aboutWhat We OfferA focus on outcomes, not time-trackingCompetitive compensation and stock optionsRelocation supportSocial and education allowancesRegular company events and all-hands to bring together employees as one team across EuropeHelsing is an equal opportunities employer. We are committed to equal employment opportunity regardless of race, religion, sexual orientation, age, marital status, disability or gender identity. Please do not submit personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, data concerning your health, or data concerning your sexual orientation.Helsing's Candidate Privacy and Confidentiality Regime can be found here.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQEX83NfqmYtfg/company-logo_100_100/company-logo_100_100/0/1636375353632/helsing_logo?e=2147483647&v=beta&t=8NuJEhpu5hxgflRNnHX2bqRgn7jcWm5JvIgMUrsjrsU",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Senior Game Developer - Paper.io2",
    "company": "Voodoo",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-game-developer-paper-io2-at-voodoo-4310180797",
    "posted_date": "11 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFoMhQ5tM4TLA/company-logo_100_100/company-logo_100_100/0/1693903701647/voodooio_logo?e=2147483647&v=beta&t=_yGIEBC7G3OZfAo7u-bhNCh2keS4Age7ijpkISHz8qs",
    "description": "About VoodooFounded in 2013, Voodoo is a tech company that creates mobile games and apps with a mission to entertain the world. Gathering 800 employees, 7 billion downloads, and over 200 million active users, Voodoo is the #3 mobile publisher worldwide in terms of downloads after Google and Meta. Our portfolio includes chart-topping games like Mob Control and Block Jam, alongside popular apps such as BeReal and Wizz.This position can be Paris-based, Barcelona-based, Amsterdam-based, or fully remote within CET +/-2h.TeamOur Gaming team is made up of hybrid-casual, casual, and mid-core experts. Our 'Core' games team supports internal and external studios worldwide in creating, developing, and launching new hit games, whilst our 'Live' games team focuses on delivering higher engagement on our existing and successful games.Joining our Live games team means collaborating with gaming industry experts on globally renowned, enduring games while embracing exciting new entrepreneurial ventures. With over seven billion downloads worldwide and a portfolio of more than 10 resilient hybrid games generating more than $20m per year, we are the world's largest and most successful hybrid publisher.You will be joining one of our Live Studios, working onPaper.io 2.With Paper.io 2, we’re building an iconic game that players will never forget!We're a small team of excellent people who take care of everything from ideas to testing, and we intend to grow while maintaining our high standards.RoleWe are looking for a talented Senior Game Developer with a good understanding of the casual mobile game market to help the team deliver fun, innovative, and entertaining features. You will take an innovative approach to gameplay ideas/features and give them their own spin.Responsibilities will align with your strengthsWork on core gameplay improvementsDevelop new meta featuresEnhance and refine existing systemsWith this role, you will have a strong impact on the company by contributing daily to important decisions with a senior, multidisciplinary team of passionate and talented people. Flesh out the details of a game's design, oversee its testing, and revise the game in response to player feedback. Thanks to your creativity and your teamwork, let’s entertain millions of people with your hit games.Profile5+ years of professional experience in C# and UnityProven track record in successful mobile game developmentExceptional expertise in a specialized area (e.g., animation, particle systems, shaders, architecture, performance optimization or networking) is a major plusStrong problem-solving skills with a focus on optimization and performanceExcellent written and verbal communication skills in EnglishA creative, hands-on developer with a passion for quality workBenefitsBest-in-class compensationOther benefits according to the country you reside",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFoMhQ5tM4TLA/company-logo_100_100/company-logo_100_100/0/1693903701647/voodooio_logo?e=2147483647&v=beta&t=_yGIEBC7G3OZfAo7u-bhNCh2keS4Age7ijpkISHz8qs",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  }
]