[
  {
    "title": "Frontend Developer",
    "company": "Zembra",
    "location": "Tunis, Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/frontend-developer-at-zembra-4335262601",
    "posted_date": "3 days ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQFe_oELlew2Tw/company-logo_100_100/company-logo_100_100/0/1688377968397/zembra_logo?e=2147483647&v=beta&t=d4G-iEu0kdJrAYtZ1G6tpoMF3H_JMbxudCrB4UC5PY0",
    "description": "Company DescriptionZembra is a diverse collective of thinkers and doers focused on helping online reputation management businesses grow using a robust review scraper API. Over the last 5 years we have built an innovative data collection solution and we currently serve 100+ businesses. We help our community by turning the internet into a database, unleashing a large potential for growth and product value.Role DescriptionTranslate wireframes, prototypes, and design specifications into responsive, intuitive user interfaces using React, React Native, flutter and associated libraries.Connect the front-end application to API Gateway-based micro-services, handling data fetching, state management, and API interactions for optimal performance.Ensure cross-browser compatibility, accessibility, and performance optimizations, incorporating best practices for modern web development.Work with UI/UX designers, back-end engineers, and product managers to iterate on features, resolve issues, and align with overall product goals.You Have3+ years of hands-on experience with React Native and TypeScript.Experience in React.js, JavaScript or TypeScript, HTML5, CSS3, and state management tools such as Redux or Context APIExperience connecting front ends to RESTful APIs or micro-services via API GatewayAbility to deliver user-focused solutions that contribute to product successDeep understanding of React Native components, hooks, and state management (Redux, Context API).Hands-on experience with mobile app deployment (App Store, Google Play).Familiarity with CI/CD pipelines for mobile development.Experience with performance optimization, animations, and accessibility best practices in mobile apps.Nice If You HaveExperience with design tools such as Figma, Sketch, or Adobe XD for seamless collaborationAbility to unit test, such as Jest or React Testing Library, and use performance tools such as LighthousePossession of excellent collaboration skills to excel in agile, cross-functional settingsNotesSalary range for this role is from 1500 TND to 3000 TND depending on experience.This is a hybrid role with 3/5 days in-person and 2 days remote. Our office is located in Centre Urbain Nord in Tunis.All team members are located in Tunis. Leadership is in San Diego, CA. There is expectation to work in PST time zone during onboarding and ramp-up phase.We are looking for someone who is passionate about software engineering, willing to learn, wanting to embark on a journey full of challenges. Must have unquestionable communication skills to promote a healthy and safe work environment for everyone.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQFe_oELlew2Tw/company-logo_100_100/company-logo_100_100/0/1688377968397/zembra_logo?e=2147483647&v=beta&t=d4G-iEu0kdJrAYtZ1G6tpoMF3H_JMbxudCrB4UC5PY0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Full Stack Developer (React / Node.js / AI Integration)",
    "company": "PhotoCarb",
    "location": "Sousse, Sousse, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/full-stack-developer-react-node-js-ai-integration-at-photocarb-4335155973",
    "posted_date": "3 days ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHphDSQtfmfqg/company-logo_100_100/B4EZpkdlT2IoAQ-/0/1762622070785/photocarb_logo?e=2147483647&v=beta&t=psKaLOig2gPzdg_tjRH92b2A7O23MrqJE8PY0GvYi6Y",
    "description": "Company DescriptionPhotocarb is an AI-powered climate technology startup helping industries measure, reduce, and report their carbon footprint with precision.We turn complex environmental data into actionable insights — empowering companies to lead the net-zero transition.Our vision is to make every industrial process transparent, efficient, and sustainable through smart technology.Your RoleWe’re looking for a Full Stack Developer passionate about building impactful technology for climate innovation.You’ll develop and optimize our web platform, dashboards, and data interfaces — integrating AI and sustainability data systems.Main ResponsibilitiesDevelop and maintain front-end interfaces using React.js.Design and implement back-end APIs with Node.js / Express.Strong proficiency in PythonIntegrate AI/ML models for carbon data analytics and optimization.Manage and optimize databases (MongoDB, PostgreSQL, or Firebase).Ensure data security, platform performance, and scalability.Collaborate closely with designers, AI engineers, and sustainability experts.Participate in the full development lifecycle — from concept to deployment.Qualifications2–5 years of experience in full stack development.Degree or background in Software Engineering, Computer Science, or related field.Experience in web or software development (front-end and back-end).Knowledge of Python and modern development frameworks is a plus.Interest in AI, data analysis, or innovative technologies.Ability to collaborate effectively in a fast-paced startup environment.Why Join PhotocarbWork on a deep tech project combining AI, data, and innovation.Join a young, ambitious, and innovative team making real impact.Career growth and leadership opportunities as the startup scales.Flexible and creative working environment that encourages initiative.Opportunities for travel and international exposure.Competitive and motivating salary based on skills and contribution.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHphDSQtfmfqg/company-logo_100_100/B4EZpkdlT2IoAQ-/0/1762622070785/photocarb_logo?e=2147483647&v=beta&t=psKaLOig2gPzdg_tjRH92b2A7O23MrqJE8PY0GvYi6Y",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Frontend Developer Next.js - React",
    "company": "TRVL CODE",
    "location": "Sousse, Sousse, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/frontend-developer-next-js-react-at-trvl-code-4333950522",
    "posted_date": "1 week ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGAqF7eGys1Cg/company-logo_100_100/company-logo_100_100/0/1704379117118/trvlcode_logo?e=2147483647&v=beta&t=Dv6DVonpdqfhQy9VMaA3dCoJddI-7dhfIQ4cjRP6L0Q",
    "description": "🚀 Join the TRVL Code Team as aFrontend DeveloperAre you ready to broaden your horizons, acquire new skills, and make a tangible impact in the travel-tech space? 🌍TRVL Codeinvites you to embark on our journey of innovation and discovery.💡 About the RoleWe’re looking for atalented Frontend Developerto join our growing team.You’ll be responsible for developing, testing, and refiningresponsive web applicationsusing modern technologies such asReact.js,Next.js,Material UI,Tailwind CSS,JavaScript,HTML, andCSS.Your mission: transform ideas, interfaces, and business needs intofunctional, visually stunning, and user-centered digital experiences✨.We’re looking for someone with a sharp eye forpixel-perfect design, deepUI sensitivity, and a passion for craftingintuitive, accessible, and delightful interfaces.🧩 Key ResponsibilitiesDevelop and maintainhigh-performance, scalableweb applications.Buildserver-side renderedReact apps and implementoptimized client-side rendering.Integrate APIs and databases effectively.Writeclean, efficient, and maintainablecode.Collaborate with designers and cross-functional teams to deliveruser-friendly and consistentexperiences.Solve complex problems with a deep understanding ofJavaScriptandReact.EnsureUI consistency,accessibility, andperformance optimizationacross all platforms and devices.🧠 Requirements⚙️ Technical SkillsStrong proficiency inReact.js,Next.js,TypeScript,HTML5, andCSS3.Solid grasp ofReact Components,Hooks, andState Management.Experience with:SSR, SSG, and client-side rendering.RESTful APIs and efficient backend integration.CSS Pre-processors (SASS/LESS).Material UIandTailwind CSS.Version control (Git).Testing frameworks (Jest,Enzyme).🌐 General SkillsAbility to translateUI/UX designsintopixel-perfect, high-qualitycode.Deep understanding ofweb performance optimizationandaccessibility standards (WCAG).Familiarity with state management libraries (Redux,Mobx,Zustand).Awareness ofSEO best practicesand frontend architecture principles.💎 Personal QualitiesStrongattention to detailand commitment toquality and consistency.Excellentanalytical,organizational, andmultitaskingabilities.Auser-first mindsetand empathy for the end-user journey.Adaptability, curiosity, and a proactive attitude.Ability to workindependentlyas well ascollaborativelywithin a team.🚫 Who We’reNotLooking ForCandidates focused onfreelance or outsourcingwork.Those seeking asecond jobor part-time focus.Individuals uncomfortable withstructured workflows,office discipline, orteam accountability.🌍 Why Join TRVL Code?AtTRVL Code, you’ll work in adynamic, collaborative environmentwhere your skills directly shape the future oftravel-tech innovation.We valuegrowth,creativity, andexcellence— every pixel and every line of code matters.📩 How to ApplySend yourCVtoteam@trvlcode.comor reach out to us directly with a message.We’re excited to hear from you and can’t wait to see what you’ll bring to the team! 💬",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGAqF7eGys1Cg/company-logo_100_100/company-logo_100_100/0/1704379117118/trvlcode_logo?e=2147483647&v=beta&t=Dv6DVonpdqfhQy9VMaA3dCoJddI-7dhfIQ4cjRP6L0Q",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "FULL STACK DEVELOPER - CLOUD, WEB & VR",
    "company": "STATION F",
    "location": "Tunis, Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/full-stack-developer-cloud-web-vr-at-station-f-4322150665",
    "posted_date": "1 day ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG1F1nJoSebtA/company-logo_100_100/company-logo_100_100/0/1695105648393/stationf_logo?e=2147483647&v=beta&t=IKAvTakk1xWM0nGPSJFBqL-t4AiBrg_WMsi-o4fidME",
    "description": "À proposFondée en 2017,Uptale est le leader français de la montée en compétence terrain en Réalité Virtuelle. Uptale est une solution destinée aux grandes entreprises qui permet d’améliorer l’efficacité de la formation des employés de première ligne grâce à la Réalité Virtuelle.La réalité virtuelle offre un moyen incroyablement efficace de digitaliser les compétences et le savoir-faire du terrain, et de les distribuer à grande échelle à des centaines voire des milliers d’opérateurs, de techniciens, de vendeurs, de soignants…Uptale propose une plateforme permettant aux acteurs de la montée en compétence de concevoir des expériences de formation en 360° et en Réalité Virtuelle, et de les déployer à grande échelle en un temps record et une efficacité inédite.Nous sommes pionniers sur ce nouveau marché à fort potentiel et à forte croissance. En formation professionnelle comme dans l’éducation, nous vivons une croissance exponentielle en France, aux Etats-Unis, en Asie et aux Etats-Unis. Nous travaillons déjà avec plus de 60 grandes entreprises internationales comme Stellantis, Schneider Electric, Michelin, L’Oréal, Danone, mais aussi des dizaines d’ organismes de formation, d’ONG, d’écoles et d’universités. Le tout, en partenariat rapproché avec des géants comme Lenovo, Microsoft, Meta.Nous venons de créernotre nouvelle entité en Tunisie, une avancée stratégique majeure dans le développement d’Uptale.Cenouveau hub, réunissant à la fois unpôle d’ingénierieet desfonctions support, vient renforcer notre présence internationale et marquer une nouvelle étape dans notre croissance.Lepôle tunisientravaillera enétroite collaborationavec notre centre d’ingénierie de Paris, favorisant un échange continu d’expertise, d’innovation et de bonnes pratiques.Vous collaborerezquotidiennementavec les équipes basées en France et ferez pleinement partie du pôle Engineering d’Uptale, au cœur du développement technologique de nos solutions immersives.Descriptif du posteNous renforçons notre équipe technique avec un developpeur qui sera en charge d'intervenir sur des phases de conception et d'implémentation de l'ensemble des composants et fonctionalités d'Uptale, qu'il s'agisse des composants Cloud, de la plateforme Web, des applications mobile ou des moteurs pour le rendu en Réalité Virtuelle.Les Composants Et Technologies Sur Lesquels Reposent Uptale IncluentUne infrastructure Cloud reposant sur des services managés de Microsoft Azure et implémentés principalement en C#Une plateforme web complète en ReactJSUne application Unity, multiplateforme et compatibles avec plusieurs casques de Réalité VirtuelleDans Cet Écosystème De Composants Et Au Sein D'une Équipe D'ingénieurs Très Techniques, Vous Serez Amenés àDévelopper de nouvelles fonctionnalités et produitsEffectuer des code reviews de autres développeursParticiper activement aux diverses phases de conception et d'architecture des projetsMaintenir un niveau d'excellence de la plateformeInteragir avec nos partenaires techniques (Microsoft, Lenovo, ...) ainsi que nos clients dans le cadre d'intégrations techniquesProfil recherchéBac + 5 Scientifique avec idéalement une spécialité en informatiqueFortes capacités de résolution de problèmesGrande autonomie, capacité d'adaptation, curiosité et force de propositionPassionné de nouvelles technologies et de développement logicielGrande motivation à participer à la mission d'Uptale d'apporter l'immersive learning au plus grand nombre d'entreprises et d'écolesNous portons une grande attention au le potentiel technique des candidats, et moins sur la recherche d'une expertise. La connaissance de nos technologies est un plus sans être obligatoire (.Net, C#, Typescript, ReactJS, Unity, 3D, React Native, Microsoft Azure/Cloud)Process de recrutementEntretien visio avec notre RHEnviron 3 entretiens techniquesRencontre des fondateursInformations complémentairesType de contrat : CDIDate de début : 02 février 2026Lieu : TunisNiveau d'études : Bac +5 / Master",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG1F1nJoSebtA/company-logo_100_100/company-logo_100_100/0/1695105648393/stationf_logo?e=2147483647&v=beta&t=IKAvTakk1xWM0nGPSJFBqL-t4AiBrg_WMsi-o4fidME",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Full-stack developer with focus on Angular (Located geographically in EMEA)",
    "company": "Acro Companion",
    "location": "Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/full-stack-developer-with-focus-on-angular-located-geographically-in-emea-at-acro-companion-4332005558",
    "posted_date": "2 weeks ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQH_D_OfYOP6mA/company-logo_100_100/company-logo_100_100/0/1630578897710?e=2147483647&v=beta&t=pT1YMjdtI9c_E1hrVdp3gKqIV59FBlVYuQ_W_r9mdsU",
    "description": "Acro Companion is the leading worldwide gymnastics platform and is working together with federations and competition organizers around the world (UK, Germany, Portugal, The Netherlands, Switzerland, Austria, France, Belgium, Bulgaria, Israel, USA, Ireland, Schotland, …) to fundamentally change how gymnastics competitions (and sports competitions in general) are organized and experienced.The RoleRole OverviewAs a member of our development team, you'll be instrumental in implementing and analysing features for our Angular-based web application. You will use the cutting-edge versions of Angular (signals, zoneless), NX, google cloud + node, No-SQL + SQL firebase, python for deep learning models for real-time judging and for operational research, …Location:Our team is located in different areas of the world (Tunisia, Portugal, Belgium) and works remotely.We are open to team members located between timezones GMT - 2 => GMT + 4, North Africa & Africa, Middle East, Portugal, Eastern Europe.Ideal ProfileRequirements(!! please do not apply if you don't have 2 years of non-internship experience. We are very sorry but we are not open to early junior profiles)REQUIRED: Proficiency in Angular and TypeScript. A minimum of 2 years actual professional experience in Angular. Make sure to understand the foundations of Angular. How does Zone.js work? What is the difference between signals and observables? ...REQUIRED: Professional-level English. Our team communicates in English. Your English doesn't have to be perfect, but you need to be able to discuss with your team members easily.REQUIRED: Familiarity with HTML, CSS, and responsive design principlesREQUIRED: Excellent problem-solving skills and attention to detailREQUIRED: Collaboration, openness and willingness to learn in an agile development environmentBonus SkillsUnderstanding of Firebase services (Firestore, Authentication, Cloud Messaging, etc.)Knowledge of serverless architecture (Firebase Cloud Functions)Experience with version control systems (Git)Understanding of UX/UI principlesPrevious experience with Scrum or other agile methodologiesWhat's on Offer?Work within a company with a solid track record of successWork alongside & learn from best in class talentOpportunity to make a positive impact",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQH_D_OfYOP6mA/company-logo_100_100/company-logo_100_100/0/1630578897710?e=2147483647&v=beta&t=pT1YMjdtI9c_E1hrVdp3gKqIV59FBlVYuQ_W_r9mdsU",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Frontend engineer experimenté- Angular",
    "company": "FNZ",
    "location": "Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/frontend-engineer-experiment%C3%A9-angular-at-fnz-4294585092",
    "posted_date": "6 days ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHa-nM1kVhVxQ/company-logo_100_100/B4EZfFdJvpG4AU-/0/1751364443564/fnz_logo?e=2147483647&v=beta&t=nVWMT7AY1ZlxrkL-H0jEYw_KyrOHSPVdaRN-dcQdZ74",
    "description": "FNZ is committed to opening up wealth so that everyone, everywhere can invest in their future on their terms. We know the foundation to do that already exists in the wealth management industry, but complexity holds firms back.We created wealth’s growth platform to help. We provide a global, end-to-end wealth management platform that integrates modern technology with business and investment operations. All in a regulated financial institution.We partner with over 650 financial institutions and 12,000 wealth managers, with US$2 trillion in assets under administration (AUA).Together with our customers, we help over 20 million people from all wealth segments to invest in their future.As a Frontend Developer, you are responsible for the technical implementation of FNZ products, shaping the user experience and interaction of our next-generation banking process automation tools.You will be contributing together with the team to our continuous improvement, bringing fresh ideas and adopting state-of-the-art technologies. We seek talents capable of shaping intuitive user interfaces and building responsive, accessible, and flexible web applications usingAngular,Vanilla JS, CSS, and HTML.During development, you will also be working on activities such as:Knowledge sharing with other engineersContinuous collaboration with designers and the PM of your teamUnit testingManual and automated testingPresenting work to other teams and stakeholdersSpecific Role ResponsibilitiesAre you the perfect fit?You like to work in a team, you are a problem-solver, and you will apply your skills to support the needs of our customers.You enjoy finding ways to feed intelligence back to your colleagues, as well as into the products and tasks you work on.A perfectionist, you take great pride in the quality of your work, ensuring that it performs well and meets the technical and functional requirements. This also means you strive to deliver on time, and you can prioritize and manage your tasks accordingly.You strive to exceed expectations, and you like to work in a team that you can learn from.You are not afraid to share and express your opinion.You are passionate about all aspects of software products from details in experience design to architecture problems and user-friendly documentation.Main ResponsibilitiesDevelop and maintain parts of the customer facing frontend for the FNZ products and applications.Collaborate closely with designers providing wireframes & interactive prototypes to shape UX flows.Collaborate with stakeholders to understand requirements and translate them into well-structured, maintainable architectural designs.Participate in the design, development, and maintenance of software applications using modern tools and frameworks.Ensure high-quality code through adherence to clean code principles and the development of comprehensive test cases.Analyse and troubleshoot technical issues, identifying root causes and delivering effective solutions.Work effectively within an Agile framework to prioritize and deliver incremental value.Ensure a high level of quality of the developed application.Push technological and methodological innovation.Experience RequiredA degree in Computer Engineering.at least 3 years of professional experience.Good proficiency in AngularGood proficiency in JavaScript, with experience in plain Vanilla JavaScript, HTML5, CSS and responsive design.Knowledge of React and Typescript is a plus .Experience with testing frameworks like Jest, Karma and Jasmine.Experience with implementing accessible web applications.Knowledge of UI/UX patternsKnowledge of fundamentals like object-oriented programming, design patterns, and algorithms.Experience with Medium to large-scale standards-based web applications, conceptual design, and implementation of modern software architectures.Experience in reading/writing technical requirements.Good communication and presentation skills.Any C# .Net and/or SQL server experience is a plusGood communication and presentation skills.Fluency in English is mandatoryPreferredPrior experience working in product-driven or SaaS companiesExperience working on financial or banking software (client lifecycle management, core banking)About FNZ CultureOur culture is what drives us. It's at the heart of who we are and everything we do. It's what inspires, excites and moves us forward. Our ambition is to create a culture for growth, one that opens up limitless opportunities for our employees, customers and the wider world. At FNZ we know that great impact is only possible with great teamwork.That’s why we value the strength and diversity of thought in our global team.The FNZ Way is the cornerstone of what we do. It is comprised of four values that set the standard for how everyone at FNZ interacts with each other, with our customers, and with all our diverse stakeholders around the world.Customer obsessed for the long-termThink big and make an impactAct now and own it all the wayChallenge, commit and win togetherRead more about The FNZ Way and our values: www.fnz.com/cultureOpportunitiesRight from day one, you will work alongside exceptional, multicultural teams - experts in their respective fields - who will inspire and challenge you to make your greatest impact.Be part of a highly successful, rapidly growing, global business that is leading the delivery of financial services via cloud computing and partners with some of the world’s largest companies;Working in a flexible and agile way that meets the needs of the business and personal circumstances;Remuneration, significant financial rewards and career advancement is based on individual contribution and business impact rather than tenure or seniority;We provide global career opportunities for our best employees at any of our offices in the UK, EU, US, Canada, South Africa and APAC.Commitment to Equal OpportunitiesAt FNZ, we recognise that diversity, equity and inclusion are important factors contributing to our success. We embrace the unique perspective and capabilities of our current and future employees, which will help us continue to drive innovation and achieve our business goals. Recruitment decisions at FNZ are made in a non-discriminatory manner without regard to gender, ethnicity/race, faith, age, nationality, gender identity, sexual orientation, marital status, socio-economic background, disability or military veteran status where all applicants and employees are valued and respected.In addition, we want to ensure accessibility needs are well supported, if you require specific support please advise us.About FNZFNZ is committed to opening up wealth so that everyone, everywhere can invest in their future on their terms. We know the foundation to do that already exists in the wealth management industry, but complexity holds firms back.We created wealth’s growth platform to help. We provide a global, end-to-end wealth management platform that integrates modern technology with business and investment operations. All in a regulated financial institution.We partner with over 650 financial institutions and 12,000 wealth managers, with US$1.7 trillion in assets under administration (AUA).Together with our customers, we help over 26 million people from all wealth segments to invest in their future.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHa-nM1kVhVxQ/company-logo_100_100/B4EZfFdJvpG4AU-/0/1751364443564/fnz_logo?e=2147483647&v=beta&t=nVWMT7AY1ZlxrkL-H0jEYw_KyrOHSPVdaRN-dcQdZ74",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "(Senior) Frontend Developer (Vue.js)",
    "company": "Scope Merge",
    "location": "Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/senior-frontend-developer-vue-js-at-scope-merge-4315036034",
    "posted_date": "4 weeks ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQEdkywOru8jNg/company-logo_100_100/B4DZXRrNv9HkAQ-/0/1742979522293/scope_merge_logo?e=2147483647&v=beta&t=obje1zck7fZzMZ-sQxjODLK0mnw15U74TiBFJtcwOgE",
    "description": "We are hiring a Frontend Developer to join a small, product-focused team at a fast-growing fintech startup that is redefining how people plan their financial futures. You will work on real digital products with visible impact, in a team that values initiative, ownership, and collaboration.You will use Vue.js, TailwindCSS, Pinia, and Vite to build elegant, scalable user interfaces. Testing is done with Vitest and Cypress, and CapacitorJS is used to support mobile platforms. Your work will directly shape the product experience for thousands of users and contribute to the growth of a platform that blends design, performance, and purpose.TasksBuild responsive, high-quality interfaces using Vue.js and TailwindCSSManage state and data flow using PiniaUse Vite for a fast and efficient development experienceWrite reliable tests with Vitest and CypressSupport mobile functionality with CapacitorJSCollaborate with backend developers, designers, and product stakeholdersContribute ideas and solutions in a fast-paced environmentRequirementsAt least two years of experience building frontend applicationsStrong skills in JavaScript or TypeScript and modern Vue.jsExperience with TailwindCSS and responsive designKnowledge of testing practices and tools such as Vitest and CypressFamiliarity with Vite and component-driven developmentBonus points for experience with CapacitorJS or mobile-first projectsAbility to communicate clearly and work well in a teamBenefitsInternational exposure: collaborate with leading tech teams across Europe.Real growth: learn by building production-grade systems with real impact.People-first culture: flexible sick leave and focus on well-being.Rewarding compensation: above-market salary and long-term collaboration.We are looking for someone with at least three years of professional experience in frontend development and strong, hands-on skills in Vue.js.Ideally, you also have experience with TailwindCSS, Pinia, Vite, Vitest, Cypress, and CapacitorJS.Please make sure your CV in English clearly shows your experience with these technologies, as it helps us review your application faster.We carefully review every application but focus on those that truly match the role.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQEdkywOru8jNg/company-logo_100_100/B4DZXRrNv9HkAQ-/0/1742979522293/scope_merge_logo?e=2147483647&v=beta&t=obje1zck7fZzMZ-sQxjODLK0mnw15U74TiBFJtcwOgE",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Développeur Frontend Angular",
    "company": "ARTEMIS SOURCING",
    "location": "Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/d%C3%A9veloppeur-frontend-angular-at-artemis-sourcing-4340530388",
    "posted_date": "1 day ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGdcjxaHok9Og/company-logo_100_100/company-logo_100_100/0/1731407908134/artemis_sourcing_logo?e=2147483647&v=beta&t=4peNY40GJ5UH8oaybqLwlA1sPJbOjXGsL3S4ZVrjehc",
    "description": "Description de l’entreprise:Notre client est un éditeur de logiciels Canadien spécialisé dans les progiciels ERP et des solutions intégrales répondant à l’ensemble des besoins des PME manufacturières. Grâce à 25 ans d’expérience en optimisation des processus de ses clients, ses solutions sont désormais présentes dans toute l’Amérique du Nord.Principales tâches :Développer et migrer vers le web le produit de l’entreprise.Contribuer à l’amélioration continue du logiciel et des méthodes de travail.Analyser et concevoir les nouvelles fonctionnalités du produit.Collaborer étroitement avec les équipes d’analystes, de qualité et de support technique.Travailler dans un cadre Agile / Scrum, favorisant la communication et la flexibilité.Compétences et expérience recherchéesFormation :Licence ou diplôme d’ingénieur en informatique, développement logiciel, ou domaine connexe (ou expérience équivalente).Expérience :3 à 5 ans minimum en tant quedéveloppeur front-endoufull-stack.Compétences techniques incontournables :Angular (niveau avancé)HTML5, CSS3, SCSSTypeScriptAtouts appréciés :C# et ASP.NetRest APIBibliothèque UI (Syncfusion ou équivalente)VSCode / Visual StudioGit / Git ExtensionSQL / T-SQL / SQL Server",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQGdcjxaHok9Og/company-logo_100_100/company-logo_100_100/0/1731407908134/artemis_sourcing_logo?e=2147483647&v=beta&t=4peNY40GJ5UH8oaybqLwlA1sPJbOjXGsL3S4ZVrjehc",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Frontend Engineer (React)",
    "company": "DualEntry",
    "location": "Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/senior-frontend-engineer-react-at-dualentry-4317248270",
    "posted_date": "2 weeks ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHrdvw3NGBIOw/company-logo_100_100/B4EZltH3TvIwAQ-/0/1758472403139/dualentry_logo?e=2147483647&v=beta&t=uPAo9jVyrfeRycW3EwkkzO15E9hsUg-ZGoHKoZoObuo",
    "description": "👀 TL;DRElite team of FE engineers building complex AI accounting & fintech productHuge momentum, growing fast, huge product & AI roadmapHigh-speed development - one of the fastest teams on the planetComp: $110k-$175k USD base + $40k USD equity ($150k-$215k USD total)Backed by top San Francisco & New York VCsRemote with in-person meetups & daily New York EST timezone overlapFounders built & exited prior company at 100M ARR and 350+ peopleWhy This Role Matters NowWe’re growing our Engineering team and hiring our next Staff Frontend Engineer to increase our product velocity, own features end-to-end and bring DualEntry’s AI-powered accounting platform to the world’s fastest-growing companies.About DualEntryFounded in 2024, DualEntry is one of NYC’s fastest-growing AI startups, backed by top-tier VCs and 30+ unicorn founders.Our team previously built a $100M ARR business from scratch, scaled it to 300+ people, and led a successful exit. Now, we’re building a category-defining SaaS product to automate and modernize enterprise accounting — one of the most painful and outdated workflows in finance.We move fast, build with precision, and care deeply about what we ship.📍Location:Remote-first. Preference for European time zones with overlap to US EST working hours.Where You’ll Create ImpactBuild, ship, and own major parts of the product UI in React + Next.jsDesign and optimize interactive experiences that make complex workflows simpleWork closely with product, design, and backend to ensure seamless integration and clarityContribute to architecture, performance, accessibility, and responsiveness across browsersHelp define our frontend system and component library as we scaleElevate the quality of the product through thoughtful details, polish, and user empathyHow You’ll WorkYou’ll collaborate with:Founders, to understand vision and user contextProduct & Design, to shape intuitive, elegant workflowsBackend Engineering, to align on data structures and performanceYou’ll operate with full ownership: deploy daily, make fast decisions, and always aim for clarity.What Sets You Up for Success8+ years of experience in frontend development with React (Next.js a strong plus)Solid grasp of JavaScript and TypeScript: scoping, closures, context, prototypes, classes, etc.Strong understanding of responsive UI, accessibility, and usability principlesExperience building and testing APIs; comfort with HTTP, Postman, and debuggingClear product thinking, eye for polish, and attention to design detailsPragmatic mindset: you move forward, make calls, and optimize for impactCuriosity and autonomy — you dig in, learn fast, and solve problems without waitingWhy You’ll Thrive HereYou’ll own large parts of the UI in a fast-growing productYou’ll work closely with experienced founders who value product and engineering equallyYou’ll build systems, not just features — and see your work go live, fastYou’ll have freedom to do your best work, with a team that moves fast and thinks clearlyCompensation & BenefitsBase salary: $100K–$175K USDEquity: ~$40K+ USDOption for B2B or full-time permanent positionRemote-first setup15 PTO days + 12 public holidaysVisa sponsorship option for relocation to NYC within 2+ yearsHigh-trust, high-autonomy team with real ownershipWe currently have only one remaining seat for a Senior/Staff Frontend Engineer.If you're looking to work on meaningful product challenges, ship product incredibly fast, contribute to a clean and ambitious codebase, and help shape how AI becomes usable at scale — we’d love to hear from you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHrdvw3NGBIOw/company-logo_100_100/B4EZltH3TvIwAQ-/0/1758472403139/dualentry_logo?e=2147483647&v=beta&t=uPAo9jVyrfeRycW3EwkkzO15E9hsUg-ZGoHKoZoObuo",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Symfony/Next.js developer",
    "company": "Linedata",
    "location": "Tunis, Tunis, Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/symfony-next-js-developer-at-linedata-4250610763",
    "posted_date": "2 days ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQFTFPNaI3tyWg/company-logo_100_100/company-logo_100_100/0/1630642339483/linedata_logo?e=2147483647&v=beta&t=_K6QEftqwHR7OCqQihzEf_9vXWLfKOw8b2KXbiIOddw",
    "description": "About UsWHY Linedata?Linedata is an award-winning software solutions company. We believe finance matters to our society as much as energy to life and fueling financial transformation is vital for development and leadership.We humanize technology :We are passionate experts who provide investment management and credit communities with innovative, user-friendly products which help their businesses grow in over 50 countriesOur environment is international, ego-free and relaxed. We believe in building confidence through giving clear responsibilities to our team members and managing to given goals and targets. We celebrate success and we enjoy each other’s companyWe employ more than 1350 employees representing 40 nationalities spread throughout our offices in 14 countries. We believe in mobility, diversity & teamwork.Our mission is to continue to find new ways to create and build flexible, mission-critical software and services and to stay on the cutting edge of the financial software space.JOIN THE MOVEMENTWe provide the investment management and credit communities with an innovative, user-friendly suite of products that, through detailed market and client insights, help their business to grow in over 50 countries.We are transforming the financial services community which is in constant evolution.With our agility, we make technology simple & accessible for our users. Let’s work together to achieve the best solutions for our clients.Commitment to DiversityWe recognize, celebrate, and seek to increase diversity across our organization. Diversity is an asset to organizations and is linked to better performance. It is an integral part of how we do business and imperative to our success. As an international Group, we also believe that our people need to reflect our clients and local communities.Linedata is an Equal Opportunity Employer. We are committed to complying with all federal, state, and local laws providing equal employment opportunities, and all other employment laws and regulations.It is our intent to maintain a work environment that is free of harassment, discrimination, or retaliation based on an individual's race, color, religion, religious creed, national origin, ancestry, citizenship, physical or mental disability, medical condition, genetic information, marital status, sex, gender, age, sexual orientation, veteran and/or military status, protected medical leaves, domestic violence victim status, political affiliation, or any other status protected by federal, state, or local laws.Job DescriptionLinedata is a global software publisher, and a provider of services and value-added data dedicated to the financial sector. We support our clients—asset managers, both traditional and alternative, fund administrators, and credit and financing institutions—in their challenges with innovative and efficient solutions.With over 20 years of experience in the FinTech field, Linedata offers its teams the opportunity to build strong expertise in both finance and technology throughout their careers in a stimulating international environment.We humanize technology:Because we are independent, reliable, accessible, and committed, because our teams are united, attentive, caring, and passionate, and because our experts are both specialized and attentive partners, we strive to create global leadership solutions.Driven by a transforming environment and clients who need to adapt, excited by collaborative companies sharing our entrepreneurial spirit and ambitions, we unleash their creative power to keep money flowing and fuel the economy. We help people develop their abilities and dignity for future generations.Job RequirementAs a member of a dynamic development team, you will contribute to the design, development, and enhancement of web applications. You’ll work on technically challenging projects.Your responsibilities:Design and develop backend applications using SymfonyBuild high-performance user interfaces with Next.jsParticipate in architectural decisions and code reviewsCollaborate with QA, Product, and DevOps teamsStay up-to-date with new technologies and continuously improve the codebaseYour profile:Degree in Computer Science or related field (Bachelor’s minimum)At least 3 years of experience in fullstack web developmentStrong proficiency in Symfony (v4 to v6) and the PHP ecosystemSolid experience with Next.js / React, HTML5, CSS3, JavaScript/TypeScriptGood understanding of REST/GraphQL APIs, Git, and CI/CD practicesExperience with the Flutter framework and Dart programming language is a plus for this positionTeam player, autonomous, and quality-driven mindsetBonus skills:Experience with Docker, Kubernetes, or cloud platforms (Azure, AWS)Proficiency in databases (MySQL, PostgreSQL)Comfortable with EnglishCommitment to DiversityWe recognize, celebrate, and seek to increase diversity across our organization. Diversity is an asset to organizations and linked to better performance. It is an integral part of how we do business and imperative to our success. As an international Group, we also believe that our people need to reflect our clients and local communities.Linedata is an Equal Opportunity Employer. We are committed to complying with all federal, state, and local laws providing equal employment opportunities, and all other employment laws and regulations.It is our intent to maintain a work environment that is free of harassment, discrimination, or retaliation based on an individual's race, color, religion, religious creed, national origin, ancestry, citizenship, physical or mental disability, medical condition, genetic information, marital status, sex, gender, age, sexual orientation, veteran and/or military status, protected medical leaves, domestic violence victim status, political affiliation, or any other status protected by federal, state, or local laws.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQFTFPNaI3tyWg/company-logo_100_100/company-logo_100_100/0/1630642339483/linedata_logo?e=2147483647&v=beta&t=_K6QEftqwHR7OCqQihzEf_9vXWLfKOw8b2KXbiIOddw",
    "in_time_range": true,
    "time_note": ""
  }
]