[
  {
    "title": "AI Founding Engineer | Ready for Execution",
    "company": "Clinero",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-founding-engineer-ready-for-execution-at-clinero-4341190409",
    "posted_date": "2 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG5MZB0sYpNTA/company-logo_100_100/company-logo_100_100/0/1739384065943?e=2147483647&v=beta&t=qoF-Cfrb00fK0sS3TyrCIWoALCuosP-aZbnTyKLC3Ac",
    "description": "Clinero befreit Zahnarztpraxen von der Verwaltung. Der größte Schmerzpunkt heute: die Abrechnung. Unser agentisches OS automatisiert Dokumentation, Prüfung und Abrechnung zu 90% im Backend – ohne Systemwechsel in der Praxis.Mit produktiver Technologie, zahlender Kundenbasis und Profitabilität verfügen wir über ein belastbares Fundament, das wir jetzt gezielt skalieren. AlsAI Founding Engineerentwickelt du unseren Application-Layer weiter und bringst LLM-gestützte Automatisierung zuverlässig in den Praxisalltag.Unser Angebot: bis zu100k Fixgehalt + echtes EquityAufgabenDein Impact & Ownership ab Tag 1Applikation-Layer weiterentwickeln:Du entwickelst die Arbeitsumgebung für unsere Coding-Experts und realisierst spezialisierte Agenten für Abrechnungsfälle mit dem Ziel, 90% Automatisierung stabil im Betrieb zu erreichenPraxissysteme nahtlos anbinden:APIs, UI-Automation/ RPA, lokale Agenten – du sorgst für sichere und robuste Datenflüsse in die Praxis. Ohne Systemwechsel und sauberes Monitoring & AlertingSkalierbare Codebase & Rollouts:Du treibst Architektur, Multi-Tenant-Fähigkeit, Konfiguration und Zero-Downtime-Deployments voran. Schnelles Shippen ohne Qualität zu verlierenBuild mit echten Nutzer:innen:Du arbeitest im Live-Betrieb eng mit Medical-Coding-Experts und Praxen, holst direktes Feedback und erhöhst messbar Automatisierungsgrad, Durchlaufgeschwindigkeit und GenauigkeitQualifikationDein Profil4–6 Jahre Softwareentwicklung(Python, TypeScript, React/Next.js, SQL) mit soliden Patterns, Tests, CI/CD und Cloud-Erfahrung (AWS/Azure)AI-/Automationspraxis:erste Erfahrung mit LLMs/Agenten/RAG – oder nachweisbar schnelle Einarbeitung; Fokus aufProduktiv-Einsatz, nicht nur Notebook-DemosIntegrations- & Reliability-Mindset:APIs, UI-Automation/RPA; Observability (Monitoring/Alerting, SLIs/SLOs), Queues/Retries/IdempotenzArbeitsweise & Sprache:schnell bauen, lernen, liefern; Ownership & Produktdenken; Deutsch C1BenefitsUnser AngebotVergütung:Bis zu 100k FixgehaltBeteiligung:Echtes Equity (Vesting 4/1) – mit signifikantem Upside bei starker Performance & wachsender VerantwortungSetup: Remote/ Home Office möglich, flexible Zeiten, Office in München;MacBookund alle Tools, die du brauchstImpact & Entwicklung: Ownership ab Tag 1, direkter Zugang zum Gründerteam, klarer Wachstumspfad (Lead/ CTO-Track),etabliertes Geschäftsmodell & Marktzugang. Du steigst direkt in dieSkalierungein",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG5MZB0sYpNTA/company-logo_100_100/company-logo_100_100/0/1739384065943?e=2147483647&v=beta&t=qoF-Cfrb00fK0sS3TyrCIWoALCuosP-aZbnTyKLC3Ac",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "mid_senior"
  },
  {
    "title": "AI Evaluation Engineer, Device Intelligence (m/f/d) - Jobbird.com",
    "company": "Jobster",
    "location": "Düsseldorf, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-evaluation-engineer-device-intelligence-m-f-d-jobbird-com-at-jobster-4322922838",
    "posted_date": "1 hour ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "description": "Bring more to life.At Danaher, our work saves lives. And each of us plays a part. Fueled by our culture of continuous improvement, we turn ideas into impact – innovating at the speed of life.Our 63,000+ associates work across the globe at more than 15 unique businesses within life sciences, diagnostics, and biotechnology.Are you ready to accelerate your potential and make a real difference? At Danaher, you can build an incredible career at a leading science and technology company, where we’re committed to hiring and developing from within. You’ll thrive in a culture of belonging where you and your unique viewpoint matter.Learn about the Danaher Business System which makes everything possible.TheAI Evaluation Engineer, Device Intelligence(m/f/d)will be a key member of the AI Product and Imaging Innovation team, reporting to its Senior Director. This new role is instrumental in the implementation of cutting-edge AI systems that leverage data created by Danaher devices to extract meaningful insights and dramatically improve user experience, with the goal of upleveling Danaher's devices across Life Sciences, Diagnostics and Biotechnology sectors. This position is remote in Germany.In this role, you will have the opportunity to:Define, own and run the AI evaluation strategy for AI products in life sciences, diagnostics, and biotechnology.Design and implement robust evaluation frameworks for agentic workflows, LLMs / NLP, computer vision and multimodal models.Develop and execute evaluation plans to measure performance, reliability, and safety across multimodal datasets.Collaborate with the Sr. Director for the Initiative, Sr. AI Engineers and product teams to align evaluation criteria with product KPIs and regulatory needs.Analyze evaluation results, identify weaknesses, and recommend improvements to AI models and workflows.Build automated pipelines for continuous evaluation and monitoring of AI systems in production.The essential requirements of the job include:Bachelor’s degree in Computer Science, Engineering, Data Science, or related field; MS/PhD preferred.Proven experience designing and implementing evaluation methodologies for AI systems, including LLMs and computer vision.Strong knowledge of metrics for AI performance, robustness, and fairness, especially in regulated domains.Expertise in at least 3 of the following: benchmarking frameworks, statistical validation, synthetic data generation, adversarial testing, explainability techniques.Proficiency in Python and ML libraries (e.g., PyTorch, TensorFlow) and familiarity with evaluation tools (e.g., OpenAI Evals, Dynabench, Promptfoo).Ability to communicate complex evaluation results to technical and non-technical stakeholders and influence model improvements.It would be a plus if you also possess previous experience in:Experience with regulatory processes, especially for medical devices and AI/ML-based software as a medical device (SaMD).Familiarity with quality management systems and standards relevant to the life sciences and diagnostics industries.Knowledge of instrument control mechanisms and how they integrate with AI systems for enhanced automation.Join our winning team today. Together, we’ll accelerate the real-life impact of tomorrow’s science and technology. We partner with customers across the globe to help them solve their most complex challenges, architecting solutions that bring the power of science to life.For more information, visit www.danaher.com.#Jobster",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "associate"
  },
  {
    "title": "DevOps Engineer (All genders)",
    "company": "Optimyze Consulting",
    "location": "Greater Munich Metropolitan Area",
    "job_link": "https://de.linkedin.com/jobs/view/devops-engineer-all-genders-at-optimyze-consulting-4336420465",
    "posted_date": "7 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQFTreXn05QSeQ/company-logo_100_100/company-logo_100_100/0/1737378923384/optimyze_consulting_logo?e=2147483647&v=beta&t=Lyc7g5GLI2DGaIpT4d5M5tfORwikqNsVTlcxPuimJeA",
    "description": "About Our Client:A Munich-based technology company specializing in secure, long-term digital data storage. They are a market leader in audit-proof storage solutions for hospitals and public administrations, serving well-known industrial clients. The company focuses on innovation in storage, AI, and smart home technologies.Your Role:DevOps / Platform & Build Engineer responsible for automating build pipelines, image creation, deployments, and standardizing tools and processes across multiple product lines. The role ensures scalable, reliable, and reproducible DevOps workflows to support software delivery.Your key responsibilities include:Developing and standardizing DevOps best practices and reusable pipelinesAutomating CI/CD workflows using GitHub Actions and JenkinsBuilding and managing Linux/Gentoo images, including kernel and init configurationManaging artifacts and registries such as GHCR/Artifactory and generating SBOMsUsing Ansible for system configuration and secret managementMonitoring and improving observability using Prometheus and GrafanaCollaborating closely with software, QA, and AI teams to optimize productivityYour Profile:Minimum 3 years of experience in DevOps, Build & Release, or Platform Engineering, ideally in embedded or on-premise environmentsStrong Linux skills, especially Gentoo (Portage, overlays, ebuilds, kernel/init)Networking knowledge (PXE/Boot, DHCP/TFTP, TLS, VLANs, firewalls, routing)Scripting and automation experience: Bash, Python, YAML (Actions/Jenkins), Git workflows, vCenterHands-on experience with CI/CD tools: Docker, GitHub Actions, Jenkins, GHCRFluent in German and EnglishWhat’s Offered:Working on exciting and impactful products (storage, AI, appliances)Modern tools, creative freedom, and real responsibilityCollegial culture with short communication channels and open collaborationFlexible working hours, remote work options, and individual professional developmentBenefits for sports, health, and retirement (30% employer contribution, ETF-based)By applying to this position, you consent to the processing of your personal data in accordance with our privacy policy.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQFTreXn05QSeQ/company-logo_100_100/company-logo_100_100/0/1737378923384/optimyze_consulting_logo?e=2147483647&v=beta&t=Lyc7g5GLI2DGaIpT4d5M5tfORwikqNsVTlcxPuimJeA",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "mid_senior"
  },
  {
    "title": "Platform Engineer - AI",
    "company": "NTT DATA, Inc.",
    "location": "Bad Homburg, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/platform-engineer-ai-at-ntt-data-inc-4298005218",
    "posted_date": "7 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHNV1DPBFCCEw/company-logo_100_100/company-logo_100_100/0/1719587181974/ntt_data_inc_logo?e=2147483647&v=beta&t=8j9xIeED4Yfu6ShBiPz8DmEvpcgcaqz5yQV5QIlnong",
    "description": "Make an impact with NTT DATAJoin a company that is pushing the boundaries of what is possible. We are renowned for our technical excellence and leading innovations, and for making a difference to our clients and society. Our workplace embraces diversity and inclusion – it’s a place where you can grow, belong and thrive.Your day at NTT DATAAs aPlatform Engineerat NTT DATA, you will lead the design of complex managed service solutions for our largest enterprise clients. Your role involves driving the strategic vision and direction for these solutions, combining technological expertise and business acumen to create IT strategies and roadmaps aligned with our clients' business objectives, KPIs, and SLAs.Key Responsabilities:Platform Development & ArchitectureDesign and build internal developer platforms (IDPs) that provide self-service infrastructure provisioning, deployment pipelines, and operational tooling through intuitive interfaces and APIsDevelop comprehensive platform architecture spanning on-premises, cloud, and hybrid environments with focus on scalability and reliabilityCreate developer-friendly abstractions for complex infrastructure concepts, including deployment workflows, environment management, and service discovery mechanismsOperating Systems & Infrastructure ManagementDesign, implement, and maintain enterprise-grade Linux and Windows server infrastructures, including system installation, configuration, patching, and optimizationPerform advanced system administration tasks including user management, security hardening, performance tuning, and troubleshooting across diverse OS environmentsImplement automated OS provisioning and configuration management using infrastructure-as-code principlesVirtualization TechnologiesDesign, deploy, and manage virtualized infrastructure using VMware vSphere/ESXi, Microsoft Hyper-V, and KVM hypervisorsConduct capacity planning and performance analysis of virtual infrastructures to optimize resource utilizationImplement backup and disaster recovery solutions for virtual machines including technologies like Veeam and SRMIntegrate virtualization platforms with storage area networks (SAN) and network-attached storage (NAS) solutionContainerization & OrchestrationDesign, implement, and maintain Kubernetes clusters across various environments (on-premises, cloud, hybrid) with focus on scalability and high availabilityOptimize container orchestration platforms for performance, cost-efficiency, and resource management including advanced scheduling algorithmsDevelop and maintain container deployment strategies, including blue-green deployments, canary releases, and rolling updatesImplement service mesh technologies and networking solutions for secure, scalable service-to-service communicationCluster & Resource ManagementImplement advanced scheduling algorithms and resource allocation strategies for distributed workloads across multi-cluster and multi-tenant environmentsDesign and optimize job scheduling systems with features including backfill algorithms, fair share scheduling, and advance reservationsManage cluster resource allocation including CPU, memory, storage, and specialized hardware (GPUs) with focus on maximizing utilization and minimizing latencyImplement automated scaling policies and resource optimization techniques for dynamic workload managementCI/CD Pipeline EngineeringBuild and maintain sophisticated continuous integration and deployment pipelines incorporating automated testing, security scanning, and progressive deployment strategiesIntegrate CI/CD systems with Kubernetes and container orchestration platforms for streamlined application deliveryImplement GitOps workflows and Infrastructure-as-Code practices using tools like Terraform, Pulumi, and AnsibleMonitoring & ObservabilityDesign and implement comprehensive monitoring, logging, and alerting systems providing visibility into platform health and application performanceDeploy observability solutions using tools like Prometheus, Grafana, Jaeger, and distributed tracing systemsImplement automated anomaly detection and performance optimization based on metrics, logs, and tracesRequired QualificationsEducation & ExperienceBachelor's degree in Computer Science, Information Technology, or related field, or equivalent practical experience5+ years of experience in platform engineering, DevOps, site reliability engineering, or similar infrastructure-focused rolesTechnical SkillsExpert-level knowledge of Linux system administration (Red Hat Enterprise Linux, CentOS, Ubuntu, Debian) including kernel tuning, process management, and security hardeningProficiency in Windows Server administration including Active Directory, Group Policy, and PowerShell scriptinVirtualization TechnologiesStrong experience with VMware vSphere/ESXi, Microsoft Hyper-V, and open-source hypervisors like KVMKnowledge of virtualization management tools including vCenter Server and System Center Virtual Machine ManageContainerization & OrchestrationExpert-level Kubernetes administration including cluster setup, networking, storage, and securityProficiency with Docker containerization and container image management preferable including RAFAY and RANCHER platformsExperience with container orchestration patterns and service mesh technologiesCloud PlatformsHands-on experience with major cloud platforms (AWS, Azure, Google Cloud Platform) including compute, networking, and storage servicesKnowledge of cloud-native technologies and hybrid cloud architectureProgramming & ScriptingProficiency in scripting languages including Python, Bash, Go, and PowerShell for automation and infrastructure managementExperience with Infrastructure-as-Code tools like Terraform, Pulumi, CloudFormation, or AnsibleMonitoring & ObservabilityExperience with monitoring solutions including Prometheus, Grafana, Datadog, ELK Stack, and distributed tracing toolsKnowledge of observability best practices including metrics, logs, and traces correlationCluster & Resource ManagementExperience with job schedulers and resource management systems like Slurm, PBS, or Kubernetes scheduling frameworksUnderstanding of distributed systems architecture and resource optimization techniquesSoft SkillsStrong analytical and problem-solving abilities with experience in complex system troubleshootingExcellent communication skills and ability to work effectively with cross-functional virtual teamsProduct mindset with focus on developer experience and platform usabilityExcellent ability to work effectively remote and virtually across Europe & InternationalPreferred QualificationsKubernetes certifications (CKA, CKAD, CKS) or equivalent cloud platform certificationsExperience with service mesh technologies (Istio, Linkerd) and API gateway solutionsKnowledge of security frameworks and compliance standards (SOC 2, ISO 27001, HIPAA)Experience with GitOps practices and advanced CI/CD patternsBackground in high-performance computing or large-scale distributed systemsWorkplace type:Remote WorkingAbout NTT DATANTT DATA is a $30+ billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long-term success. We invest over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure, and connectivity. We are also one of the leading providers of digital and AI infrastructure in the world. NTT DATA is part of NTT Group and headquartered in Tokyo.Equal Opportunity EmployerNTT DATA is proud to be an Equal Opportunity Employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, colour, gender, sexual orientation, religion, nationality, disability, pregnancy, marital status, veteran status, or any other protected category. Join our growing global team and accelerate your career with us. Apply today.Third parties fraudulently posing as NTT DATA recruitersNTT DATA recruiters will never ask job seekers or candidates for payment or banking information during the recruitment process, for any reason. Please remain vigilant of third parties who may attempt to impersonate NTT DATA recruiters—whether in writing or by phone—in order to deceptively obtain personal data or money from you. All email communications from an NTT DATA recruiter will come from an@nttdata.comemail address. If you suspect any fraudulent activity, pleasecontact us.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQHNV1DPBFCCEw/company-logo_100_100/company-logo_100_100/0/1719587181974/ntt_data_inc_logo?e=2147483647&v=beta&t=8j9xIeED4Yfu6ShBiPz8DmEvpcgcaqz5yQV5QIlnong",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "internship"
  },
  {
    "title": "Senior AI Engineer, Device Intelligence (m/f/d) - Jobbird.com",
    "company": "Jobster",
    "location": "Düsseldorf, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-ai-engineer-device-intelligence-m-f-d-jobbird-com-at-jobster-4322872816",
    "posted_date": "1 hour ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "description": "Bring more to life.At Danaher, our work saves lives. And each of us plays a part. Fueled by our culture of continuous improvement, we turn ideas into impact – innovating at the speed of life.Our 63,000+ associates work across the globe at more than 15 unique businesses within life sciences, diagnostics, and biotechnology.Are you ready to accelerate your potential and make a real difference? At Danaher, you can build an incredible career at a leading science and technology company, where we’re committed to hiring and developing from within. You’ll thrive in a culture of belonging where you and your unique viewpoint matter.Learn about the Danaher Business System which makes everything possible.TheSenior AI Engineer, Device Intelligence(m/f/d)will be a key member of the AI Product and Imaging Innovation team, reporting to its Senior Director. This new role is instrumental in the implementation of cutting-edge AI systems that leverage data created by Danaher devices to extract meaningful insights and dramatically improve user experience, with the goal of upleveling Danaher's devices across Life Sciences, Diagnostics and Biotechnology sectors. This position is remote in Germany.In this role, you will have the opportunity to:Collaborate with the Senior Director and the broader team to develop AI-driven product improvements and create new products for Danaher devices, with an initial focus on imaging devices and the aim of extracting more valuable insights.Design and implement advanced AI systems, including next-generation agentic workflows, LLMs and computer vision technologies, to enhance instrument automation and uplevel user capabilities.Work closely with cross-functional and cross company teams to translate product concepts into concrete AI architectures, ensuring alignment with product success criteria and measurable KPIs.Lead the technical implementation of AI projects of notable complexity, involving multiple functions and typically spanning multi-quarter timelines.Drive innovation in the AI software stack, focusing on maximizing value extraction from instruments for customers through AI systems.Collaborate with business stakeholders, technical experts, and subject matter experts to build comprehensive AI roadmaps for imaging products across various verticals.The essential requirements of the job include:Bachelor's degree in computer science, electrical engineering, life sciences or a related field. An advanced degree (MS or PhD) in a relevant area (i.e. Neural Networks, Foundation Model, Agentic Workflows, Machine Learning, Computer Vision) is preferred.Long standing experience in the Life Science, Diagnostics, Biotechnology or Tech Industry, including multiple years of experience with Agentic Systems, LLMs, and/or Multimodal AI.Demonstrable expertise with at least 3 of the following: convolutional neural networks, foundation models, vector databases, AI evaluation methods, RAG approaches, agentic frameworks.Proven track record of successful end-to-end implementation of AI projects in imaging applications, particularly in life sciences or healthcare domains.Strong programming skills in languages such as Python or C++, and extensive experience with deep learning frameworks (e.g., TensorFlow, PyTorch, OpenCV) and containerization technologies (e.g., Docker, Kubernetes).Demonstrated ability to work effectively with cross-functional teams, communicate complex technical concepts to both technical and non-technical stakeholders, and align AI development with product goals and roadmaps.Experience with cloud platforms (e.g., AWS, Google Cloud, Azure) for large-scale image processing and familiarity with hardware acceleration technologies (e.g. TPUs, GPUs, ARM-CPUs).It would be a plus if you also possess previous experience in:Experience with regulatory processes, especially for medical devices and AI/ML-based software as a medical device (SaMD).Familiarity with quality management systems and standards relevant to the life sciences and diagnostics industries.Knowledge of instrument control mechanisms and how they integrate with AI systems for enhanced automation.Join our winning team today. Together, we’ll accelerate the real-life impact of tomorrow’s science and technology. We partner with customers across the globe to help them solve their most complex challenges, architecting solutions that bring the power of science to life.For more information, visit www.danaher.com.#Jobster",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "in_time_range": true,
    "time_note": "",
    "experience_level": "associate"
  }
]