[
  {
    "title": "Databricks and/or AWS ML engineers wanted",
    "company": "Würth IT GmbH",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/databricks-and-or-aws-ml-engineers-wanted-at-w%C3%BCrth-it-gmbh-4340591113",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFk7VkqULJTJw/company-logo_100_100/company-logo_100_100/0/1676280823742/wrth_it_logo?e=2147483647&v=beta&t=Yhr5A2vODEkOc257e5u6LSqvrAwWxRA6jRY9q05IeJU",
    "description": "Company DescriptionWürth IT GmbH is an internationally active, medium-sized family business and a proud member of the Würth Group. With over 1,600 employees across 8 countries, we provide a wide range of IT solutions and services to medium-sized and large companies. Our expertise spans more than 20 years and includes SAP applications (ERP systems), e-business solutions, cloud services, IT security, and IT compliance services. As a company, we prioritize delivering exceptional service with the help of highly skilled and dedicated professionals. We offer numerous career development opportunities for both experienced professionals and graduates, as well as practical experience for students through internships and graduation projects.Role DescriptionThis is a full-time on-site position located in Berlin for skilled engineers specializing in Databricks and/or AWS Machine Learning (ML). The role involves designing, developing, and deploying ML models on Databricks or AWS platforms. You will collaborate with cross-functional teams to analyze data, implement pattern recognition techniques, develop algorithms, and apply advanced machine learning techniques like neural networks. Additionally, you will ensure the performance, security, and maintenance of deployed models and applications.QualificationsStrong knowledge of Pattern Recognition and Neural NetworksA solid foundation in Computer Science and proficiency in designing and implementing AlgorithmsProficiency in Statistics and an analytical mindset for data-driven decision-makingExperience working with Databricks and/or AWS Machine Learning servicesBachelor’s or master’s degree in Computer Science, Data Science, or a related fieldAbility to work collaboratively within cross-functional teamsStrong problem-solving skills and attention to detailFamiliarity with cloud platforms and their implementation is an advantageOffice can be in Berlin, Würzburg, Bad Mergentheim or Waldzimmern (Head Quarter)",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFk7VkqULJTJw/company-logo_100_100/company-logo_100_100/0/1676280823742/wrth_it_logo?e=2147483647&v=beta&t=Yhr5A2vODEkOc257e5u6LSqvrAwWxRA6jRY9q05IeJU",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Artificial Intelligence Specialist (m/w/d) | Machine Learning Engineer",
    "company": "PartSpace",
    "location": "Nuremberg, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/artificial-intelligence-specialist-m-w-d-machine-learning-engineer-at-partspace-4340690768",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQHZmzrpYlG5rw/company-logo_100_100/B56ZfGSY.1GQAU-/0/1751378399560/part_space_logo?e=2147483647&v=beta&t=XSyE6p1W07y4-cA8d1fIFeoh5GOGScSGxy9e7FQSSkA",
    "description": "Easy2Partsist einwachstumsstarkes, innovatives Unternehmen.Mit unserem ProduktPartSpacehaben wir eine klare Mission: Mit Künstlicher Intelligenz revolutionieren wir die Beschaffung von Bauteilen und Baugruppen. Dafür suchen wir motivierte Leute, die Lust haben, Verantwortung zu übernehmen und echte Veränderungen voranzutreiben.Bei uns bekommst du nicht nur Gestaltungsfreiraum und Mitspracherecht – du wirst Teil eines ambitionierten Teams, das täglich mit Leidenschaft daran arbeitet, unsere Kunden zu begeistern - und das ist unser Anspruch.Um unser weitere Wachstum gezielt zu unterstützen, suchen wir dich alsAI Spezialisten (m/w/d),der mit systemischem Denken und technischem Verständnis spezialisierte Tools wie CAD-Auswertungen, Simulationen, ERP-Systeme und Datenbanken sinnvoll mit LLM-basierten Anwendungen verbindet. In dieser Rolle gestaltest du keine Prompt-UIs oder Chatbots, sondern entwickelst durchdachte, robuste Informationsflüsse und Schnittstellen, die unseren Kunden echten Mehrwert bieten.Wenn du mit uns etwas bewegen willst, freuen wir uns,Dichkennenzulernen!AufgabenIdentifikation und Analyse von Dritt-Tools, deren Ergebnisse in LLM-Anwendungen eingebunden werden sollenKonzeption und Umsetzung robuster Schnittstellen und Pipelines zur Übergabe dieser Informationen an LLM-SystemeGestaltung von LLM-augmented Interfaces, bei denen Nutzende gezielt geführt statt gepromptet werdenExtraktion strukturierter Daten aus unstrukturiertem Text, z. B. mithilfe von LLM-gestützter NachverarbeitungZusammenarbeit mit Backend-, ML- und Produktteams, um vollständige End-to-End-Flows zu schaffenEvaluation der Antwortqualität anhand klar definierter Benchmarks, Nutzerfeedback und Usage-LoggingQualifikationDu hast ein abgeschlossenes technisches oder wirtschaftswissenschaftliches Studium im Bereich Informatik, Mathematik, Physik, Maschinenbau oder eine alternative AusbildungDu hast mehrjährige Erfahrung im Umgang mit Python und der Entwicklung neuer Machine Learning ModelleDu besitzt fundiertes Wissen im Umgang mit API's und DatenmodellierungErfahrungen mit OpenAI, LLama, LangChain oder ähnlichen Toolkits von VorteilDu verfügst über gute Deutschkenntnisse und wohnst in Nürnberg oder UmgebungBenefitsAttraktives Vergütungsmodell mit verschiedenen Bausteinen (Betriebliche Altersvorsorge, Weiterbildungen)Vergünstigungen über Corporate Benefits (Firmenfitness, Jobrad, uvm.)Hybrides Arbeiten ermöglicht flexibles Arbeiten aus dem Homeoffice sowie aus unserem BüroVerantwortung ab Tag 1 in einem ambitionierten Deep-Tech-UmfeldEin wachsendes Unternehmen mit viel Drive, Offenheit und TeamspiritWeiterbildungsmöglichkeiten und Raum für deine IdeenDu bist neugierig geworden?Dann bewirb dich jetzt!Be part of PartSpace.Lass uns gemeinsam wachsen!Wir freuen uns auf Dich.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQHZmzrpYlG5rw/company-logo_100_100/B56ZfGSY.1GQAU-/0/1751378399560/part_space_logo?e=2147483647&v=beta&t=XSyE6p1W07y4-cA8d1fIFeoh5GOGScSGxy9e7FQSSkA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Developer* Professional",
    "company": "valantic Software & Technology Innovations",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-developer-professional-at-valantic-software-technology-innovations-4336206368",
    "posted_date": "4 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFLTEpPwa13Fg/company-logo_100_100/company-logo_100_100/0/1677080599501/syroconag_logo?e=2147483647&v=beta&t=XfX0rBI6_7M2N-JUbfU0tLarw-F0ywZb6ESOdb0Fe2c",
    "description": "Die valantic Software & Technology Innovations GmbH mit Hauptsitz in Eschborn bei Frankfurt am Main ist ein Beratungs- und Software-Entwicklungsunternehmen mit den SchwerpunktenCloud SolutionsAutonomous Driving TechnologiesData AnalyticsIoT SolutionsMobility Services undProcess DigitalizationMehr als 150 Experten aus den Bereichen Prozessanalyse, Softwarearchitektur und Softwareentwicklung beraten und unterstützen namhafte national und international agierende Unternehmen bei der Konzeption und Realisierung von IT-Lösungen zur Optimierung und Automatisierung ihrer Geschäftsprozesse und bei der Entwicklung ihrer Produkte und Services. Unsere Kunden profitieren von unserem ausgewiesenen Branchen-Know-how, dem technologischen Expertenwissen sowie der Kundennähe und der innovativen Dynamik des Unternehmens.Wir suchen einen AI Developer* Professional mit Leidenschaft für die Entwicklung und Implementierung moderner AI-Anwendungen. Für unser AI-Team suchen wir nun an unseren Standorten in Eschborn bei Frankfurt oder in Berlin nach Verstärkung und Bereicherung durch deine Erfahrung.Du hast Interesse an Künstlicher Intelligenz, arbeitest gerne an innovativen Projekten und möchtest praxisnahe Lösungen mitgestalten? Dann sollten wir uns unbedingt kennenlernen!AufgabenAls AI Developer * Professional arbeitest du an der Umsetzung von AI-Anwendungen in verschiedenen Projektphasen – von der Anforderungsanalyse über die Modellierung bis hin zum produktiven BetriebDu setzt moderne Machine- und Deep-Learning-Verfahren ein, um komplexe Geschäftsprobleme unserer Kunden zu lösen.Du entwickelst, testest und optimierst ML-Modelle und generative AI-Anwendungen (z. B. LLM-basierte Systeme, Chatbots, Empfehlungssysteme oder Computer Vision Lösungen).Du implementierst robuste Datenpipelines und unterstützt bei der Integration der Modelle in bestehende IT- und Cloud-Umgebungen.Du arbeitest eng mit Data Scientists, Cloud Architects und Softwareentwicklern zusammen, um skalierbare End-to-End-AI-Lösungen zu realisieren.Du beteiligst dich an der Evaluation neuer AI-Technologien und Frameworks und bringst eigene Ideen aktiv in unsere Entwicklungsprozesse ein.Du präsentierst Ergebnisse und technische Konzepte sowohl für technische als auch nicht-technische Stakeholder.Du unterstützt bei der kontinuierlichen Weiterentwicklung unseres AI-Portfolios und trägst zu einer offenen Wissenskultur im Team bei.ProfilAbgeschlossenes Studium der Informatik, Mathematik, Physik oder eines vergleichbaren Fachbereichs2–4 Jahre Erfahrung in der Entwicklung von AI- oder Machine-Learning-AnwendungenFundierte Kenntnisse in Python und gängigen Frameworks wie PyTorch, TensorFlow, scikit-learn oder Hugging Face TransformersErfahrung im Umgang mit LLM-APIs (z. B. OpenAI, Azure OpenAI, Anthropic oder Mistral) und Frameworks wie LangChain oder LlamaIndexVerständnis für Datenverarbeitung, Feature Engineering und Modell-Deployment (z. B. über Docker, Kubernetes oder Azure ML)Erfahrung mit Cloud-Plattformen (vorzugsweise Microsoft Azure) und MLOps-KonzeptenGrundlegende Kenntnisse in Datenbanktechnologien (SQL, NoSQL) und API-EntwicklungGute Kommunikations- und PräsentationsfähigkeitenHohes Maß an Eigeninitiative, Teamgeist und LernbereitschaftSehr gute Deutsch- und EnglischkenntnisseNice-to-have: Erste Erfahrung mit Generative AI oder Computer Vision Projekten, Kenntnisse in CI/CD-Pipelines (z. B. Azure Pipelines, GitHub Actions), Zertifizierungen im Bereich Azure AI Engineer Associate oder vergleichbare Cloud-ZertifikateWir bietenBis zu 31 Tage UrlaubFlexible ArbeitszeitenMobile Office: Du entscheidest, wo du arbeitestUnbefristeter ArbeitsvertragAttraktive Benefits, z.B. Kindergartenzuschuss, Bike Leasing, Corporate Benefits,...Weiterentwicklungsmöglichkeiten, die zu dir passenFirmenevents wie Sommerfest, Weihnachtsfeier, Teamevents, Firmenausflug,...Sehr gute Verkehrsanbindung an S-Bahn oder Autobahn, kostenfreie ParkplätzeWir freuen uns darauf, dich kennenzulernen!Bei uns zählt der Mensch – nicht das Geschlecht. Wir setzen auf Vielfalt, lehnen Diskriminierung ab und denken nicht in Kategorien wie etwa Geschlecht, ethnische Herkunft, Religion, Behinderung, Alter oder sexuelle Identität.Important notePlease be advised that a valid work permit for Germany is required for non-EU citizens. Unfortunately, applications without a valid work permit and sufficient German language skills may not be considered.LNKD1_DE",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFLTEpPwa13Fg/company-logo_100_100/company-logo_100_100/0/1677080599501/syroconag_logo?e=2147483647&v=beta&t=XfX0rBI6_7M2N-JUbfU0tLarw-F0ywZb6ESOdb0Fe2c",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "ML Engineer - Speech (m/f/d)",
    "company": "voize",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ml-engineer-speech-m-f-d-at-voize-4181429589",
    "posted_date": "1 hour ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQGKGfUC5cZ_Rw/company-logo_100_100/company-logo_100_100/0/1630540204382/voize_de_logo?e=2147483647&v=beta&t=ZnSbRVft8VY2GOC7iiq0Se9nplwjodWmAiQ51Q04SgY",
    "description": "🎤 Why voize? Because we’re more than just a job!At voize, we’re revolutionizing the healthcare industry with AI:Nurses simply speak their documentation into their smartphones, and our AI automatically generates the correct entries. This saves each nurse an average of 39 minutes per day, improves the quality of documentation, and makes their daily work much more rewarding.voize is YCombinator-funded, already in use at over 600senior care homes, and has grown by 100% in the last 90 days.Our customers save over 3.5 million hours annually– time spent on people instead of paperwork.But this is just the beginning. With our self-developed voize AI, we’re transforming not only the healthcare industry, but also have the potential to create value in many other sectors – from healthcare to inspections.💡 Your MissionIf you're aMachine Learning Engineer experienced with Speech recognitionand are excited to work at thecutting edge of product design, applied ML research, and MLOps, then go ahead and apply! With us, you'll build products with direct user feedback, train AI models with real data, and ship new features to production every day.🤝 Your Skillset – What You Bring To The TableSeveral years hands-on experience in Deep Learning for speech recognition, including developing and optimising ASR-systems (not just academic research)Excellent foundation in STT (Speech-to-Text) system development with a focus on real-world applicationsExperience with owning the ML process end-to-end: from concept and exploration, to model productionization, maintenance, monitoring and optimizationShipped ML models to production with Python and PyTorchTrained new models from scratch and not just fine-tuning existing ones🚀 Your Daily Business – No two days are alikeTake ownership for the design, training, evaluation, and deployment of our deep learning models in the space of speech recognitionThe models you build and refine are at the heart of our applications and directly impact the end-userYou'll get to engineer large self-supervised trainings as well as fast inference for mobile devices and hosted environments🎯 Our Success Mindset – How we work at voizeResilience is one of your strengths – you see challenges as opportunities, not obstaclesIterative working suits you – you test, learn, and improve constantly instead of waiting for perfectionCommunication & feedback come naturally to you – you openly address issues and both give and receive constructive feedback🌱 Growing together – what you can expect at voizeWe are a fast-growing startup, that means you will tackle challenges, grow quickly, and make a real impact, giving healthcare professionals more time for real patient careWe foster an open, collaborative culture with regular team events, whether you work from our Berlin office or remotely from GermanyBecome a co-creator of our success with stock optionsGenerous perks: 30 vacation days plus your birthday off, Germany Transport Ticket, Urban Sports Club, regular company off-sites, and access to learning platforms such as Blinkist and AudibleYou decide when you work best, that means flexible working hours and a good hybrid set-up.✨Ready to talk?Apply now! 🚀We look forward to your application and can’t wait to meet you – no matter who you are or what background you have!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQGKGfUC5cZ_Rw/company-logo_100_100/company-logo_100_100/0/1630540204382/voize_de_logo?e=2147483647&v=beta&t=ZnSbRVft8VY2GOC7iiq0Se9nplwjodWmAiQ51Q04SgY",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Research Engineer",
    "company": "Enigma",
    "location": "North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-research-engineer-at-enigma-4322573737",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "description": "AI Research Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDKAI Research Engineer / ResearcherYour MissionYou'll be a key contributor translating cutting-edge multimodal AI research into robust, production-grade agentic systems. By integrating vision models, large language models (LLMs), and advanced retrieval pipelines, your work will power real-world automation workflows and significantly boost productivity across complex domains.You'll be working at a well-funded, early-stage venture led by a technical founding team with deep expertise in AI, engineering, and startup execution. They value engineering rigor, scientific innovation, and building impactful products that solve real operational problems.What You’ll Do1. Agentic SystemsDesign, build, and refine agentic systems using frameworks like LangGraph.Integrate LLM-based reasoning with multimodal models and domain-specific tool use.Rapidly transition validated concepts into reliable, production-ready solutions.2. Data Retrieval and OrganizationBuild and optimize multimodal data retrieval pipelines.Work with structured and unstructured documents such as technical drawings, plans, and visual datasets.3. EvaluationOffline Evaluation: Develop high-quality benchmarks and use-case-specific evaluation metrics.Online Evaluation: Monitor live system performance and implement learnings for continual improvement.Must-Have Qualifications5+ years of experience building production-grade ML systems OR 2+ years in a top-tier AI startup focused on agentic or multimodal systems.Expert Python development skills.Experience with agentic frameworks like LangGraph, CrewAI, or Agents SDK.Demonstrated ability to translate complex AI research into scalable, real-world systems.Nice-to-Have QualificationsFamiliarity with technical or visual domain-specific data types (e.g., CAD, IFC, point clouds).Experience with vector search technologies (FAISS, Weaviate, Pinecone, etc.).Previous work in an early-stage startup with fast iteration cycles.Experience training or fine-tuning cutting-edge multimodal or vision-language models.AI Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDK",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Machine Learning Engineer - (Vendor Data)",
    "company": "Delivery Hero",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-machine-learning-engineer-vendor-data-at-delivery-hero-4308205972",
    "posted_date": "2 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFOZbu6XEJUAw/company-logo_100_100/company-logo_100_100/0/1688740737160/delivery_hero_se_logo?e=2147483647&v=beta&t=jzixay9Wvsb0wQ7XPJDP1NDW_wPdZvs-PYut-TqyEOc",
    "description": "As the world’s pioneering local delivery platform, our mission is to deliver an amazing experience, fast, easy, and to your door. We operate in over 70+ countries worldwide, powered by tech, designed by people. As one of Europe’s largest tech platforms, headquartered in Berlin, Germany. Delivery Hero has been listed on the Frankfurt Stock Exchange since 2017 and is part of the MDAX stock market index. We enable creative minds to deliver solutions that create impact within our ecosystem. We move fast, take action and adapt. No matter where you're from or what you believe in, we build, we deliver, we lead. We are Delivery Hero.Job DescriptionBe our next Hero! - Join the world’s leading local delivery platform.We are looking for a Senior Machine Learning Engineer -Vendor Data(all genders) to join the Vendor Data tribe in our mission to deliver consistently amazing experiences.As part of our Vendor Team, you’ll be the driving force behind the success of thousands of restaurants, shops, and local businesses. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility and reach. Every feature you help build will create growth opportunities for businesses of all sizes, strengthening Delivery Hero’s ecosystem and impact.The Vendor Data tribe’s mission is to drive innovation, insight-driven decision making and to solve business problems through a culture of excellence and openness. The tribe comprises teams of skilled analysts, engineers, and scientists working together to deliver data solutions covering a host of business opportunities across all of Delivery Hero’s 70+ markets. Your contributions will empower vendors with advanced tools to manage their operations, boosting their visibility and reach.We are looking for a talented and motivated Senior Machine Learning Engineer (all genders) to work with best-in-class data science and AI models to drive our fundamental shift to machine learning in the Vendor vertical at Delivery Hero. You will be working with a team of ML Engineers and Data Scientists deploying advanced ML services to solve complex problems, delivering revenue for Delivery Hero at the frontline of our profitability journey.If you're a builder in machine learning who is hungry for a new adventure, an international workplace is waiting for you in the heart of Berlin!Your mission:Drive the design, build and maintain large-scale machine learning systems, ensuring they align with the Vendor strategic product goals, while optimising for performance and efficiencyArchitect scalable, reliable, and cost-efficient ML infrastructure to manage the entire ML lifecycle at scale.Set and uphold best practices for productionising ML, including monitoring, testing, reproducibility, and responsible AI practices.Collaborate with product, engineering, analysts, and data science teams to understand their needs and build solutions that optimise their workflows.Leverage cloud technologies to build reliable, efficient and robust systems for multiple teams. Influence by proactively suggesting how to leverage new technologies to support multiple downstream use cases.Raise the technical bar and foster a culture of excellence in ML engineering.Stay ahead of industry and academic trends, evaluating and introducing emerging technologies and methodologies that can shape Delivery Hero’s future ML capabilities.QualificationsWhat you'll need to be successful:Expert knowledge of data management, storage, and best MLOps and DataOps practices to enable performant and cost-efficient ML systems at scale.Deep expertise with modern ML frameworks and libraries (e.g. TensorFlow, PyTorch) and the ability to guide adoption of best practices across diverse ML use cases.Experience in designing, deploying, and operating large-scale machine learning systems in production, with a track record of delivering high-impact solutions.Hands-on experience with cloud platforms and distributed infrastructure (AWS, GCP, Azure) and proficiency in containerisation and orchestration technologies (eg Docker, Kubernetes) for building resilient ML services.Experience with CI/CD pipelines and commonly used tools in ML Engineering such as Metaflow, MLflow, Airflow, Grafana, and similar.Strong systems-level problem-solving skills, with the ability to balance performance, scalability, maintainability, and business impact.Great communication and collaboration skills, with the ability to partner effectively across product, engineering, and business stakeholders.Highly desirable:Proven ability to design and scale ML systems under strict latency, throughput, and cost constraints, balancing innovation with operational excellence.Demonstrated impact in translating advanced research into production systems that drive measurable business outcomes.Additional InformationWhat's in it for you?Ensuring you and all our Heroes are looked after, happy, and healthy is always on the menu. Because if you’re in good shape, then we’re in good shape.Make the most of our hybrid working model and join the team for face-to-face connection and collaboration in our beautiful Berlin campus 2 days a weekWe offer 27 days holiday with an extra day on 2nd and 3rd year of serviceWe will support you in developing yourself and your career growth opportunities: 1.000 € Educational Budget, Language Courses, Parental Support and access to the Udemy Business platform to explore a variety of online courses.Get moving and release those wonderful, mind-boosting endorphins: Health Checkups, Meditation, Gym & Bicycle SubsidyCash. Dough. Cheddar. Whatever you call it, we’ll help you with it: Employee Share Purchase Plan, Sabbatical Bank, Public Transportation Ticket Discount, Life & Accident Insurance, Corporate Pension PlanThe power of getting together over some food is unrivaled. Here are a few ways to help you do that. All the yum: Digital Meal Vouchers, Food Vouchers, Corporate Discounts. Courses.Ready to join our team? If you’re excited to grow, collaborate and be part of the world’s leading delivery platform, we’d love to hear from you.Apply today!We believe diversity and inclusion are key to creating not only an exciting product, but also an amazing customer and employee experience. Fostering this starts with hiring - therefore we do not discriminate on the basis of racial identities, religious beliefs, color, national origin, gender identities or expressions, sexual orientations, age, marital or disability statuses, or any other aspect that makes you, you. We encourage you to let us know if you need any accommodations or specific accessibility support to ensure a smooth interview experience—just include it in your application. You're welcome to share your pronouns (he/she/they) right from the start so we can address you respectfully from our first contact.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFOZbu6XEJUAw/company-logo_100_100/company-logo_100_100/0/1688740737160/delivery_hero_se_logo?e=2147483647&v=beta&t=jzixay9Wvsb0wQ7XPJDP1NDW_wPdZvs-PYut-TqyEOc",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AWS AI Engineer (m/w/d)",
    "company": "Devoteam | AWS Partner",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/aws-ai-engineer-m-w-d-at-devoteam-aws-partner-4317945042",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQFl_HF_kfEocw/company-logo_100_100/company-logo_100_100/0/1633003466877/devoteam_a_cloud_logo?e=2147483647&v=beta&t=zhtEmgYvjkaXRhCaEMpXOF2bRf-y_x7ZZDIalmPQrZ8",
    "description": "Wir fördern Dein persönliches Wachstum, gemeinsamen Erfolg und neue Innovationen.Devoteam ist ein führendes Technologieberatungsunternehmen, spezialisiert auf digitale Transformation, Cloud-Innovation und KI. Als globaler AWS Premier Consulting Partner beschleunigen wir mit über 11.000 Experten die Cloud-Journey von Unternehmen.Unsere AI & Machine Learning Practice entwickelt intelligente Lösungen und GenAI-Anwendungen, die Geschäftsprozesse transformieren. Als Teil des AI Engineering Teams implementierst du modernste Machine-Learning-Lösungen auf Basis von AWS AI/ML Services wie SageMaker und Bedrock.In deiner Rolle als AWS AI Engineer (m/w/d) und strategischer Berater gestaltest du komplexe ML-Plattformen und KI-basierte Anwendungen. Du arbeitest eng mit Kunden zusammen, teilst dein Wissen und treibst innovative, ethische KI-Lösungen voran, die messbaren Geschäftserfolg liefern. Wir suchen kreative Problemlöser, die traditionelle Prozesse durch intelligente Automatisierung herausfordern und die KI-Transformation strategisch mitgestalten wollen.#AI DRIVEN TECH CONSULTINGDeine BenefitsModerne Büros in Toplage in Frankfurt und MünchenHybrid Working mit der Möglichkeit, Deine Arbeitszeiten und Arbeitsorte individuell auf Deine Bedürfnisse anzupassenUnsere Devoteam Academy bietet Dir ein großes Angebot an zertifizierten Trainings und SprachkursenInternationale Entwicklungsmöglichkeiten für Deinen Karriereboost bei DevoteamGaming-Lounge für Deine kreative Pause zwischen Meetings und CallsGet-Together Partys und Teamevents für den regelmäßigen Austausch und Spaß mit Deinen Kollleg:innenMitarbeiter:innen-Prämien beim Werben von neuen Mitarbeiter:innenModerne IT-Ausstattung - Wähle aus einer Vielzahl von Möglichkeiten das für Dich passende ProduktCorporate Benefits mit großer Auswahl an zahlreichen Angeboten für nahezu jeden BereichJobrad und Firmenwagen Angebot mit attraktiven steuerlichen Vorteilen für DichBetriebliche Altersvorsorge, Direktversicherungen und vermögenswirksame Leistungen stehen Dir als Zusatzleistungen zur VerfügungIntegration Day inkl. Mentorenprogramme für Deinen perfekten Start bei DevoteamStellenbeschreibungKey Job ResponsibilitiesEnd-to-End ML Platform Engineering: Konzeption und Implementierung skalierbarer ML-Infrastrukturen mit AWS SageMaker, MLflow und Kubeflow für komplette MLOps-Pipelines von Experimentation bis ProductionGenAI Solution Development: Design und Entwicklung von Large Language Model (LLM) Anwendungen mit Amazon Bedrock, Custom Foundation Models und RAG-Architekturen für intelligente GeschäftsanwendungenAdvanced ML Model Engineering: Entwicklung und Deployment von Custom Machine Learning Models für Computer Vision, NLP und Predictive Analytics mit TensorFlow, PyTorchAI-Powered Application Architecture: Integration von KI-Services in bestehende Geschäftsanwendungen durch MCPs, APIs, Microservices und Event-driven Architectures für nahtlose AI-ExperiencesMLOps and Model Governance: Aufbau von automatisierten ML-Pipelines mit CI/CD, Model Monitoring, A/B Testing und Explainable AI für verantwortungsvolle KI-Implementierung (ISO42001)Real-time Inference Systems: Implementierung hochperformanter, latenz-optimierter ML-Inference-Systeme mit SageMaker Endpoints, Lambda und Container-based DeploymentsData Science Collaboration: Enge Zusammenarbeit mit Data Scientists bei der Productionisierung von ML-Models und Optimierung von Training/Inference WorkflowsAI Strategy Consulting: Beratung von Kunden bei AI Adoption Strategies, Use Case Identification und Technology Selection für erfolgreiche KI-TransformationenA DAY IN THE LIFEDein Tag beginnt oft mit einem Review der ML Model Performance Metriken und Monitoring Dashboards, um sicherzustellen, dass alle produktiven AI-Services optimal funktionieren. Anschließend führst du ein Technical Stand-up mit deinem AI Engineering Team durch, um den Fortschritt aktueller ML-Implementierungen zu besprechen und mögliche Herausforderungen bei der Model Deployment zu adressieren.Der Vormittag wird häufig von Innovation Sessions mit Kunden geprägt, in denen du AI Use Cases evaluierst und technische Machbarkeitsstudien durchführst - sei es die Implementierung/Konzeptionierung von IDP, RAG systemen oder die Entwicklung einer Custom GenAI-Anwendung für Automatisierung. Dabei arbeitest du eng mit Product Ownern und Business Stakeholdern zusammen, um sicherzustellen, dass die KI-Lösung echten Mehrwert generiert.Nachmittags konzentrierst du dich auf hands-on Development und Experimentation: Du optimierst Hyperparameter für bessere Model Performance, entwickelst neue Feature Engineering Pipelines oder implementierst Techniques wie Prompt Engineering und Fine-tuning für LLMs. Ein wichtiger Teil deiner Arbeit ist auch das Technical Mentoring von Junior AI Engineers - du teilst deine Expertise in Code Reviews und leitest Workshops zu modernen ML Engineering Practices.Den Tag schließt du häufig mit Research und Innovation Aktivitäten ab, wo du neue AWS AI Services evaluierst, Proof-of-Concepts für emerging AI Technologies entwickelst oder an Thought Leadership Content wie Technical Blogs oder Conference Presentations arbeitest.QualifikationenBasic Qualifications3+ Jahre Erfahrung in Machine Learning Engineering, AI-Entwicklung und Deployment von ML-Modellen in produktiven UmgebungenSolide AWS AI/ML Services Kenntnisse (SageMaker, Bedrock, Comprehend, Rekognition, Textract) und deren Integration in GeschäftsanwendungenProgrammier-Expertise in Python mit umfassender Erfahrung in ML-Frameworks (TensorFlow, PyTorch, scikit-learn, Hugging Face)MLOps und DevOps Kenntnisse für automatisierte ML-Pipelines, Model Versioning und Container-basierte DeploymentsSolide Mathematik- und Statistik-Grundlagen für das Verständnis von ML-Algorithmen und Model EvaluationAusgezeichnete Problemlösungsfähigkeiten und die Fähigkeit, komplexe Business-Probleme in AI-Lösungen zu übersetzenFließende Deutsch- und Englischkenntnisse für internationale AI-Projekte und globale ZusammenarbeitPreferred QualificationsAWS AI/ML Zertifizierungen (Machine Learning Specialty, Data Analytics) oder vergleichbare Industry-ZertifikationenGenAI und LLM Expertise mit praktischer Erfahrung in Prompt Engineering, Fine-tuning und RAG-ImplementierungDeep Learning Spezialisierung in Computer Vision, NLP oder Reinforcement Learning mit nachweisbaren ProjekterfolgenCloud-native AI Architecture Erfahrung mit Serverless ML, Edge AI und Multi-Cloud AI-DeploymentsResponsible AI Kenntnisse in Bias Detection, Explainable AI und AI Ethics für regulierte BranchenResearch Background mit wissenschaftlichen Publikationen, Patents oder Beiträgen zu Open-Source ML-ProjektenIndustry-spezifische AI-Erfahrung in Bereichen wie Healthcare AI, FinTech ML oder Industrial IoT AnalyticsThought Leadership durch AI Conference Presentations, Technical Blogging oder Community ContributionsZusätzliche InformationenMelde Dich bei unserem Recruiting TeamDurch unsere offene Unternehmenskultur legen wir großen Wert darauf, Menschen die Chance zu geben, sich zu bewerben, auch wenn nicht alle spezifischen Fähigkeiten der Stellenbeschreibung erfüllt werden. Wir sind überzeugt, dass jede:r Einzelne durch unsere Unterstützung und ein motiviertes Team sein volles Potenzial entfalten kann.Wir freuen uns auf Deine Bewerbung!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQFl_HF_kfEocw/company-logo_100_100/company-logo_100_100/0/1633003466877/devoteam_a_cloud_logo?e=2147483647&v=beta&t=zhtEmgYvjkaXRhCaEMpXOF2bRf-y_x7ZZDIalmPQrZ8",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Generative AI Engineer",
    "company": "Few&Far",
    "location": "Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/generative-ai-engineer-at-few-far-4336150215",
    "posted_date": "23 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGx4QOQIRKnnA/company-logo_100_100/company-logo_100_100/0/1702997372240/fewandfar_logo?e=2147483647&v=beta&t=ZakUnLTLt47I0pNuOllcEOGxJCFNhKOTAJk5TtLGmxc",
    "description": "Senior AI Platform / LLM Ops Engineer (Founding Team)📍 Berlin or Munich (On-site 4 days p/w) | 💰 €75k–130k | 🚀 Founding Team RoleA fast-growing European startup is on a mission to bringenterprise-grade cloud efficiencyto startups and SMEs. They’ve built anAI DevOps agentthat automatically identifies and fixes wasted spend in AWS environments — delivering20% savings from day one.Backed by leading European VCs, they’re now expanding their founding engineering team (<5 people) to build and scale the platform from the ground up.🔧 The RoleAs aSenior AI Platform / LLM Ops Engineer, you’ll take ownership of the core infrastructure and AI execution layer powering the product.You’ll:Set up the initialAWS/EKS foundation(Terraform, workloads, queues, workers)Buildintelligent request routingacross multiple model providers with retries, fallback logic, and budget controlsImplement fullend-to-end observability: traces, logs, token usage, latency, answer qualityEstablish asafe CI/CD pathwayfor shipping prompts, tools, and model integrationsDesign scalable architecture that can support the journey from startup → enterpriseCollaborate with DevOps, AI, backend, and frontend teams to turn the AI agent into a world-class production systemThis is a role where you’ll influence every key technical decision and have huge ownership from day one.🧠 About YouYou’re someone who has:Operatedproduction AI/LLM workloadswith SLAsMulti-provider routing, rate limit handling, retries, fallbacksPer-tenant budget + latency constraintsOwnedAWS + EKS/Kubernetesinfrastructure using TerraformCI/CD with gated approvals, canaries, secure releasesExperience withauthentication/authorizationpatterns (Cognito/OIDC, multi-tenant isolation, per-workspace throttling)Builtobservability and guardrail stacksfor LLM systems (e.g., LangSmith, tracing, metrics, token spend tracking, audit logs)You thrive in fast-moving environments, want meaningful ownership, and enjoy turning ambiguity into architecture.✨ What’s on OfferFounding team role (<5 engineers)Exceptional ownership and autonomyZero bureaucracy, massive product impactCompetitive salary:€75k–130k(flexible for exceptional candidates)On-site inBerlin or Munich",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGx4QOQIRKnnA/company-logo_100_100/company-logo_100_100/0/1702997372240/fewandfar_logo?e=2147483647&v=beta&t=ZakUnLTLt47I0pNuOllcEOGxJCFNhKOTAJk5TtLGmxc",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Briink - Backend Engineer, AI/ML & Climate Tech (Mid to Senior)",
    "company": "Briink",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/briink-backend-engineer-ai-ml-climate-tech-mid-to-senior-at-briink-4340586464",
    "posted_date": "2 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQHX0layf3nGjw/company-logo_100_100/company-logo_100_100/0/1671718136637/briinkedin_logo?e=2147483647&v=beta&t=GotQAAEHzUxYhuITacEh0BsPak3gCsw2rWwEHLPtyeg",
    "description": "What we doAt Briink, we're helping accelerate the transition to a sustainable future by creating the next-generation of AI powered tools for sustainability and ESG teams on the frontlines of solving the climate crisis.We believe that AI is the key to unlocking the future of sustainable business. With over 50 enterprise clients—including some of the world's largest firms—we’re already transforming how organizations manage their ESG data with AI. Our technology helps sustainability teams uncover actionable insights from unstructured data sources, making it easier to drive compliance, efficiency, and impact at scale.Backed by over €7 million in capital, including a freshly closed funding round, and supported by leading venture capital funds, Briink is at the forefront of ESG innovation. We’re based at the heart of Europe’s AI revolution—the AI Campus in Berlin—where we are building a future where AI helps accelerate the transition to a sustainable future.READ BEFORE APPLYING: Adding ashort intro video ()is mandatory for this position. We do this to get a better sense of candidates before continuing the process and find it really helps. Any application without a video will be rejected by default. Find instructions at the bottom of the post. No cover letter is required. Thank you!Your roleAs Briink’s Senior Backend Engineer, you will work as part of the product and engineering team to bring the cutting edge of LLMs to environmental and sustainability teams and help advance Briink’s mission to use AI to accelerate the transition to a sustainable economy! This includes both using your knowledge and experience as backend engineer to design and build new backend services, as well as helping ensure the scalability, robustness, and maintainability of our platform as it scales. Your main responsibilities will include:Ideate, design and scope new backend functionalityin collaboration with the team to support new AI powered functionality and meet users needsBuild new backend functionalityand deliver on backend tasks, both as a individual contributor and while pair-programming with the team through to production and into the hands of our usersBe the guardian of the backend servicesand ensure they are high quality, maintaining them and striving to improve their robustness as we scaleBe a core member of the product and engineering team.Briink is a collaborative team and we really enjoy working together to build Briink into a successful company that has mission impact at scale. You will therefore work closely as part of a cross-discipline team spanning frontend, backend and AI systems, contributing your thoughts to a range of problems from across the stack as well as the wider business to help ensure all the work we do pushes in the same direction an helps achieve our mission!Your profileTechnical Requirements4+ years of backend engineering experience,ideally building SaaS or AI productsFluency in python:Including strong proficiency with base python as well as modern libraries and frameworks from backend engineering in python (e.g. fastAPI)Experience building APIs: Including experience building modern API services, strong understanding of REST principles, and preferably experience developing production-grade external-facing APIs (e.g. rate-limiting, versioning, client-SDKs, monitoring)Experience with databases:Especially Postgres or other relational database systems, as well as ORMs like sqlalchemy and data migration tooling such as AlembicExperience with Cloud Services:Especially experience building scalable cloud infrastructure and deep familiarly with cloud services beyond compute (preferably in GCP), including experience designing cloud systems that can distribute heavy-processing jobs such as AI workloadsSoftware quality focus:CI/CD, containerization, observability (logging, tracing, metrics), and robust testing practicesFluency in English (C1 level):With the ability to clearly communicate complex topics to diverse stakeholders from both technical and non-technical backgroundsTechnical Nice to havesAI/LLMs:Any hands-on experience with building or working with AI systems and especially LLM systems (either through foundation model providers or OS hosted models) and the challenges of these systems would be a major plusAI agents:Strong interest in AI agents and emerging autonomous system architecturesServerless frameworks:Experience with Modal or other serverless/orchestration frameworks for scalable AI workloadsDistributed-systems:Expertise in distributed-systems patterns (e.g i/o task queue), make code run fast and safely in parallel; testing for speed, load, and failure casesCaching:Hands-on experience with caching layers (e.g Redis) and CDN strategiesIntegration test:Experience with setting up tests (e.g. integration tests)Observability:Experience with advanced observability (logging, metrics, tracing), especially with API services and cloud systemsDomain driven design:Experience with domain-driven design for backend architectureSecurity:Any experience with AuthN/AuthZ (e.g OAuth 2.0, JWT) and secrets management as well as any experience with security/compliance methodologies, such as least-privilege principlesUnderstanding or interest in sustainability:Including an interest in sustainability climate, or ESG topics and a desire to use your skills to help accelerate the climate transitionEven if your experience doesn’t align precisely with all the criteria, we encourage you to apply! This is just our wishlist but many people miss out on opportunities because they feel they don’t fit every requirement—we believe in growth, not perfection!The type of person we're looking for...Technically minded:You enjoy building software product and have experience solving technical challenges in real world settings. Any experience with building backend services for B2B SaaS products and/or AI LLM systems would be a major plus but we’re really looking for technically minded people who enjoy solving hard problems and want to apply their knowledge, experience and energy to building the next generation of AI tools for ESG and sustainability professionalsStrong communicator and collaborator:You communicate proactively and in a structured way, considering trade-offs and keeping different stakeholders informed, with strong ability to communicate clearly, share ideas freely, and are not afraid to admit when we they don’t know something. You have clear communication, both verbal and written, in English, and can build strong internal and external relationships in order to collaborative effectively. You use your strong communication skills to develop clear documentation standards, architectural decision records and a rigorous code-review culture.Low-ego:You understand the importance of being kind and respectful, you practice active listening and help set the tone for healthy and productive communication. You genuinely appreciates others’ contributions and have a high level of trust in others and respects their expertise (while also being confident in their own expertise)Giving and receiving clear, helpful feedback- You are used to giving and receiving feedback and understand how to address issues in a productive and clear way. You give and receive feedback with care and clarity, and always with the intention of making each other better. It would be a major plus if you have any experience and/or enjoy mentoringPragmaticattitude: You can adjust plans, priorities, or approaches when the context changes, whether it’s a product pivot, shifting timelines, or new team structures. You have high personal agency, drive and ability to figure things out, learn and iterate in a positive way and are able to “disagree and commit” where necessary to stay focused on achieving our goals. You are a ‘builder’ and aim to pragmatically integrate AI into real-world products, moving beyond research to create tangible, impactful solutionsWhat we offerCompetitive Remuneration:As a core member of our team, you will receive a competitive salary and equity package, reflecting your ownership of Briink's success and your role in shaping Briink’s futurePurpose-Driven Mission:ESG data has the power to create a more sustainable world, but today it presents more challenges than solutions. We believe AI can change that. Be part of the transition to an AI-powered, sustainable worldFlexible Working:Our work philosophy is built on flexibility. While we do like to come to the office (in Berlin or London) to collaborate in person, this is a hybrid role with opportunities for some remote work within European time zonesTrust and Ownership:At Briink, we empower you to own your projects with the option for growing into new roles. We believe in giving people purpose, mastery and autonomy of their craft and trust to drive your own initiativesDynamic Work Environment:Based at the Merantix AI Campus, Berlin’s hub for AI innovation, you’ll work in a diverse, collaborative environment. With frequent events and opportunities for cross-company collaboration, you’ll be part of a thriving ecosystem of AI startups and expertsQuarterly hackathons:We truly believe in the importance of curiosity and experimentation as both a learning opportunity and strategic advantage. We therefore have a learning budget to explore new technologies and regular hackathons to prototype new ideasREAD BEFORE APPLYING: Adding ashort intro video ()is mandatory for this position. We do this to get a better sense of candidates before continuing the process and find it really helps. Any application without a video will be rejected by default. Find instructions at the bottom of the post. No cover letter is required. Thank you!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQHX0layf3nGjw/company-logo_100_100/company-logo_100_100/0/1671718136637/briinkedin_logo?e=2147483647&v=beta&t=GotQAAEHzUxYhuITacEh0BsPak3gCsw2rWwEHLPtyeg",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Microsoft Azure AI Engineer (m/w/d)",
    "company": "Devoteam | Microsoft Partner",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/microsoft-azure-ai-engineer-m-w-d-at-devoteam-microsoft-partner-4317938517",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "description": "Do you want to not only experience but actively shape the uniqueDNAofMicrosoft? ThenDevoteam MCloudis the right place for you!Our core business is cloud-based enterprise customer projects, where we drive the most modern Microsoft technologies.The building blocks that distinguish us:2,100 Microsoft certifications completed in 20221,000 Microsoft experts in EMEA600 customers25 years of industry experience18 Advanced Specializations - including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"6 Solution Partner Designations3 MVPsImagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now atDevoteam M Cloud!#Creative Tech For Better ChangeYour Benefits:In addition to our revolutionary New Way of Work culture, you'll enjoy:Modern offices in prime locations in Munich, Frankfurt, and StuttgartFlexible remote or hybrid working with the option to customize your working hours and locations to your individual needsOur Devoteam Academy offers a wide range of certified trainings and language coursesInternational development opportunities to boost your career at DevoteamGaming lounge for your creative break between meetings and callsGet-together parties and team events for regular exchange and fun with your colleaguesEmployee referral bonuses for attracting new employeesModern IT equipment - choose the product that suits you best from a variety of optionsCorporate benefits with a large selection of numerous offers for almost every area\"Jobrad\" (company bike) offer with attractive tax advantages for youCompany pension scheme, direct insurance, and capital-forming benefits are available to you as additional servicesIntegration Day including mentoring programs for your perfect start at DevoteamJob DescriptionBuild AI/ML Solutions: Develop and implement AI/ML models to solve specific business problems. This could range from training predictive models (for example, forecasting equipment failures in manufacturing or customer behavior in insurance) to creating NL solutions like document classifiers or chatbots. You will use Azure Machine Learning for experiment tracking and model management, and write code (Python/SQL) for data processing and model training.Azure Cloud Implementation: Deploy AI solutions on Azure cloud infrastructure. Set up necessary resources such as Azure ML workspaces, Azure Functions or AKS for hosting models, and Azure Data Factory pipelines for data movement. Ensure that the deployment is done following Devoteam’s and Microsoft’s guidelines for security and compliance (important for enterprise clients in regulated industries like pharma and finance).Data Preparation & Feature Engineering: Work with data engineers to gather and prepare datasets required for machine learning. You will contribute to data preprocessing steps, writing data transformation scripts, defining features, handling data quality issues, to ensure models are trained on high-quality data. Utilize PySpark and SparkSQL in Azure Databricks or Microsoft Fabric for large-scale data processing when needed.Experimentation & Model Tuning: Conduct rigorous experiments to improve model performance. This involves trying out different algorithms or model architectures, tuning hyperparameters, and evaluating results. You’ll leverage Azure ML pipelines to automate training runs and compare metrics. For instance, you might compare a classical machine learning approach with a deep learning approach for a given problem and choose the best-performing model.Integration of AI Services: Make use of Azure’s AI services to accelerate development. Incorporate pre-built AI capabilities via Azure Cognitive Services (e.g. language translation, OCR, sentiment analysis) when appropriate instead of building from scratch. For example, if a project requires extracting text from PDFs and analyzing sentiment, you might use Azure Form Recognizer and Text Analytics as part of the solution before applying a custom model.MLOps & Monitoring: Implement the basics of MLOps for the solutions you build. Register models, create release pipelines for deploying them, and set up monitoring (for both system performance and model accuracy drift over time). Ensure that logging and alerting are in place so that any issues in production (like an API downtime or data drift causing model degradation) can be quickly identified and addressed.Collaboration & Documentation: Collaborate within a crossfunctional team, taking guidance from the Senior AI Engineer and Architect while also providing input based on your own expertise. Participate in design discussions, sprint planning, and code reviews. Additionally, document your work (datasets used, model assumptions, API specs) thoroughly to aid maintainability and knowledge transfer within the team and to clients’ IT teams.QualificationsExperience: Approximately 3–6 years of experience developing AI or machine learning solutions. You should have real-world project experience beyond internships – for example, having built predictive models or data-driven applications that were deployed or used in a production environment.Language Skills: fluent in german and englishTechnical Skills: Proficient in programming (Python required; familiarity with another language like R or C# is a plus). Solid understanding of machine learning algorithms and workflows (data preprocessing, feature selection, model training, evaluation). Experience with frameworks such as Scikit-learn; exposure to deep learning frameworks (TensorFlow, PyTorch) is nice to have.Azure Familiarity: Hands-on experience with Azure cloud services, especially those relevant to data and AI. This could include having used Azure Machine Learning for training/deploying models, Azure Databricks or HDInsight for big data, and Azure Storage/Azure SQL for data. If you have experience with Azure Cognitive Services or Azure OpenAI, mention it – it’s advantageous as we frequently use these in projects.Data Engineering Basics: Comfortable working with databases and writing SQL. Experience in handling data pipelines or ETL processes is important since ML engineers in our team often need to fetch and prepare data. Knowledge of Azure Data Factory or Synapse pipelines is a plus.Azure AI Foundry: Exposure to Azure AI Foundry is a plus.Problem Solving: Strong analytical thinking and problem-solving ability in the context of debugging models and data issues. For example, you should be able to investigate why a model is underperforming (inspecting data imbalance, feature issues, etc.) or why a pipeline failed, and then propose fixes.Team Player: Good communication and teamwork skills. You’ll be part of an agile project team, so being able to discuss ideas, ask questions, and share findings with colleagues (developers, architects, project managers) is key. Ability to clearly document and explain your work to others (including client technical teams) is required.Continuous Learner: Given that Devoteam is building up its AI capabilities, we value engineers who are proactive about learning new tools and techniques. You should demonstrate an interest in staying up-to-date with AI innovations (for instance, new developments in LLM frameworks or MLOps tools). We encourage and support learning, so a mindset of continuous improvement will fit well here.Education & Certification: Bachelor’s degree in Computer Science, Engineering, Mathematics, or related field. In lieu of a degree, substantial relevant experience will be considered. Certifications like Azure AI Engineer Associate (AI-102) or Azure Data Engineer show your commitment to excellence and are a plus – if you haven’t obtained them yet, you should be willing to pursue certification with our support. Any certification or coursework in data science/ML (e.g. Microsoft DP-100 exam or Databricks ML certificates) is also beneficial.Additional InformationYou will be part of a collaborative, remote-friendly team that values continuous learning anddelivering impact through modern cloud-native data solutions.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Microsoft Azure AI Engineer (m/w/d)",
    "company": "Devoteam | Microsoft Partner",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-microsoft-azure-ai-engineer-m-w-d-at-devoteam-microsoft-partner-4317928859",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "description": "Do you want to not only experience but actively shape the uniqueDNAofMicrosoft? ThenDevoteam MCloudis the right place for you!Our core business is cloud-based enterprise customer projects, where we drive the most modern Microsoft technologies.The building blocks that distinguish us:2,100 Microsoft certifications completed in 20221,000 Microsoft experts in EMEA600 customers25 years of industry experience18 Advanced Specializations - including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"6 Solution Partner Designations3 MVPsImagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now atDevoteam M Cloud!#Creative Tech For Better ChangeYour Benefits:In addition to our revolutionary New Way of Work culture, you'll enjoy:Modern offices in prime locations in Munich, Frankfurt, and StuttgartFlexible remote or hybrid working with the option to customize your working hours and locations to your individual needsOur Devoteam Academy offers a wide range of certified trainings and language coursesInternational development opportunities to boost your career at DevoteamGaming lounge for your creative break between meetings and callsGet-together parties and team events for regular exchange and fun with your colleaguesEmployee referral bonuses for attracting new employeesModern IT equipment - choose the product that suits you best from a variety of optionsCorporate benefits with a large selection of numerous offers for almost every area\"Jobrad\" (company bike) offer with attractive tax advantages for youCompany pension scheme, direct insurance, and capital-forming benefits are available to you as additional servicesIntegration Day including mentoring programs for your perfect start at DevoteamJob DescriptionAI Solution Development: Design and implement end-to-end AI solutions on Azure. This includes developing machine learning models (e.g. predictive algorithms, classification, anomaly detection) and integrating them into cloud applications. You will write code (primarily in Python) to build and train models, leveraging Azure Machine Learning, Azure Databricks, or custom frameworks as needed.Build and deploy intelligent applications using Azure AI Foundry, leveraging prompt orchestration, grounding with Azure AI Search, and agent orchestration features for enterprise-scale GenAI use cases. Independently implement GenAI workflows using Foundry.Generative AI & LLMs: Play a key role in developing Generative AI solutions for clients. Experiment with and implement large language model (LLM) based applications using Azure OpenAI Service and frameworks like LangChain for building conversational agents or Retrieval-Augmented Generation (RAG) pipelines. For example, you might build a chatbot that uses an LLM with enterprise data or create a summarization service for insurance documents. Ensure prompt engineering and fine-tuning are done in a robust, secure manner.Azure AI Services Integration: Utilize Azure Cognitive Services (e.g. for vision, speech, language) and Azure AI services to speed up solution development. For instance, integrate Azure Cognitive Search for semantic search in a knowledge retrieval solution, or use Form Recognizer in a document processing pipeline. Combine these services with custom ML where appropriate to meet client requirements.MLOps and Deployment: Take ownership of deploying and operationalizing ML models. You will containerize models or use Azure ML endpoints, set up CI/CD pipelines (using Azure DevOps or GitHub Actions) for automated model training and deployment, and implement monitoring for model performance drift. Ensure that the AI solutions can scale in production and adhere to DevOps best practices for reliability.Data Pipeline Collaboration: Work closely with Data Engineers to ensure the data needed for AI models is available, reliable, and well-prepared. Contribute to data pipeline design for ML – e.g., help define feature engineering processes or streaming data ingestion for real-time inference – so that models can be trained on and serve high-quality data.Cross-Functional Collaboration: Collaborate with Solution Architects (like the ML/AI Architect) to translate high-level architectural designs into concrete implementation tasks. Work alongside other specialists such as data scientists and cloud engineers to build secure, end-to-end AI solutions that integrate into the client’s ecosystem. This includes participating in code reviews, knowledge sharing, and troubleshooting sessions within the team.Client Support & Iteration: Support client teams in adopting and understanding the AI solutions. This could involve preparing technical documentation, demoing functionalities to stakeholders, and iterating on models based on user feedback or changing requirements. Ensure that AI solutions meet responsible AI guidelines and data privacy/security standards as expected by enterprise clients.QualificationsExperience: 5+ years of hands-on experience in AI/ML engineering or data science roles, with a focus on building and deploying solutions (not just research or academic projects). You should have taken multiple ML projects through the full lifecycle from data preparation to production deployment.Language Skills: fluent in german and englishAzure & Data Skills: Strong experience with the Azure AI/Data ecosystem. This includes proficiency with Azure Machine Learning (for running experiments, managing models), familiarity with Azure Databricks or Spark for big data processing, and usage of Azure data services like Data Factory, Azure Data Lake, or Synapse Analytics. Experience integrating Azure Cognitive Services or Azure OpenAI into applications is a big plus.Experience using Azure AI Foundry for building LLM-based applications or orchestrating AI workflows. Understanding of Foundry templates, grounding data sources, and integration with Azure OpenAI and Azure Search is expected.ML & Programming: Proficiency in Python and common ML/DL libraries (pandas, scikit-learn, TensorFlow or PyTorch, etc.). Ability to write clean, efficient code for data processing and model training. Experience with NLP or computer vision techniques is helpful. You should also be comfortable with Git and collaborative coding practices.MLOps Knowledge: Practical understanding of MLOps and model lifecycle management. Experience setting up automated training pipelines, model versioning, CI/CD for ML, and using tools like MLflow for tracking experiments. Knowledge of Docker and Kubernetes (e.g., Azure Kubernetes Service) for deploying ML services is advantageous.Generative AI & LLMs: Exposure to Large Language Models or other generative AI technologies. You should understand how to use pre-trained models (like GPT-based models) and fine-tune or prompt them for specific tasks. Direct experience with libraries/frameworks for LLMs (LangChain, Hugging Face Transformers, etc.) or vector databases for RAG is a strong plus, as many of our projects explore these emerging areas.Problem-Solving & Communication: Strong problem-solving skills with the ability to debug complex issues in data pipelines or model performance. Equally important are good communication skills – you can explain technical work to team members and occasionally to client technical staff. You work well in a team and can mentor more junior colleagues if they join (even though we currently hire only experienced professionals).Certifications: Azure and data/AI certifications are highly regarded. Ideally, you hold or are willing to obtain Microsoft Certified: Azure AI Engineer Associate (AI-102) certification, which demonstrates ability to design and implement Azure AI solutions. Other relevant certs like Azure Data Scientist (DP-100) or Databricks Generative AI Engineer certification are a bonus. Devoteam will support you with time and resources to achieve certifications.Education: Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience). A master’s in AI/Data Science is a plus but not required.Additional InformationYou will be part of a collaborative, remote-friendly team that values continuous learning anddelivering impact through modern cloud-native data solutions.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Platform Engineer – AI Enablement & Automation (w/m/d)",
    "company": "Luxoft Germany",
    "location": "Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/platform-engineer-%E2%80%93-ai-enablement-automation-w-m-d-at-luxoft-germany-4336081616",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "description": "Project descriptionWe’re looking for an AI Platform Engineer to build the foundation for an agentic AI platform that connects data, models, and agents and runs reliably at cloud scale. This is a hands-on engineering role at the intersection of data, infrastructure, and AI—you’ll ship usable platform components, not just infrastructure, and actively use AI tools to accelerate your own work. The goal: safe, observable, and scalable AI automation that teams can adopt quickly.ResponsibilitiesEngineer robust data and cloud foundations to support AI workloads and automation at scale across AWS environments.Design and implement agentic AI systems as part of a broader automation stack—developing self-orchestrating workflows, APIs, and reusable platform components.Build automation and observability solutions using Infrastructure-as-Code (Terraform/CDK) and modern monitoring frameworks.Integrate data pipelines with intelligent orchestration layers to enable autonomous experimentation and deployment.Collaborate across disciplines—partnering with data engineers, AI scientists, and platform specialists to embed AI capabilities into core operations.Champion responsible and scalable AI automation, ensuring compliance, reliability, and transparency by design.SkillsMust haveStrong software engineering background with Python, TypeScript, or similar languages.Proven experience building and automating cloud infrastructure using AWS (EC2, IAM, S3, Lambda, CloudWatch, etc.) and Infrastructure-as-Code tools (Terraform/CDK).Solid understanding of data engineering principles—pipeline design, data flow orchestration, and API integration.Experience with CI/CD pipelines and Git-based workflows.Demonstrated experience in use of AI tools (e.g., claude, Copilot, LangChain, agent frameworks) to enhance productivity.A self-driven, curious problem solver who experiments and iterates toward impactful solutions.Nice to have skillsExperience deploying or integrating agentic AI architectures, such as orchestration frameworks or autonomous agents.Knowledge of RAG pipelines, embeddings, and vector databases (e.g., Weaviate, Qdrant).Familiarity with Kubernetes/EKS and observability tools (New Relic, OpenTelemetry).Understanding of model hosting and optimization (vLLM, Triton, HuggingFace).Awareness of data governance and responsible AI practices in enterprise or regulated settings.Languages:English C1 - Fluent",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist, Internship, Germany - BCG X",
    "company": "BCG X",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-internship-germany-bcg-x-at-bcg-x-4317970254",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQG5QvGxuM1nwQ/company-logo_100_100/company-logo_100_100/0/1669842853621/bcg_x_logo?e=2147483647&v=beta&t=sE4HSmdip5CgpouGgpe_vo7rXlLZMG9eCD8vF2uLtBU",
    "description": "Locations: München | Berlin | FrankfurtWho We AreBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we help clients with total transformation-inspiring complex change, enabling organizations to grow, building competitive advantage, and driving bottom-line impact.To succeed, organizations must blend digital and human capabilities. Our diverse, global teams bring deep industry and functional expertise and a range of perspectives to spark change. BCG delivers solutions through leading-edge management consulting along with technology and design, corporate and digital ventures—and business purpose. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, generating results that allow our clients to thrive.We Are BCG XWe’re a diverse team of more than 3,000 tech experts united by a drive to make a difference. Working across industries and disciplines, we combine our experience and expertise to tackle the biggest challenges faced by society today. We go beyond what was once thought possible, creating new and innovative solutions to the world’s most complex problems. Leveraging BCG’s global network and partnerships with leading organizations, BCG X provides a stable ecosystem for talent to build game-changing businesses, products, and services from the ground up, all while growing their career. Together, we strive to create solutions that will positively impact the lives of millions.What You'll DoOur BCG X teams own the full analytics value-chain end to end: framing new business challenges, designing innovative algorithms, implementing, and deploying scalable solutions, and enabling colleagues and clients to fully embrace AI. Our product offerings span from fully custom-builds to industry specific leading edge AI software solutions.You'll be part of our rapidly growing team who will have a chance to apply data science methods and analytics to real-world business situations across a variety of industries to drive significant business impact. You'll have the chance to partner with clients in a variety of BCG regions and industries, and on key topics like climate change, enabling them to design, build, and deploy new and innovative solutions.Additional responsibilities will include developing and delivering thought leadership in scientific communities and papers as well as leading conferences on behalf of BCG X. Successful candidates are intellectually curious builders who are biased toward action, creative, and communicative.We Are Looking For Dedicated Individuals With a Passion For Data Science, Statistics, Operations Research And Redefining Organizations Into AI Led Innovative Companies. Successful Candidates Possess The FollowingComfortable in a client-facing role with the ambition to lead teamsLikes to distill complex results or processes into simple, clear visualizationsExplain sophisticated data science concepts in an understandable mannerLove building things and are comfortable working with modern development tools and writing code collaboratively (bonus points if you have a software development or DevOps experience)Significant experience applying advanced analytics to business situations and a proven ability to synthesize complex dataDeep understanding of modern machine learning techniques and their mathematical underpinnings, and can translate this into business implications for our clientsHave strong project management skills & ability to work collaboratively in diverse teamsExcellent oral and written communication skills in both German and English (C1/C2)#BCGXjobWhat You'll BringRequirementsCurrently enrolled in a university master’s or PhD degree program in Computer Research Science, Data Science, Statistics, Operations Research, or related field - please provide all academic certificates (A-level, Bachelor, Master)TechnologiesProgramming Languages: Python#BCGXjobAdditional infoJoin the GroupAre you ready to take the next step in your career? Apply now and become part of a community of forward-thinkers. Here, challenges and collaboration go hand in hand, your ideas are valued, and your potential knows no bounds. Let’s work together to develop innovative solutions and create a lasting impact on businesses and society.Boston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.BCG is an E - Verify Employer. Click here  for more information on E-Verify.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQG5QvGxuM1nwQ/company-logo_100_100/company-logo_100_100/0/1669842853621/bcg_x_logo?e=2147483647&v=beta&t=sE4HSmdip5CgpouGgpe_vo7rXlLZMG9eCD8vF2uLtBU",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Platform Engineer – AI Enablement & Automation (w/m/d)",
    "company": "Luxoft Germany",
    "location": "Ingolstadt, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/platform-engineer-%E2%80%93-ai-enablement-automation-w-m-d-at-luxoft-germany-4336261049",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "description": "Project descriptionWe’re looking for an AI Platform Engineer to build the foundation for an agentic AI platform that connects data, models, and agents and runs reliably at cloud scale. This is a hands-on engineering role at the intersection of data, infrastructure, and AI—you’ll ship usable platform components, not just infrastructure, and actively use AI tools to accelerate your own work. The goal: safe, observable, and scalable AI automation that teams can adopt quickly.ResponsibilitiesEngineer robust data and cloud foundations to support AI workloads and automation at scale across AWS environments.Design and implement agentic AI systems as part of a broader automation stack—developing self-orchestrating workflows, APIs, and reusable platform components.Build automation and observability solutions using Infrastructure-as-Code (Terraform/CDK) and modern monitoring frameworks.Integrate data pipelines with intelligent orchestration layers to enable autonomous experimentation and deployment.Collaborate across disciplines—partnering with data engineers, AI scientists, and platform specialists to embed AI capabilities into core operations.Champion responsible and scalable AI automation, ensuring compliance, reliability, and transparency by design.SkillsMust haveStrong software engineering background with Python, TypeScript, or similar languages.Proven experience building and automating cloud infrastructure using AWS (EC2, IAM, S3, Lambda, CloudWatch, etc.) and Infrastructure-as-Code tools (Terraform/CDK).Solid understanding of data engineering principles—pipeline design, data flow orchestration, and API integration.Experience with CI/CD pipelines and Git-based workflows.Demonstrated experience in use of AI tools (e.g., claude, Copilot, LangChain, agent frameworks) to enhance productivity.A self-driven, curious problem solver who experiments and iterates toward impactful solutions.Nice to have skillsExperience deploying or integrating agentic AI architectures, such as orchestration frameworks or autonomous agents.Knowledge of RAG pipelines, embeddings, and vector databases (e.g., Weaviate, Qdrant).Familiarity with Kubernetes/EKS and observability tools (New Relic, OpenTelemetry).Understanding of model hosting and optimization (vLLM, Triton, HuggingFace).Awareness of data governance and responsible AI practices in enterprise or regulated settings.Languages:English C1 - Fluent",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Founding Engineer Intern (AI start-up from hackerhouses in Latam)",
    "company": "Clera",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/founding-engineer-intern-ai-start-up-from-hackerhouses-in-latam-at-clera-4340643567",
    "posted_date": "13 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQEqacy-HCh9kg/company-logo_100_100/B4EZmHqLbUHcAQ-/0/1758917605529/getclera_logo?e=2147483647&v=beta&t=aypnUYyhgH4i9EMlnyNLwUoyMyU5xayLyMRmu1HiZZk",
    "description": "Special setup: We are a German founding team & have a German entity and arebuilding from hackerhouses in Latam for the US market.We believe there is great talent in Berlin but are looking for a strong engineer who will join us in-person in Latam. Clera is a fast-growing AI start-up that is rethinking the way how top talents find their next dream jobs. We are working with some of the leading start-ups like Mintlify, Luminai and Windsurf, many in AI, all VC-backed.We believe that the recruiting process needs to be talent-first to make it easy to get in touch with those companies, be coached in the journey and actually get hired.TasksAs we are quickly growing and see a massive tech challenge in automating the work of the $600B global headhunting industry, we are looking for a cracked founding engineer intern. You will work directly with our CTO & Co-Founder Daniel and ship your own features to production every day. You will have a strong impact on building our fully agentic system to automate the headhunting process end-to-end.RequirementsFullstack experience working on production - you'll ship to production every dayWorking experience with TypeScript & ReactOpen to joining us in-person in Latin AmericaBenefitsSet-up: Hacker-Houses in LatAm:Live & build with a small founding team—think YC sprint, but sunny & adventuresZero commute, 10× feedback loops & team bondingOur international team flew in from Germany, Canada, Sweden, ColombiaWorking on the largest talent market - the US - on the same time zoneIt’s very intense but also extremely productive & fun to live and work from the same AirBnb as a team",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQEqacy-HCh9kg/company-logo_100_100/B4EZmHqLbUHcAQ-/0/1758917605529/getclera_logo?e=2147483647&v=beta&t=aypnUYyhgH4i9EMlnyNLwUoyMyU5xayLyMRmu1HiZZk",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist / AI Consultant (m/w/d)",
    "company": "IBM",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-ai-consultant-m-w-d-at-ibm-4340670572",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.You will work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.Curiosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you will be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground-breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.In this role, you will work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver deep technical and industry expertise to a wide range of public and private sector clients around the world. Our delivery centers offer our clients locally based skills and technical expertise to drive innovation and adoption of new technology.Your Role And ResponsibilitiesAs a Data Scientist / AI Consultant at IBM, you will work to solve business problems using leading edge and open-source tools such as Python, R, and TensorFlow, combined with IBM tools and our AI application suites. You will prepare, analyze, and understand data to deliver insights, predict emerging trends, and provide recommendations to stakeholders. In your role, you may be responsible for:Analysis, preparation and management of complex data sourcesImplementing and validating predictive and prescriptive models and creating and maintaining statistical models with a focus on big data & incorporating machine learning techniques in your projectsWriting programs to cleanse and integrate data in an efficient and reusable mannerDevelopment of scalable and robust data and machine learning pipelinesApplication of traditional machine learning algorithms as well as modern deep learning approaches (such as GenAI)Implementation, integration and monitoring of AI / ML modelsWorking in an agile, collaborative environment, partnering with other scientists, engineers, consultants and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behavioursDocumentation and communication with internal and external clients (e.g. business and IT departments) and stakeholders to understand and define business needs and appropriate modelling techniques to provide analytical solutions as well as presentation of proposed solutions and results.Evaluating modelling results and communicating the results to technical and non-technical audiences.Preferred EducationMaster's DegreeRequired Technical And Professional ExpertiseStrong fundamentals in Mathematics and/or Computer Science (algorithms)Proven knowledge and experience inAI and ML frameworks (e.g. PyTorch)GenAI and agentic AI architectures (RAG, agentic patterns, etc.)AI governance and monitoringStrong ability to communicate with and coach senior executives, translating technical insights into business strategyYou have strong technical and analytical abilities, a knack for driving impact and growth, and experience with programming/scripting in Python.You're great at solving problems by looking at things differently, debugging, troubleshooting, and designing & implementing solutions to complex technical issues.You thrive on teamwork and have excellent verbal and written communication skills.Excellent verbal and written German language skills (C1 level)Preferred Technical And Professional ExperienceAzure platform expertise, ideally with Azure Foundry and related AI/ML servicesExperience in DevOps and MLOps, including CI/CD pipelines, ML lifecycle management, and deploymentBackground in the chemical or process industry, with awareness of domain-specific challenges and dataUnderstanding of AI governance, safety, and ethical considerationsExperience in consulting or client-facing roles with a focus on value realization through AIDemonstrated ability to scale AI solutions from prototype to production and integrate across enterprise systems",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist, Internship, Germany - BCG X",
    "company": "BCG X",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-internship-germany-bcg-x-at-bcg-x-4317966612",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQG5QvGxuM1nwQ/company-logo_100_100/company-logo_100_100/0/1669842853621/bcg_x_logo?e=2147483647&v=beta&t=sE4HSmdip5CgpouGgpe_vo7rXlLZMG9eCD8vF2uLtBU",
    "description": "Locations: München | Berlin | FrankfurtWho We AreBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we help clients with total transformation-inspiring complex change, enabling organizations to grow, building competitive advantage, and driving bottom-line impact.To succeed, organizations must blend digital and human capabilities. Our diverse, global teams bring deep industry and functional expertise and a range of perspectives to spark change. BCG delivers solutions through leading-edge management consulting along with technology and design, corporate and digital ventures—and business purpose. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, generating results that allow our clients to thrive.We Are BCG XWe’re a diverse team of more than 3,000 tech experts united by a drive to make a difference. Working across industries and disciplines, we combine our experience and expertise to tackle the biggest challenges faced by society today. We go beyond what was once thought possible, creating new and innovative solutions to the world’s most complex problems. Leveraging BCG’s global network and partnerships with leading organizations, BCG X provides a stable ecosystem for talent to build game-changing businesses, products, and services from the ground up, all while growing their career. Together, we strive to create solutions that will positively impact the lives of millions.What You'll DoOur BCG X teams own the full analytics value-chain end to end: framing new business challenges, designing innovative algorithms, implementing, and deploying scalable solutions, and enabling colleagues and clients to fully embrace AI. Our product offerings span from fully custom-builds to industry specific leading edge AI software solutions.You'll be part of our rapidly growing team who will have a chance to apply data science methods and analytics to real-world business situations across a variety of industries to drive significant business impact. You'll have the chance to partner with clients in a variety of BCG regions and industries, and on key topics like climate change, enabling them to design, build, and deploy new and innovative solutions.Additional responsibilities will include developing and delivering thought leadership in scientific communities and papers as well as leading conferences on behalf of BCG X. Successful candidates are intellectually curious builders who are biased toward action, creative, and communicative.We Are Looking For Dedicated Individuals With a Passion For Data Science, Statistics, Operations Research And Redefining Organizations Into AI Led Innovative Companies. Successful Candidates Possess The FollowingComfortable in a client-facing role with the ambition to lead teamsLikes to distill complex results or processes into simple, clear visualizationsExplain sophisticated data science concepts in an understandable mannerLove building things and are comfortable working with modern development tools and writing code collaboratively (bonus points if you have a software development or DevOps experience)Significant experience applying advanced analytics to business situations and a proven ability to synthesize complex dataDeep understanding of modern machine learning techniques and their mathematical underpinnings, and can translate this into business implications for our clientsHave strong project management skills & ability to work collaboratively in diverse teamsExcellent oral and written communication skills in both German and English (C1/C2)#BCGXjobWhat You'll BringRequirementsCurrently enrolled in a university master’s or PhD degree program in Computer Research Science, Data Science, Statistics, Operations Research, or related field - please provide all academic certificates (A-level, Bachelor, Master)TechnologiesProgramming Languages: Python#BCGXjobAdditional infoJoin the GroupAre you ready to take the next step in your career? Apply now and become part of a community of forward-thinkers. Here, challenges and collaboration go hand in hand, your ideas are valued, and your potential knows no bounds. Let’s work together to develop innovative solutions and create a lasting impact on businesses and society.Boston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.BCG is an E - Verify Employer. Click here  for more information on E-Verify.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQG5QvGxuM1nwQ/company-logo_100_100/company-logo_100_100/0/1669842853621/bcg_x_logo?e=2147483647&v=beta&t=sE4HSmdip5CgpouGgpe_vo7rXlLZMG9eCD8vF2uLtBU",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Engineer Microsoft Azure (m/w/d)",
    "company": "Devoteam | Microsoft Partner",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-engineer-microsoft-azure-m-w-d-at-devoteam-microsoft-partner-4317940435",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "description": "Do you want to not only experience but actively shape the uniqueDNAofMicrosoft? ThenDevoteam MCloudis the right place for you!Our core business is cloud-based enterprise customer projects, where we drive the most modern Microsoft technologies.The building blocks that distinguish us:2,100 Microsoft certifications completed in 20221,000 Microsoft experts in EMEA600 customers25 years of industry experience18 Advanced Specializations - including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"6 Solution Partner Designations3 MVPsImagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now atDevoteam M Cloud!#Creative Tech For Better ChangeYour Benefits:In addition to our revolutionary New Way of Work culture, you'll enjoy:Modern offices in prime locations in Munich, Frankfurt, and StuttgartFlexible remote or hybrid working with the option to customize your working hours and locations to your individual needsOur Devoteam Academy offers a wide range of certified trainings and language coursesInternational development opportunities to boost your career at DevoteamGaming lounge for your creative break between meetings and callsGet-together parties and team events for regular exchange and fun with your colleaguesEmployee referral bonuses for attracting new employeesModern IT equipment - choose the product that suits you best from a variety of optionsCorporate benefits with a large selection of numerous offers for almost every area\"Jobrad\" (company bike) offer with attractive tax advantages for youCompany pension scheme, direct insurance, and capital-forming benefits are available to you as additional servicesIntegration Day including mentoring programs for your perfect start at DevoteamJob DescriptionDesign, build, and maintain scalable data pipelines using Azure Data Services, Databricks and/or Microsoft Fabric.Consolidate structured/unstructured data into governed lakes and warehouses for BI and AI use cases.Implement robust data models and storage architectures (Star, Snowflake, Medallion).Ensure data integrity and quality, lineage, security, and governance across the full lifecycle.[Optional] Automate workflows using Azure DevOps, GitHub Actions, or other CI/CD tools.Collaborate in client workshops, translating requirements into technical Azure-native solutions.Optimize performance and cost efficiency of the data infrastructure.Example Use Cases You Will Work On:Modernize legacy ETL workflows with Azure-native services.Build semantic models for enterprise BI using Star/Snowflake schema.Design medallion-structured ingestion flows to enable batch or near-real-time analytics.Deliver curated, governed data products for BI and AI use cases.QualificationsMust-Haves:3+ years of real-world project experience as a Data Engineer in Azure ecosystems.fluent in german and englishAdvanced SQL and performance tuning.Strong background in dimensional data modeling and familiarity with ETL patterns, like medallion architecture.Hands-on experience with Azure Data Factory, Synapse, Databricks, and ideally Microsoft Fabric.Nice-to-Haves:Proficiency in Microsoft Power BI.Exposure to Data Mesh or domain-oriented data architectures.Experience with Delta Lake, Unity Catalog, or Feature Store.Soft SkillsStrong communication and documentation skills (German & English).Agile, delivery-oriented mindset.Collaborative and self-directed approach.Analytical thinking with a focus on value delivery.Ability to translate business requirements into technical solutions.Experience working in agile, cross-functional teams.Additional InformationYou will be part of a collaborative, remote-friendly team that values continuous learning anddelivering impact through modern cloud-native data solutions.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Platform Engineer – AI Enablement & Automation (w/m/d)",
    "company": "Luxoft Germany",
    "location": "Stuttgart, Baden-Württemberg, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/platform-engineer-%E2%80%93-ai-enablement-automation-w-m-d-at-luxoft-germany-4336161349",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "description": "N/A",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFQiTy0PD1lvQ/company-logo_100_100/company-logo_100_100/0/1674562046761?e=2147483647&v=beta&t=56lif3yzIqFMPZfRLJnVDVcPCBG2D3c6oyTxEwy9wGA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist mit Schwerpunkt KI (w/m/d)",
    "company": "MAN Truck & Bus SE",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-mit-schwerpunkt-ki-w-m-d-at-man-truck-bus-se-4336077017",
    "posted_date": "2 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGe94ZHvYEgug/company-logo_100_100/company-logo_100_100/0/1714998947051/man_commercial_vehicles_logo?e=2147483647&v=beta&t=JuobakFIeHIee8YuVDUDMSNPvIYdojJutR2hn7KWFIk",
    "description": "N/A",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGe94ZHvYEgug/company-logo_100_100/company-logo_100_100/0/1714998947051/man_commercial_vehicles_logo?e=2147483647&v=beta&t=JuobakFIeHIee8YuVDUDMSNPvIYdojJutR2hn7KWFIk",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Software Architect – Modernisation, AI, Microservices, Cloud – €100,000",
    "company": "Findr",
    "location": "Heidelberg, Baden-Württemberg, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/software-architect-%E2%80%93-modernisation-ai-microservices-cloud-%E2%80%93-%E2%82%AC100-000-at-findr-4336081469",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGWglccnQCx3w/company-logo_100_100/company-logo_100_100/0/1694524772645?e=2147483647&v=beta&t=uqvEKl2lsDYapO_-g51Pf9GscA160eRw6rFGDqwEnJw",
    "description": "N/A",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGWglccnQCx3w/company-logo_100_100/company-logo_100_100/0/1694524772645?e=2147483647&v=beta&t=uqvEKl2lsDYapO_-g51Pf9GscA160eRw6rFGDqwEnJw",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Software Development Engineer (m/f/d)",
    "company": "Fujitsu",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-software-development-engineer-m-f-d-at-fujitsu-4309626337",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHNKrGAQbM1XA/company-logo_100_100/B4DZjqnZFVHsAU-/0/1756282853333/fujitsu_logo?e=2147483647&v=beta&t=dX2LPDRpe204SDyXKmDO76lmTK2o95qqRI_uun9vj_Q",
    "description": "Job DescriptionTransform your world with us!Fujitsu is a global partner for digital transformation and aims to make the world more sustainable and foster trust in society through innovation. With approximately 124,000 employees, Fujitsu supports its customers in over 100 countries in solving some of humanity's greatest challenges. Its service and solution portfolio for sustainable transformation is based on five key technologies: Computing, Networks, AI, Data & Security, and Converging Technologies.We offer a supportive and flexible working environment that promotes work-life balance and actively supports individual career development. Diversity, equal opportunities, and inclusion are core values of our corporate culture. Together we have the future in mind - and for that, we need people with vision.Apply now as aSenior Software Development Engineer – AWS Blu Age & Generative AI ModernizationLocation: Flexible across Europe (Remote/Hybrid options)About The RoleJoin our Elite Transformation Product Team, led by the Global Mainframe Modernization Solutions Director, and work at the sharp edge of enterprise IT modernization.As a Senior Software Development Engineer, your technical expertise will help maintain, evolve, and innovate our modernization transformation tooling — with a strong focus on AWS Blu Age/AWS Transform and Generative AI programming.In this role, you will not only deliver solutions but also develop new capabilities within our transformation engines, inspired by insights and patterns emerging from real-world migration projects. Your mission is to continually improve performance, automation, scalability, and accuracy — making our modernization tools faster, smarter, and more efficient.Key ResponsibilitiesTechnical ownership of maintaining, enhancing, and optimizing our core transformation tooling and frameworks.Design and implement innovative features for transformation engines, derived from lessons learned and challenges encountered in ongoing client migration projects.Apply Generative AI programming (LLMs, AI APIs, automation) to enable advanced code transformation, pattern recognition, smart documentation, and automated testing capabilities.Collaborate closely with architects, product owners, and migration specialists to align tooling improvements with delivery needs and client expectations.Ensure tooling performance and stability at enterprise scale while introducing automation that shortens delivery cycles.Contribute to standardization and industrialization of modernization products to support repeatable, highquality migrations across global engagements.What We’re Looking ForBachelor’s or Master’s degree in Computer Science, Engineering, or equivalent.5+ years in software development for enterprise systems.Proven AWS Blu Age project experience in mainframe or legacy migration.Hands-on Generative AI programming skills in applied enterprise scenarios (LLMs, AI-assisted code generation, migration automation).Demonstrated ability to maintain and extend transformation tooling with commercial impact.Strong programming capabilities in Java, COBOL (analysis), or equivalent enterprise languages.Agile/Scrum delivery exposure; global and cross-functional teamwork skills.Why Join the Elite Transformation Product Team?Play a central technical role in evolving the company’s most strategic modernization product line.Drive tooling innovation that directly shapes delivery efficiency and market leadership.Collaborate with top modernization leaders, architects, and enterprise clients worldwide.Competitive remuneration, international exposure, and a culture of technical innovation.Why Join Us?Direct impact on market expansion, revenue growth, and the modernization service line's leadership goals.Collaborate closely with strategic leaders, technical experts, and global clients.Exposure to groundbreaking modernization programs blending cloud, AI, and next-gen delivery models.Competitive compensation, global reach, and strong pathways for career progression.Ready to build the next generation of transformation tooling?Apply today - and engineer the future of mainframe modernization.Interested?We look forward to receiving your application, stating your earliest possible start date and salary expectations. http://www.fujitsu.com/de/",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQHNKrGAQbM1XA/company-logo_100_100/B4DZjqnZFVHsAU-/0/1756282853333/fujitsu_logo?e=2147483647&v=beta&t=dX2LPDRpe204SDyXKmDO76lmTK2o95qqRI_uun9vj_Q",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Staff Machine Learning Engineer (m/f/d)",
    "company": "Buynomics",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-staff-machine-learning-engineer-m-f-d-at-buynomics-4311470191",
    "posted_date": "21 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQEPkqcyEegFxw/company-logo_100_100/company-logo_100_100/0/1674483770737/buynomics_logo?e=2147483647&v=beta&t=5QXMRCpCClnRRJ2_6I2kkdwCAjy96dfjqw3GIJrsXRA",
    "description": "N/A",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQEPkqcyEegFxw/company-logo_100_100/company-logo_100_100/0/1674483770737/buynomics_logo?e=2147483647&v=beta&t=5QXMRCpCClnRRJ2_6I2kkdwCAjy96dfjqw3GIJrsXRA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Site Reliability Engineer (24x7 Operational Support)",
    "company": "Ad Astra Consultants",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/site-reliability-engineer-24x7-operational-support-at-ad-astra-consultants-4340561136",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQHQ1NQY7JM_rQ/company-logo_100_100/company-logo_100_100/0/1630653143248/ad_astra_consultants_singapore_logo?e=2147483647&v=beta&t=GmVC7J3Hv6TPSlXnQwx1-ZQVCoQReyfr-EdymUcmZL0",
    "description": "We are hiring for our client who is a global technology company, home to more than 223,000 people across 60 countries, delivering industry-leading capabilities centered around digital, engineering, cloud and AI, powered by a broad portfolio of technology services and products.We work with clients across all major verticals, providing industry solutions for Financial Services, Manufacturing, Life Sciences and Healthcare, High Tech, Semiconductor, Telecom and Media, Retail and CPG and Public Services. Consolidated revenues as of 12 months ending June 2025 totaled $14 billion.Site Reliability Engineer (24x7 Operational Support)Mandate conditions :Skill required : Observability- Network, Open Observability, SNMP protocol, SSH, Prometheus, Visuvalition- Grafana, CICD- Gitub, Cluster management, Private Cloud, Kubernetes Cluster, Alert management, Operation- Logstack, Troubleshooting, Repository, Kerl command- DNS,IP address range, TCP connection, LinuxMust be an EU Citizen from NATO CountryShould Live in Germany/Open to relocate and should be in Germany at the time of joiningÜ2 security clearance – should be comfortable to undergo this process24x7 Operational SupportIs German Language is Mandatory? NOJob description :About the Role:We are seeking a Site Reliability Engineer (SRE) with a strong background in observability, secure logging, and automation. The ideal candidate will have hands-on experience with Elasticsearch and/or Prometheus platforms. This role encompasses critical responsibilities in platform operations, including incident management, execution of scheduled maintenance, and contributing to engineering tasks focused on enhancing system stability. The SRE will also be responsible for adhering to standard operating procedures (SOPs) and actively contributing to their continuous improvement by providing constructive feedback.Key Responsibilities:Platform Engineering & DevOps: Manage Kubernetes and container orchestration, including Helm chart configurations and CI/CD pipelines (Jenkins, ArgoCD). Develop automation scripts (Python, Bash, Go) and deploy Infrastructure-as-Code (IaC) solutions.Observability, Monitoring & Visualisation: Maintain Prometheus solutions (scrape configurations, alert rules, PromQL queries), administer Thanos and Grafana.Elastic Stack Operations & Log Management: Configure and optimise Elasticsearch clusters, Logstash pipelines, and Kibana dashboards for secure, scalable log processing.Incident Response, Troubleshooting & Collaboration: Participate in 24x7 on-call rotations for rapid incident response, troubleshoot platform, data and performance issues, and engage in Major Incident Management (MIM).Secure Operations & Compliance: Ensure system operations meet security and data protection requirements, maintain secure documentation, and manage access control policies.Qualifications, Requirements, and SkillsStrong grasp of Linux concepts, preferably in Kubernetes environments.Solid understanding of networking fundamentals and REST APIs.Proficiency in Python, Go, or Bash.Proficiency in Git-based configuration management workflows.Familiarity with CI/CD tools like Helm, Jenkins, or ArgoCD.Experience with Elasticsearch and/or OpenSearch.Fluent English communication skills.Willingness to work shift-based 24x7 on-call support, including weekends and holidays.Must possess Ü2 security clearance.Citizenship required:Member state of EU and NATO. No dual citizenship outside these countries.Must reside in Germany and hold a German labor contract.Preferred Certifications: Elastic Certified Engineer, LPIC Level 2, Kubernetes Administrator.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQHQ1NQY7JM_rQ/company-logo_100_100/company-logo_100_100/0/1630653143248/ad_astra_consultants_singapore_logo?e=2147483647&v=beta&t=GmVC7J3Hv6TPSlXnQwx1-ZQVCoQReyfr-EdymUcmZL0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning Engineer Stellendetails | DKB Das kann Bank",
    "company": "DKB | Deutsche Kreditbank AG",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-stellendetails-dkb-das-kann-bank-at-dkb-deutsche-kreditbank-ag-4336136759",
    "posted_date": "3 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFyil_7My5krQ/company-logo_100_100/B4DZgsAnqaHAAQ-/0/1753085017781/dkb_logo?e=2147483647&v=beta&t=J6NaoiG1zex-ctM8NwrUh3UZrJPvevDMUSkRrIDu1ok",
    "description": "Deine AufgabenDu baust eigenständig skalierbare Development- und Deployment-Pipelines auf, entwickelst sie weiter und betreibst sie zuverlässigDu automatisierst End-to-End Prozesse (Infra, Deployments, Monitoring) mit modernen Tools wie Terraform, Ansible, Docker, Kubernetes oder CrossplaneDu pflegst und optimierst komplexe Cloud-Infrastrukturen (AWS-basiert) und administrierst Linux-Systeme souveränDu arbeitest eng mit Entwickler:innen, Betriebsmanager:innen und Fachbereichen zusammen und übersetzt Anforderungen in technische LösungenDu übernimmst Verantwortung für die Einführung neuer Tools, Technologien und Trends und setzt Impulse für die Weiterentwicklung der PlattformDu unterstützt das Team durch Mentoring und gibst Dein Know-how an Juniorkollegen weiterDein ProfilAbgeschlossenes Studium der (Wirtschafts-)Informatik oder eine vergleichbare Qualifikation (Ausbildung zum Fachinformatiker)Mehr als 4 Jahre Erfahrung in der IT, idealerweise mit Schwerpunkt Cloud-Umgebungen und AutomatisierungSehr gute Kenntnisse in Cloud-Infrastrukturen (AWS), Linux-Administration sowie in Pipeline-Automatisierung (z. B. GitLab, Flux, Helm)Erfahrung in IT-Betriebsabläufen und ein gutes Gespür für produktorientiertes ArbeitenAnalytische und abstrakte Denkweise, mit der Du komplexe Themen schnell erfasst und in Lösungen übersetztKommunikationsstärke, Eigenverantwortung und Spaß daran, Business-übergreifend zu agieren und Verantwortung zu übernehmenDie DKB steht für Vielfalt und Chancengerechtigkeit. Egal, woher du kommst, wie alt du bist, welches Geschlecht, welche Genderidentität, sexuelle Orientierung oder Religion du hast, ob mit oder ohne Behinderung - wir freuen uns auf deine Bewerbung!Immer für dich ansprechbarLucas LindauerExpertise Leadlucas.lindauer@dkb.deDeutsche Kreditbank AGDu möchtest mehr zur DKB erfahren?Dann schau auf unserer Karriereseite vorbei.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQFyil_7My5krQ/company-logo_100_100/B4DZgsAnqaHAAQ-/0/1753085017781/dkb_logo?e=2147483647&v=beta&t=J6NaoiG1zex-ctM8NwrUh3UZrJPvevDMUSkRrIDu1ok",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Software Engineer II (NodeJS/Python)",
    "company": "Zendesk",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/software-engineer-ii-nodejs-python-at-zendesk-4301906664",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH_bC13eyDqjw/company-logo_100_100/company-logo_100_100/0/1684356295421/zendesk_logo?e=2147483647&v=beta&t=w6vh07kTKA91c64ELehbqv7PXy7evnbswb2OTjBxlRo",
    "description": "Job DescriptionUltimate were acquired by Zendesk in March 2024, we’ve become even more powerful. Together with Zendesk we’re joining forces to build the world’s most advanced AI agents in CX.The GenBot group is revolutionizing the generative chatbot and AI assistance landscape with AI Agent Essential, a cutting-edge AI Agent system that's pushing the boundaries of conversational AI. AI Agent Essential is not your typical chatbot; it's a dynamic, and truly conversational system capable of reasoning and adapting to user needs in real-time. By leveraging a multi-agent architecture and advanced language models, AI AgentsEssential delivers personalized and engaging user experiences, moving beyond scripted interactions to handle complex tasks and \"off-script\" inquiries with ease.We are delighted to be hiring a Software Engineer for the AI Agent product at Zendesk. You will own a designated product area and revolutionize how our customers experience our products. This is an exciting opportunity to bridge the gap between cutting-edge ML powered features and real-world impact. You'll be working with innovative ML applications, and collaborate with a talented cross-functional team.What you will be doingDeveloping and maintaining backend services to support the delivery AI-powered capabilities to our customers at Zendesk scale.Working closely with Product, Management, DS and ML Engineers to define the scope of features and implementation approach.Automating the deployment pipelines for crucial AI-powered services and productsActively collaborating in evolving the workflow and processes together with the members of the team.Supporting our deployed services to ensure a high level of stability and reliability.Pairing with more experienced colleagues and learning from each other.What you bring to the roleBasic QualificationsDegree in Computer Science, Machine Learning, Statistics, Engineering, Mathematics4+ years working experience with at least one of the following server-side programming languages and the matching testing frameworks: NodeJS, Python4+ years working with web application observability and storage stacks: DataDog, Grafana, MySQL, MongoDB, Redis, ElasticSearch2+ years of experience with MySQL or MongoDB database systemsProven record of software application development in the industry.Good understanding of architecture and software design patterns for server-side and web domains.Great communication skill and fluency in English.Collaborative and growth mindset along with the desire to continue your ongoing learning and development.Preferred QualificationsBasic experience managing and deploying cloud services in AWSExperience implementing systems that serve content at web scale with high availability guarantees.Experience working on high throughput messaging systems like Kafka.Experience with graph databases, e.g. Neo4J, Amazon Neptune etc.Tech StackWeb pipeline: NodeJS, PythonML pipeline: Metaflow, AWS SageMaker, AWS BatchML models: PyTorch, TensorFlow, MLFlowStorage: RDS MySQL, Redis, S3, ElasticSearch, AuroraStreams and queues: Kafka,Service deployment: ArgoCD, Kubernetes, SpinnakerLogging and monitoring: Datadog, SentryHybrid: In this role, our hybrid experience is designed at the team level to give you a rich onsite experience packed with connection, collaboration, learning, and celebration - while also giving you flexibility to work remotely for part of the week. This role must attend our local office for part of the week. The specific in-office schedule is to be determined by the hiring manager.The Intelligent Heart Of Customer ExperienceZendesk software was built to bring a sense of calm to the chaotic world of customer service. Today we power billions of conversations with brands you know and love.Zendesk believes in offering our people a fulfilling and inclusive experience. Our hybrid way of working, enables us to purposefully come together in person, at one of our many Zendesk offices around the world, to connect, collaborate and learn whilst also giving our people the flexibility to work remotely for part of the week.As part of our commitment to fairness and transparency, we inform all applicants that artificial intelligence (AI) or automated decision systems may be used to screen or evaluate applications for this position, in accordance with Company guidelines and applicable law.Zendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment and employees at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, disability, military or veteran status, or any other characteristic protected by applicable law. We are an AA/EEO/Veterans/Disabled employer. If you are based in the United States and would like more information about your EEO rights under the law, please click here.Zendesk endeavors to make reasonable accommodations for applicants with disabilities and disabled veterans pursuant to applicable federal and state law. If you are an individual with a disability and require a reasonable accommodation to submit this application, complete any pre-employment testing, or otherwise participate in the employee selection process, please send an e-mail to peopleandplaces@zendesk.com with your specific accommodation request.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH_bC13eyDqjw/company-logo_100_100/company-logo_100_100/0/1684356295421/zendesk_logo?e=2147483647&v=beta&t=w6vh07kTKA91c64ELehbqv7PXy7evnbswb2OTjBxlRo",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Product Engineer (f/m/d) @ handly - 20VC backed",
    "company": "handly",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/product-engineer-f-m-d-%40-handly-20vc-backed-at-handly-4340696444",
    "posted_date": "1 hour ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQF1U-zv4qw14Q/company-logo_100_100/B4DZg31YssG8AQ-/0/1753283399206/handly_platform_logo?e=2147483647&v=beta&t=rgS7sbj9eLRi3A145PLoB438lYZ6_quk6EOK4OhACMY",
    "description": "We are building a generational company that will be theoperating system for tradespeople in Europe, starting with roofers in Germany.Roofers do not need more software. They need results: a system that aces everything from sales to measurements to finding new hires so they can focus on their craft. That is what handly does as a business-in-a-box startup.We test everything inside our own roofing company before launching it to customers. If it does not work in the real world, it does not ship.We are a hungry and close-knit 10-person team in Berlin backed by top tier investors 20VC, Stride and Base10, €3.75M raised.TasksAs Handly’s secondProduct Engineer, you’ll build the foundation of our platform from scratch and shape our product and engineering culture. You’ll translate messy, real-world workflows into intuitive, AI-integrated software that drives real results.Design, build, and iterate on full-stack features using our TypeScript-based stack:Frontend: React, Tailwind, Vite, Shadcn/ui, React Query; Backend: Node.js, Express, Drizzle, Postgres; Infra: AWS; Mobile: FlutterIntegrate AI to solve real business problems, not as a gimmickWork closely with early customers to understand the daily pain of roofers and translate it into designed and shipped product featuresTake full ownership from design to deployment and iteration. Define what it means to be a \"Product Engineer\"Crush scrappy work like helping migrate our legacy API to TypeScriptRequirementsHave3+ yearsof full-stack engineering experience(exceptions apply for exceptional engineers)Have shipped real products end-to-end, including AI-integrated features, preferably in startups and/or tech companiesThink in product, not ticket, and care about customer results more than processEmbrace AI tools (of your choice) as natural extensions of your workflowHave strong product and design tastePrefer speed and ownership over instructionBonus:Have built your own fully functional (AI-integrated) side projects. Send us your best one!BenefitsIn-office daily:Berlin-Mitte, modern light-filled workspace with a large balconyVelocity:fast loops, direct feedback, no management layersGrowth:as much responsibility as you can handleTeam:tight, ambitious group that enjoys building hard things togetherFocus:No stand-ups and only two short meetings per weekCompensation:€70–100k + competitive equityProcessIntro with Ohan (30m)Technical Background with Kais (45m)Product Engineering Challenge (3-4h)On-site with Kais, Niklas and Basti – white-boarding, product & culture (half-day)That’s it! We’ll reach out with an offer.Start date: ASAPLocation: Berlin only, in-office",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQF1U-zv4qw14Q/company-logo_100_100/B4DZg31YssG8AQ-/0/1753283399206/handly_platform_logo?e=2147483647&v=beta&t=rgS7sbj9eLRi3A145PLoB438lYZ6_quk6EOK4OhACMY",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Software Engineer II (NodeJS/Python)",
    "company": "Zendesk",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/software-engineer-ii-nodejs-python-at-zendesk-4301920207",
    "posted_date": "22 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH_bC13eyDqjw/company-logo_100_100/company-logo_100_100/0/1684356295421/zendesk_logo?e=2147483647&v=beta&t=w6vh07kTKA91c64ELehbqv7PXy7evnbswb2OTjBxlRo",
    "description": "Job DescriptionUltimate were acquired by Zendesk in March 2024, we’ve become even more powerful. Together with Zendesk we’re joining forces to build the world’s most advanced AI agents in CX.The GenBot group is revolutionizing the generative chatbot and AI assistance landscape with AI Agent Essential, a cutting-edge AI Agent system that's pushing the boundaries of conversational AI. AI Agent Essential is not your typical chatbot; it's a dynamic, and truly conversational system capable of reasoning and adapting to user needs in real-time. By leveraging a multi-agent architecture and advanced language models, AI AgentsEssential delivers personalized and engaging user experiences, moving beyond scripted interactions to handle complex tasks and \"off-script\" inquiries with ease.We are delighted to be hiring a Software Engineer for the AI Agent product at Zendesk. You will own a designated product area and revolutionize how our customers experience our products. This is an exciting opportunity to bridge the gap between cutting-edge ML powered features and real-world impact. You'll be working with innovative ML applications, and collaborate with a talented cross-functional team.What you will be doingDeveloping and maintaining backend services to support the delivery AI-powered capabilities to our customers at Zendesk scale.Working closely with Product, Management, DS and ML Engineers to define the scope of features and implementation approach.Automating the deployment pipelines for crucial AI-powered services and productsActively collaborating in evolving the workflow and processes together with the members of the team.Supporting our deployed services to ensure a high level of stability and reliability.Pairing with more experienced colleagues and learning from each other.What you bring to the roleBasic QualificationsDegree in Computer Science, Machine Learning, Statistics, Engineering, Mathematics4+ years working experience with at least one of the following server-side programming languages and the matching testing frameworks: NodeJS, Python4+ years working with web application observability and storage stacks: DataDog, Grafana, MySQL, MongoDB, Redis, ElasticSearch2+ years of experience with MySQL or MongoDB database systemsProven record of software application development in the industry.Good understanding of architecture and software design patterns for server-side and web domains.Great communication skill and fluency in English.Collaborative and growth mindset along with the desire to continue your ongoing learning and development.Preferred QualificationsBasic experience managing and deploying cloud services in AWSExperience implementing systems that serve content at web scale with high availability guarantees.Experience working on high throughput messaging systems like Kafka.Experience with graph databases, e.g. Neo4J, Amazon Neptune etc.Tech StackWeb pipeline: NodeJS, PythonML pipeline: Metaflow, AWS SageMaker, AWS BatchML models: PyTorch, TensorFlow, MLFlowStorage: RDS MySQL, Redis, S3, ElasticSearch, AuroraStreams and queues: Kafka,Service deployment: ArgoCD, Kubernetes, SpinnakerLogging and monitoring: Datadog, SentryHybrid: In this role, our hybrid experience is designed at the team level to give you a rich onsite experience packed with connection, collaboration, learning, and celebration - while also giving you flexibility to work remotely for part of the week. This role must attend our local office for part of the week. The specific in-office schedule is to be determined by the hiring manager.The Intelligent Heart Of Customer ExperienceZendesk software was built to bring a sense of calm to the chaotic world of customer service. Today we power billions of conversations with brands you know and love.Zendesk believes in offering our people a fulfilling and inclusive experience. Our hybrid way of working, enables us to purposefully come together in person, at one of our many Zendesk offices around the world, to connect, collaborate and learn whilst also giving our people the flexibility to work remotely for part of the week.As part of our commitment to fairness and transparency, we inform all applicants that artificial intelligence (AI) or automated decision systems may be used to screen or evaluate applications for this position, in accordance with Company guidelines and applicable law.Zendesk is an equal opportunity employer, and we’re proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment and employees at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, disability, military or veteran status, or any other characteristic protected by applicable law. We are an AA/EEO/Veterans/Disabled employer. If you are based in the United States and would like more information about your EEO rights under the law, please click here.Zendesk endeavors to make reasonable accommodations for applicants with disabilities and disabled veterans pursuant to applicable federal and state law. If you are an individual with a disability and require a reasonable accommodation to submit this application, complete any pre-employment testing, or otherwise participate in the employee selection process, please send an e-mail to peopleandplaces@zendesk.com with your specific accommodation request.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH_bC13eyDqjw/company-logo_100_100/company-logo_100_100/0/1684356295421/zendesk_logo?e=2147483647&v=beta&t=w6vh07kTKA91c64ELehbqv7PXy7evnbswb2OTjBxlRo",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Werkstudierende m/w/d im Bereich Kapitalmärkte als Data Scientist Frankfurt in 2026",
    "company": "DZ BANK AG",
    "location": "Frankfurt am Main, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/werkstudierende-m-w-d-im-bereich-kapitalm%C3%A4rkte-als-data-scientist-frankfurt-in-2026-at-dz-bank-ag-4331109557",
    "posted_date": "5 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQGhc-1AvCS4aw/company-logo_100_100/company-logo_100_100/0/1669214084285/dzbank_logo?e=2147483647&v=beta&t=7OiSX2CACK1l5Fc1Mk-jNcV1R13klczVNO7EUVjE3ng",
    "description": "Einstiegstermin / DauerAb 01.01.2026 oder später für 12 MonateDer Fokus des Bereiches Kapitalmarkt Institutionelle Kunden liegt auf dem Kapitalmarktgeschäft mit Volks- und Raiffeisenbanken, Drittbanken, Firmenkunden und Institutionellen Kunden.Das erwartet dichUnterstütze unser Team in der Abteilung Digitalisierung und Prozessmanagement bei der Weiterentwicklung einer internen Plattform, die dem Kapitalmarktumfeld UI-Applikationen zu unterschiedlichsten Use-Cases zur Verfügung stellt.Du arbeitest direkt im Kapitalmarktgeschäft des zweitgrößten deutschen Kreditinstitutes und erhältst so aus erster Hand Einblicke in unsere Produkte und Vertriebsprozesse.Gewinne praktische Einblicke in die Fullstack-Entwicklung (Python, pandas & plotly-dash; SQL; TailwindCSS) und arbeite an digitalen Services sowie modernen Data-Analytics-Anwendungen mit.Wirke bei der Datenmodellierung in Python / SQL (BigQuery) mit und unterstütze bei der Generierung und digitalen Bereitstellung täglicher Vertriebsimpulse.Durch die Teilnahme an Code Reviews lernst du, wie Codequalität und -standards sichergestellt werden, und sammelst Erfahrungen mit Best Practices in der Codestruktur, dem Testing sowie der Dokumentation.Bringe deine Kreativität ein, sammle erste Erfahrungen mit Machine Learning sowie Recommender-Systemen und wirke an der Entwicklung von Python-basierten Webanwendungen mit.Als Teil des Teams im Profit Center Capital Markets erlebst du hautnah mit, wie datengetriebene Entscheidungen von der Ideenfindung über die Umsetzung bis hin zum Monitoring gestaltet werden.Das bringst du mitDu bist immatrikulierte Studentin oder Student in einem Studiengang mit quantitativem Schwerpunkt z.B. in Informatik, Mathematik, Ingenieurwesen, Wirtschaftswissenschaften oder einer vergleichbaren FachrichtungGute bis sehr gute Kenntnisse in Python und idealerweise einigen Libraries (Dash, pandas, Flask, numpy, scikit-learn, PyTorch), sowie in SQL und der Datenstrukturierung/-analyse, einschließlich der Datenmodellierung und -visualisierungEin außergewöhnliches Maß an Engagement und Lernbereitschaft sowie die Fähigkeit, klar und präzise zu kommunizieren, verbunden mit effizienter TeamarbeitEine lösungsorientierte, kreative und analytische Arbeitsweise und die ausgeprägte Fähigkeit, Sachverhalte in kurzer Zeit zu erfassenGrundlegende Kenntnisse im Bereich Data Analytics, um datengetriebene Entscheidungen treffen zu könnenSehr gute Deutsch- und gute Englischkenntnisse in Wort und Schrift.Das bieten wir dirFaire Arbeits- und Entwicklungsbedingungen während deiner Werkstudierendentätigkeit, zu denen wir uns als Fair Company verpflichtet habenEinführungsveranstaltung durch die programmverantwortliche Personalreferentin, damit du einen guten Start hast und am Ende weißt, wie es für dich in der DZ BANK weitergehen kannBetreuung durch einen festen Ansprechpartner in deinem EinsatzteamEine attraktive monatliche Vergütung, deren Höhe sich nach deinem Teilzeitfaktor richtet und sich aus einem Stundenlohn von knapp 21 EUR inklusive anteiligem 13. und 14. Monatsgehalt plus Urlaubsgeld ergibtEine Arbeitszeit von bis zu 20 Stunden pro Arbeitswoche mit der Option, Überstunden in einem gewissen Rahmen aufzubauen, um diese zu einem späteren Zeitpunkt in Klausur-/Hausarbeitsphasen zu deiner Entlastung zu nutzen. Während deiner Semesterferien ist auch eine Vollzeitbeschäftigung möglich.Gleitzeit und in begrenztem Umfang mobiles Arbeiten, was dir in Absprache mit deinem Team Flexibilität bei der Einteilung deiner Arbeit bietet, gesetzlichen Urlaubsanspruch, eine gute Verpflegung in unserer Cafeteria und Kantine, bei Bedarf ein Deutschlandticket, damit du immer gut ankommst, gute Erreichbarkeit durch unsere unmittelbare Nähe zum Hauptbahnhof und ein breites Angebot verschiedener BetriebssportgruppenKontaktFür Rückfragen steht dirJana Konletelefonisch unter069/7447-57295oderjana.konle@dzbank.degerne zur Verfügung.Wir freuen uns auf deine vollständigen Bewerbungsunterlagen mit Anschreiben, Lebenslauf und Zeugniskopien (Abiturzeugnis, Bachelorzeugnis bzw. ein aktueller Leistungsnachweis aus dem Studium, Praktikazeugnisse etc.) sowie einen aktuellen Immatrikulationsnachweis.Erfahre mehr unterkarriere.dzbank.de!Starte jetzt deine Onlinebewerbung über denBewerben-Button, Dauer ca. 5 - 10 Minuten.6816-de_DE",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQGhc-1AvCS4aw/company-logo_100_100/company-logo_100_100/0/1669214084285/dzbank_logo?e=2147483647&v=beta&t=7OiSX2CACK1l5Fc1Mk-jNcV1R13klczVNO7EUVjE3ng",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Principal / Architect of AI Systems",
    "company": "Upstart AEC",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/principal-architect-of-ai-systems-at-upstart-aec-4340612678",
    "posted_date": "15 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHjlKzGsMFzQw/company-logo_100_100/B4DZXe2tSgHIAQ-/0/1743200639485/upstartaec_logo?e=2147483647&v=beta&t=k_7HKG3JG81ihc8xvXL0uxfloyddt02atOkdLBNh-Lg",
    "description": "We are seeking aPrincipal / Architect of AI Systems— a hands-on technical visionary who will define, accelerate, and unify all AI-related initiatives across the organization. This is not a people management role; it’s adeep technical leadership positionfocused on building, experimenting, and shaping the future of AI integration across our ecosystem.This role blendsresearch and implementation: part AI strategist, part hands-on builder, and part evangelist of best practices. The ideal candidate thrives on experimentation, stays ahead of emerging AI frameworks, and can translate innovation into production-grade systems that deliver real outcomes fast.Core Responsibilities️ Define and own the AI technical visionSet the overarching AI architecture and ensure consistency across teams and products.Guide how AI is designed, coded, tested, and deployed organization-wide.Stay on the bleeding edgeSpend ~50% of time exploring emerging models, frameworks, and paradigms (LLMs, agents, orchestration layers, etc.).Identify opportunities for innovation and translate research into tangible prototypes.Build, validate, and shipDedicate the other 50% to hands-on development — building prototypes, validating architectures, and accelerating AI integration across projects.Design and test agentic systems, model orchestration layers, and AI infrastructure patterns.Evaluate and select technologiesDrive tool selection for LLMs, frameworks, vector databases, embeddings, retrieval systems, and orchestration layers (LangChain, Bedrock, Azure OpenAI, etc.).Balance innovation with reliability, cost, and scalability.Accelerate delivery cadenceChampion rapid experimentation cycles — moving beyond slow, traditional sprints toward daily or near-daily delivery of AI outcomes.Instill a culture of visible, continuous improvement in AI development.Standardize best practicesDefine how AI coding, testing, and deployment should be done across the company.Establish reusable templates, pipelines, and architecture patterns.Mentor and evangelizeCoach engineers and architects on responsible AI integration.Promote AI literacy and best practices across cross-functional teams.Ideal Background10+ years insoftware architecture, ML systems, orAI platform engineering.Proven experience withLLM integration,agentic systems, andAI infrastructure.Deep technical fluency with tools such asLangChain, Azure OpenAI, AWS Bedrock, Vector DBs, RAG pipelines, andMLOps workflows.Strong foundation indata engineering,DevOps, andAI system orchestration.Demonstrated ability toship prototypes fast— not just theorize, but deliver.Track record ofresearch-driven innovationand constant exploration of new models and frameworks.Key Mindset & AttributesResearch-Driven Builder:Obsessed with learning, testing, and applying the newest AI advances.Execution-Oriented:Moves fast, experiments intelligently, and delivers tangible results.Anti-Bureaucracy:Rejects unnecessary process; favors agility and iteration.Cross-Functional Connector:Works fluidly with data, cloud, and app teams to unify vision.Thought Leader:Defines standards, drives technical discipline, and inspires AI excellence across projects.Ideal Candidate ProfileAPrincipal AI ArchitectorStaff-level AI Engineerwho combines strategic vision with hands-on execution — capable of setting technicaldirection, architecting cutting-edge systems, and keeping the organization at the forefront of applied AI innovation.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQHjlKzGsMFzQw/company-logo_100_100/B4DZXe2tSgHIAQ-/0/1743200639485/upstartaec_logo?e=2147483647&v=beta&t=k_7HKG3JG81ihc8xvXL0uxfloyddt02atOkdLBNh-Lg",
    "in_time_range": true,
    "time_note": ""
  }
]