[
  {
    "title": "🧑💻 Formateur Développeur Web (H/F) – Full Remote – 4h/jour – Contrat de 12 mois renouvelables (Tunisia)",
    "company": "Ilaria Digital School (by Ilaria Academy)",
    "location": "Tunisia",
    "job_link": "https://tn.linkedin.com/jobs/view/%F0%9F%A7%91%E2%80%8D%F0%9F%92%BB-formateur-d%C3%A9veloppeur-web-h-f-%E2%80%93-full-remote-%E2%80%93-4h-jour-%E2%80%93-contrat-de-12-mois-renouvelables-tunisia-at-ilaria-digital-school-by-ilaria-academy-4334994446",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQF8rVIw1ejEkQ/company-logo_100_100/company-logo_100_100/0/1630639887466/ilaria_academy_logo?e=2147483647&v=beta&t=_ZzNsXjl92SR25WHY_tI1imyHUOrvIBIZehSB4pSl_I",
    "description": "ℹ️ Qui sommes-nous ?Ilaria Digital School forme en ligne des apprenants de niveauBac+2 à Bac+3sur les métiers du développement web et des technologies associées. Nous avons une organisation pédagogique innovante et un fonctionnement moderne (visio quotidienne, suivi régulier). Nous renforçons notre équipe avec 2 formateurs/trices à distance. *Démarrage du contrat prévu pour mi-Décembre 2025 ou début Janvier 2026*.🚀 Description des missionsAnimer des ateliers en visioconférence (Microsoft Teams) de 4h/jour sur tout ou partie des technologies suivantes :HTML, CSS, JavaScript, NodeJS, PHP, Python, SQL, NoSQL, UML, Symfony, Django, Flask, Angular, React, Sécurité web, DevOps, Docker, CI/CD.(On ne demande pas de tout maîtriser, mais d’en maîtriser un bloc solide)Accompagner les apprenants sur leurs projets et corriger leurs travaux.Appliquer et améliorer les supports et la progression fournis par l’école.Produire du contenu vidéo qui sera envoyé aux apprenant(e)s suivant les formations en différésRendre compte simplement de l’avancement (reporting pédagogique court).✅ Ce que nous exigeons et proposonsMinimum 3 ans d’expérience réelleen développement web / logiciel.Très bon niveau enfrançais oral.Anglaisfortement apprécié.Disponibilitésur les horaires français (CET): 4h consécutives entre 9h et 17h heure de Paris.Connexion internet fiable(caméra + micro) : 👉Un test de débit pourra être exigé avant de poursuivre le recrutement.Matériel personnel opérationnel (PC récent).Nous privilégions les candidats résidant dans les pays suivants :Maroc, Tunisie, Algérie, Égypte, Turquie, Sénégal, Côte d’Ivoire, Cameroun(autres pays possibles si disponibilité stricte sur horaires France et bonne connexion).Engagement long terme : 12 mois renouvelables 🚀Rémunération adaptée au pays de résidence et au niveau technique✅ Pour postuler, envoyez :Votre CV ou profil technique (GitHub/portfolio si vous avez)La liste des techno que vous pouvez enseignerVotre pays de résidenceVotre créneau possiblesur 9h–17h (heure de Paris)",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQF8rVIw1ejEkQ/company-logo_100_100/company-logo_100_100/0/1630639887466/ilaria_academy_logo?e=2147483647&v=beta&t=_ZzNsXjl92SR25WHY_tI1imyHUOrvIBIZehSB4pSl_I",
    "in_time_range": true,
    "time_note": ""
  }
]