[
  {
    "title": "(Senior) AI Engineer (m/f/d)",
    "company": "Flip",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-ai-engineer-m-f-d-at-flip-4303886812",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHtW7slUAlcfw/company-logo_100_100/company-logo_100_100/0/1697783389468/flip_app_logo?e=2147483647&v=beta&t=xJslaihWOTnN2DmXdM9ucRvNADOVUbHcJZOLvO5c-vY",
    "description": "Empowering every employee.Our mission is to be the world's most used AI employee experience platform by changing the way frontline employees work.At Flip, we have a clear goal: to revolutionize the world for frontline workers and give them a voice. Become a Flip Game Changer and work with an unbeatable team to ensure that all employees, no matter where they work, have access to their company's internal information. If you're ready to make an impact and shape the work lives of millions of people, then you've come to the right place!Job TeaserAs one of our first dedicated Senior AI Engineers, you will be a key player in our engineering team, responsible for designing, building, and scaling the AI-powered services that will transform our product. You won't just be integrating features; you'll be building the core infrastructure and best practices that will define how we leverage AI for years to come. This role is perfect for a senior-level engineer who is passionate about creating tangible, production-ready AI solutions that directly enhance the user experience and drive business value.What awaits you with usArchitect and Build Production Systems:Design, develop, and maintain AI-driven features, focusing on robustness, scalability, and performance for our SaaS platform.Leverage Our AI Stack:Work hands-on with our existing and evolving AI stack, including pydantic-ai for orchestration, pgvector for vector search, and Azure AI for models.Collaborate and Integrate:Partner closely with product, design, and other engineers to seamlessly embed AI components into our existing workflows and user-facing features.Ensure Quality and Reliability:Contribute to the testing, monitoring, and observability of AI features, ensuring a high level of performance and reliability in production.Drive AI Best Practices:Lead technical discussions, mentor colleagues, and help define the standards for building, deploying, and maintaining AI systems at Flip.What you bring to the tableWe're seeking a skilled and product-focused engineer with a strong track record of shipping software.Must-Have Qualifications:5+ years of software engineering experience, with a solid background in SaaS.Deep proficiency in Python and experience building production services.Demonstrated hands-on experience in designing, deploying, and scaling LLM-powered systems in a production environment.Strong understanding of modern software development principles (testing, version control, CI/CD).Experience with applied AI/ML concepts: LLMs, embeddings, and vector databases.A collaborative mindset and excellent communication skills.Nice-to-Have Qualifications:Prior experience with AI frameworks like Pydantic AI, LangChain, or LlamaIndex.Experience with PostgreSQL and pgvector.Knowledge of prompt engineering, agentic AI, or fine-tuning techniques.Exposure to cloud AI providers, specifically Azure OpenAI.What we offer youWork mode: We’re remote-first, giving you flexibility to work from home. At the same time, we deeply value the power of in-person collaboration. Depending on the role, you’ll join occasional team events, workshops, or meetings in our Berlin or Stuttgart offices - always with plenty of notice. The exact balance will be discussed during your interview.Work-Life-Balance: We don't want you to grow roots to your desk chair. That's why we cover the costs of your E-Gym-Wellpass membership and offer job bike leasing.Celebrating success:Expect highly motivated and committed people in a relaxed working atmosphere.Be part of something bigger: You actively shape Flip in your role. Along the way, you are an enabler of the rapid growth process of a young tech company and grow towards your goals, fun is guaranteed.Happy to be a Flipster:Stay tuned for regular team events and culture days that bring us together as Flipsters.Working abroad:At Flip you can also work abroad in the European Union. Let's talk about remote work in the interview.At Flip, everyone is welcome - no matter what gender you identify as or how old you are. Sexual identity, origin, religion, world view and disabilities do not influence your potential job at Flip. The most important thing is thatYOUfit in!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHtW7slUAlcfw/company-logo_100_100/company-logo_100_100/0/1697783389468/flip_app_logo?e=2147483647&v=beta&t=xJslaihWOTnN2DmXdM9ucRvNADOVUbHcJZOLvO5c-vY",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Engineer",
    "company": "Hays",
    "location": "Bremen, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-engineer-at-hays-4335112874",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQETReujByGYaw/company-logo_100_100/B4EZfKYuQyGwAQ-/0/1751447168431/hays_logo?e=2147483647&v=beta&t=jn8kLrMaqs_JUIpLEsqWvkjYdwTJh6D5WqGehB9VMfA",
    "description": "Deine Aufgaben – Technik trifft InnovationModellentwicklung & SystemintegrationKonzeption, Training und Deployment von KI-Modellen in Bereichen wie Natural Language Processing, Computer Vision und PrognoseverfahrenAufbau skalierbarer Pipelines zur Datenverarbeitung und Modellbereitstellung unter Einsatz von Tools wie Airflow, MLflow, FastAPI und DockerEinbindung externer KI-Dienste (z. B. OpenAI, HuggingFace, Azure) in bestehende GeschäftsprozesseUmsetzung moderner MLOps-Ansätze inklusive CI/CD für eine nahtlose Integration und WartungDatenmanagement & InfrastrukturEnge Zusammenarbeit mit Data Engineers und Data Scientists zur Entwicklung robuster Datenmodelle und deren BereitstellungSicherstellung von Datenqualität und Einhaltung regulatorischer Vorgaben (z. B. DSGVO, AI Act)Mitwirkung beim Aufbau und Betrieb von KI-Infrastrukturen in der Microsoft-Azure-CloudInnovationsförderung & SkalierungIdentifikation neuer Einsatzmöglichkeiten für KI in Abstimmung mit den FachabteilungenTechnische Analyse und Bewertung von KI-Tools sowie Proof-of-Concepts zur Weiterentwicklung unserer digitalen StrategieDein Profil –Expertise mit WeitblickAbgeschlossenes Studium in (Wirtschafts-)Informatik, Data Science oder einem verwandten FachgebietFundierte Programmierkenntnisse in Python und Erfahrung mit relevanten Frameworks (FastAPI, PyTorch, scikit-learn, Transformers)Praxis in Cloud-Technologien, insbesondere Azure AI Services und Data FabricKnow-how in Container-Technologien (Docker, Kubernetes) sowie API-EntwicklungVerständnis für Datenschutz, IT-Sicherheit und regulatorische AnforderungenAnalytisches Denkvermögen, strukturierte Arbeitsweise und Begeisterung für technologische Innovationen",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQETReujByGYaw/company-logo_100_100/B4EZfKYuQyGwAQ-/0/1751447168431/hays_logo?e=2147483647&v=beta&t=jn8kLrMaqs_JUIpLEsqWvkjYdwTJh6D5WqGehB9VMfA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning Engineer - Remote",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-remote-at-mercor-4335321204",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Machine Learning EngineerType:Hourly contractorCompensation:$14/hourLocation:RemoteCommitment:20–40 hours/weekRole ResponsibilitiesDesign and implement scalable ML pipelines for model training, evaluation, and continuous improvement.Build and fine-tune deep learning models for reasoning, code generation, and real-world decision-making.Collaborate with data scientists to collect and preprocess training data, ensuring quality and representativeness.Develop benchmarking tools that test models across reasoning, accuracy, and speed dimensions.Implement reinforcement learning loops and self-improvement mechanisms for agent training.Work with systems engineers to optimize inference speed, memory efficiency, and hardware utilization.QualificationsMust-HaveStrong background in machine learning, deep learning, or reinforcement learning.Proficient in Python and familiar with frameworks such as PyTorch, TensorFlow, or JAX.Understanding of training infrastructure, including distributed training, GPUs/TPUs, and data pipeline optimization.Experience with MLOps tools (e.g., Weights & Biases, MLflow, Docker, Kubernetes, or Airflow).Experience designing custom architectures or adapting LLMs, diffusion models, or transformer-based systems.Compensation & LegalHourly contractorPaid weekly via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Research Engineer",
    "company": "Enigma",
    "location": "North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-research-engineer-at-enigma-4321708745",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "description": "AI Research Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDKAI Research Engineer / ResearcherYour MissionYou'll be a key contributor translating cutting-edge multimodal AI research into robust, production-grade agentic systems. By integrating vision models, large language models (LLMs), and advanced retrieval pipelines, your work will power real-world automation workflows and significantly boost productivity across complex domains.You'll be working at a well-funded, early-stage venture led by a technical founding team with deep expertise in AI, engineering, and startup execution. They value engineering rigor, scientific innovation, and building impactful products that solve real operational problems.What You’ll Do1. Agentic SystemsDesign, build, and refine agentic systems using frameworks like LangGraph.Integrate LLM-based reasoning with multimodal models and domain-specific tool use.Rapidly transition validated concepts into reliable, production-ready solutions.2. Data Retrieval and OrganizationBuild and optimize multimodal data retrieval pipelines.Work with structured and unstructured documents such as technical drawings, plans, and visual datasets.3. EvaluationOffline Evaluation: Develop high-quality benchmarks and use-case-specific evaluation metrics.Online Evaluation: Monitor live system performance and implement learnings for continual improvement.Must-Have Qualifications5+ years of experience building production-grade ML systems OR 2+ years in a top-tier AI startup focused on agentic or multimodal systems.Expert Python development skills.Experience with agentic frameworks like LangGraph, CrewAI, or Agents SDK.Demonstrated ability to translate complex AI research into scalable, real-world systems.Nice-to-Have QualificationsFamiliarity with technical or visual domain-specific data types (e.g., CAD, IFC, point clouds).Experience with vector search technologies (FAISS, Weaviate, Pinecone, etc.).Previous work in an early-stage startup with fast iteration cycles.Experience training or fine-tuning cutting-edge multimodal or vision-language models.AI Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDK",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Python Developer - AI Systems",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/python-developer-ai-systems-at-mercor-4335152601",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Software EngineerType:Hourly ContractorCompensation:$85–$120/hourLocation:RemoteDuration:1–2 monthsCommitment:20–40 hours/weekRole ResponsibilitiesDevelop and configure robust, high-performance systems for next-generation machine learning applications.Design and implement scalable APIs and service layers interfacing with advanced AI models.Configure environments and design databases to support real-world engineering work.Work independently and asynchronously to meet deadlines and improve AI model performance.Collaborate with AI research teams to ensure system robustness and performance.QualificationsMust-Have3+ years of elite software engineering experience in top-tier technology startups or similar environments.Highly skilled in Python.Experience with open-source contributions or large codebases.Computer Science or related degree from a prestigious university in the U.S., Canada, or the UK.Expert-level proficiency in API development, including creation, testing, and integration.Exceptional attention to detail and rigorous problem-solving skills.Excellent written and verbal communication skills.Start DateMid to late October; applications reviewed on a rolling basis.Interview Process20 mins initial screeningTechnical interviewFinal interview with the teamCompensation & LegalHourly contractorPaid weekly via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Developer* Professional",
    "company": "valantic Software & Technology Innovations",
    "location": "Eschborn, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-developer-professional-at-valantic-software-technology-innovations-4339711197",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFLTEpPwa13Fg/company-logo_100_100/company-logo_100_100/0/1677080599501/syroconag_logo?e=2147483647&v=beta&t=XfX0rBI6_7M2N-JUbfU0tLarw-F0ywZb6ESOdb0Fe2c",
    "description": "BeschreibungWir suchen einen AI Developer* Professional mit Leidenschaft für die Entwicklung und Implementierung moderner AI-Anwendungen. Für unser AI-Team suchen wir nun an unseren Standorten in Eschborn bei Frankfurt oder in Berlin nach Verstärkung und Bereicherung durch deine Erfahrung.Du hast Interesse an Künstlicher Intelligenz, arbeitest gerne an innovativen Projekten und möchtest praxisnahe Lösungen mitgestalten? Dann sollten wir uns unbedingt kennenlernen!Dein WirkungsfeldAls AI Developer * Professional arbeitest du an der Umsetzung von AI-Anwendungen in verschiedenen Projektphasen – von der Anforderungsanalyse über die Modellierung bis hin zum produktiven BetriebDu setzt moderne Machine- und Deep-Learning-Verfahren ein, um komplexe Geschäftsprobleme unserer Kunden zu lösen.Du entwickelst, testest und optimierst ML-Modelle und generative AI-Anwendungen (z. B. LLM-basierte Systeme, Chatbots, Empfehlungssysteme oder Computer Vision Lösungen).Du implementierst robuste Datenpipelines und unterstützt bei der Integration der Modelle in bestehende IT- und Cloud-Umgebungen.Du arbeitest eng mit Data Scientists, Cloud Architects und Softwareentwicklern zusammen, um skalierbare End-to-End-AI-Lösungen zu realisieren.Du beteiligst dich an der Evaluation neuer AI-Technologien und Frameworks und bringst eigene Ideen aktiv in unsere Entwicklungsprozesse ein.Du präsentierst Ergebnisse und technische Konzepte sowohl für technische als auch nicht-technische Stakeholder.Du unterstützt bei der kontinuierlichen Weiterentwicklung unseres AI-Portfolios und trägst zu einer offenen Wissenskultur im Team bei.Was Dich auszeichnetAbgeschlossenes Studium der Informatik, Mathematik, Physik oder eines vergleichbaren Fachbereichs2–4 Jahre Erfahrung in der Entwicklung von AI- oder Machine-Learning-AnwendungenFundierte Kenntnisse in Python und gängigen Frameworks wie PyTorch, TensorFlow, scikit-learn oder Hugging Face TransformersErfahrung im Umgang mit LLM-APIs (z. B. OpenAI, Azure OpenAI, Anthropic oder Mistral) und Frameworks wie LangChain oder LlamaIndexVerständnis für Datenverarbeitung, Feature Engineering und Modell-Deployment (z. B. über Docker, Kubernetes oder Azure ML)Erfahrung mit Cloud-Plattformen (vorzugsweise Microsoft Azure) und MLOps-KonzeptenGrundlegende Kenntnisse in Datenbanktechnologien (SQL, NoSQL) und API-EntwicklungGute Kommunikations- und PräsentationsfähigkeitenHohes Maß an Eigeninitiative, Teamgeist und LernbereitschaftSehr gute Deutsch- und EnglischkenntnisseNice-to-have: Erste Erfahrung mit Generative AI oder Computer Vision Projekten, Kenntnisse in CI/CD-Pipelines (z. B. Azure Pipelines, GitHub Actions), Zertifizierungen im Bereich Azure AI Engineer Associate oder vergleichbare Cloud-ZertifikateDarauf kannst Du Dich freuenbis zu 31 Tage UrlaubFlexible ArbeitszeitenMobile Office: Du entscheidest, wo du arbeitestUnbefristeter ArbeitsvertragAttraktive Benefits, z.B. Kindergartenzuschuss, Bike Leasing, Corporate Benefits,...Weiterentwicklungsmöglichkeiten, die zu dir passenFirmenevents wie Sommerfest, Weihnachtsfeier, Teamevents, Firmenausflug,...Sehr gute Verkehrsanbindung an S-Bahn oder Autobahn, kostenfreie ParkplätzeWir freuen uns darauf, dich kennenzulernen!Bei uns zählt der Mensch – nicht das Geschlecht. Wir setzen auf Vielfalt, lehnen Diskriminierung ab und denken nicht in Kategorien wie etwa Geschlecht, ethnische Herkunft, Religion, Behinderung, Alter oder sexuelle Identität.Hast du noch Fragen? Dein direkter Draht:Anja Düsel | Senior HR Manageranja.duesel@sti.valantic.comÜber unsDievalantic Software & Technology Innovations GmbHist ein Beratungs- und Software-Entwicklungsunternehmen mit den Schwerpunkten Cloud Solutions, Autonomous Driving Technologies, Data Analytics, IOT Solutions, Mobility Services und Process Digitalization. Mehr als 150 Expert*innen aus den Bereichen Prozessanalyse, Softwarearchitektur und Softwareentwicklung beraten und unterstützen namhafte national und international agierende Unternehmen bei der Konzeption und Realisierung von IT-Lösungen zur Optimierung und Automatisierung ihrer Geschäftsprozesse und bei der Entwicklung ihrer Produkte und Services. Unsere Kunden profitieren von unserem ausgewiesenen Branchen-Know-how, dem technologischen Expertenwissen sowie der Kundennähe und der innovativen Dynamik des Unternehmens.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFLTEpPwa13Fg/company-logo_100_100/company-logo_100_100/0/1677080599501/syroconag_logo?e=2147483647&v=beta&t=XfX0rBI6_7M2N-JUbfU0tLarw-F0ywZb6ESOdb0Fe2c",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Software Developer",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-software-developer-at-mercor-4335162219",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Machine Learning EngineerType:Hourly contractorCompensation:$14/hourLocation:RemoteCommitment:20–40 hours/weekRole ResponsibilitiesDesign and implement scalable ML pipelines for model training, evaluation, and continuous improvement.Build and fine-tune deep learning models for reasoning, code generation, and real-world decision-making.Collaborate with data scientists to collect and preprocess training data, ensuring quality and representativeness.Develop benchmarking tools that test models across reasoning, accuracy, and speed dimensions.Implement reinforcement learning loops and self-improvement mechanisms for agent training.Work with systems engineers to optimize inference speed, memory efficiency, and hardware utilization.QualificationsMust-HaveStrong background in machine learning, deep learning, or reinforcement learning.Proficient in Python and familiar with frameworks such as PyTorch, TensorFlow, or JAX.Understanding of training infrastructure, including distributed training, GPUs/TPUs, and data pipeline optimization.Experience with MLOps tools (e.g., Weights & Biases, MLflow, Docker, Kubernetes, or Airflow).Experience designing custom architectures or adapting LLMs, diffusion models, or transformer-based systems.Compensation & LegalHourly contractorPaid weekly via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine-Learning Engineer",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-at-mercor-4335212090",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Machine Learning EngineerType:Hourly contractorCompensation:$14/hourLocation:RemoteCommitment:20–40 hours/weekRole ResponsibilitiesDesign and implement scalable ML pipelines for model training, evaluation, and continuous improvement.Build and fine-tune deep learning models for reasoning, code generation, and real-world decision-making.Collaborate with data scientists to collect and preprocess training data, ensuring quality and representativeness.Develop benchmarking tools that test models across reasoning, accuracy, and speed dimensions.Implement reinforcement learning loops and self-improvement mechanisms for agent training.Work with systems engineers to optimize inference speed, memory efficiency, and hardware utilization.QualificationsMust-HaveStrong background in machine learning, deep learning, or reinforcement learning.Proficient in Python and familiar with frameworks such as PyTorch, TensorFlow, or JAX.Understanding of training infrastructure, including distributed training, GPUs/TPUs, and data pipeline optimization.Experience with MLOps tools (e.g., Weights & Biases, MLflow, Docker, Kubernetes, or Airflow).Experience designing custom architectures or adapting LLMs, diffusion models, or transformer-based systems.Compensation & LegalHourly contractorPaid weekly via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Engineer (Cloud, Machine Learning)",
    "company": "InterEx Group",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-engineer-cloud-machine-learning-at-interex-group-4339742090",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFu8vDCGxDbxw/company-logo_100_100/company-logo_100_100/0/1693320979220/interex_group_logo?e=2147483647&v=beta&t=JXT9L3Mz7KMqW1HVN4QOFwOQ-4JmQ-BNAup1RmKMLG8",
    "description": "Position Summary:The R&D Laboratory of a large multinational company is seeking an experienced engineer to join the AI Platform team, which creates web services, tools and machine learning models for Sony business units.The ideal candidate will be a very strong software developer, with experience both in designing and developing cloud-based solutions using Big Data tools and technologies, as well as in applying machine learning to build models on various types of data (tabular, time series, images).They will join a project that focuses on innovative data analytics R&D and builds and deploys solutions for various parts of the business.Profile:Candidates must hold a Master’s degree in a relevant scientific field, be fluent in English, and have the following skills and experience.KEY SKILLS AND EXPERIENCE:5+ years of back-end cloud design, development and deployment experience:Design and development of RESTful web services: Python, Flask, JavaCloud services: AWS, GCP, AzureData engineering, workflow scheduling3+ years of experience in DevOps:CI/CDDockerKubernetesExperience with data analytics, machine learningExcellent coding, reviewing and testing skillsGood communication and presentation skillsDESIRABLE EXPERIENCE:Data tools and technologies such as:Hadoop, Spark, Apache BeamMLFlow, KubeflowTensorFlow, PyTorchSQL, pandasKnowledge of Haskell, Rust, GolangJob Start and Duration:Job start is ASAP. We are interested in both permanent and temporary contracts. In the latter case we offer a contract for 12 months. However, also for the temporary type of contract, the client is interested to keep the hired engineer longer than one year.About the Client:The client is an AI and software research & development group. They are wholly owned by a multinational corporation, and exclusively research and develop AI and software for the organisation’s products and services. Their offices are located in Zaventem, near Brussels, Belgium. The group is international and the working language is English.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQFu8vDCGxDbxw/company-logo_100_100/company-logo_100_100/0/1693320979220/interex_group_logo?e=2147483647&v=beta&t=JXT9L3Mz7KMqW1HVN4QOFwOQ-4JmQ-BNAup1RmKMLG8",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning Engineer (all genders)",
    "company": "Avelios Medical",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-all-genders-at-avelios-medical-4335122600",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG2yFLp9E4w3w/company-logo_100_100/company-logo_100_100/0/1694258254648/avelios_medical_logo?e=2147483647&v=beta&t=DfCaaYQpDKCTZuAUj6bTO8L3qyv5Dr5axaqW1mNWKTk",
    "description": "About usOur mission at Avelios is to build the leading software platform for the data-driven digitization of hospitals and patient care. To do so, we have built a modular software platform that digitizes and optimizes workflows in hospitals with cutting-edge technology in a user-friendly way. With our software, we enable hospitals, doctors & nurses to provide their patients with the best possible care.We are growing fast and want to keep expanding our team and business to fundamentally digitize healthcare for the better. We appreciate different backgrounds and see diversity as one of our strengths.The Team and RoleAs a(Senior) Machine Learning Engineer (all genders), you will drive the integration of intelligent systems into real-world clinical environments. Collaborating with our interdisciplinary development and research teams, your role will focus on building and deploying machine learning models at scale — with direct access to large medical datasets, top research institutions, and high-performance computing infrastructure. This is a unique opportunity to shape how AI transforms everyday medical workflows.Your ResponsibilitiesCollaborate with our core development team to bring machine learning into productionDesign and train ML models on large-scale clinical datasetsIntegrate AI-powered solutions into medical workflowsWork with Federated Machine Learning frameworks for privacy-preserving model trainingCollaborate with leading academic and research institutionsLeverage access to high-performance computing infrastructure to build robust ML pipelinesYour QualificationsDegree in Informatics, Computer Science, or a related field — or equivalent practical experienceHands-on experience withPyTorch,TensorFlow, orKerasPublications at top conferences or demonstrated cutting-edge results in applied ML (e.g., Computer Vision or NLP)Strong coding background — GitHub contributions are a plusInterest in new technologies and their application to real-world challengesFluency inGerman and EnglishYour BenefitsA deep understanding of our technologies and proficiency in our modern & relevant tech stackAbility to gain valuable hands-on experience in a startup backed by leading international VCsHigh flexibility, variety in your tasks and the opportunity to take ownershipMotivating work environment with a diverse team that enjoys working togetherMany perks & benefits as well as a great office in the heart of MunichA competitive salary plus a virtual stock option package",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG2yFLp9E4w3w/company-logo_100_100/company-logo_100_100/0/1694258254648/avelios_medical_logo?e=2147483647&v=beta&t=DfCaaYQpDKCTZuAUj6bTO8L3qyv5Dr5axaqW1mNWKTk",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Mechanical Engineer - AI Systems",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/mechanical-engineer-ai-systems-at-mercor-4335122951",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "Company IntroductionMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Role OverviewPosition: Engineering Professional – Independent Contractor, RemoteCommitment: Part-time ~20 hours/week (potential to extend to 40 hours/week)Duration: 1–2 monthsJoin an exciting collaboration with a top AI research lab. Contribute to developing and evaluating advanced AI systems replicating real-world workflows in engineering.ResponsibilitiesCreate and assess complex problems in engineering across subdomains such as civil, mechanical, electrical, chemical, materials, and systems engineering.Evaluate AI-generated responses for conceptual accuracy, technical rigor, and domain relevance.Provide clear written feedback on engineering problem sets, designs, and solutions.Collaborate asynchronously with AI researchers and engineers to iterate and improve model performance.Ensure technical accuracy and academic precision in all engineering content used to train or evaluate AI systems.Requirements / QualificationsMust-Have QualificationsDegree in Mechanical EngineeringExceptional written and verbal communication skillsStrong attention to detail and analytical thinkingEngagement DetailsCompensation: Competitive hourly rate based on experience ($65-$80 USD/hr)Contract Type: Independent contractorSchedule: Fully remote and asynchronous – flexible working hoursPayment: Daily payment via Stripe ConnectApplication Process (Takes 20-30 mins to complete)Upload your resume (and portfolio/notebook links if available) and application formAI interview: A short, 15-minute conversational session to understand your background, experience, and interest in the roleWork trial: A paid, 4-hour assessment evaluating your ability to interpret project guidelines and deliver math-specific outputResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Principal AI Engineer (m/f/x) - Focus: Software Engineering",
    "company": "appliedAI Initiative GmbH",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/principal-ai-engineer-m-f-x-focus-software-engineering-at-appliedai-initiative-gmbh-4339702974",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGXVucS8wEt2A/company-logo_100_100/company-logo_100_100/0/1682066957381/applied_ai_initiative_logo?e=2147483647&v=beta&t=co--mTBNdfpe71nldDw79LNlDSsqAgEhKc0V_P3YVls",
    "description": "About UsThe appliedAI Initiative elevates Europe’s industry to become shapers in the age of AI, creating a future that we desire to live in. Through our ecosystem of strong partners, comprehensive programs, services and solutions we advance companies holistically on their AI journey. With our uniquely diverse, interdisciplinary, and driven team, we build on deep technical expertise while specializing on applicability of the solutions. We share a mindset of collaboration and openness with our ecosystem of leading companies and tech players. Our common goal is to strengthen the European landscape, jointly creating unique knowledge for applying trustworthy AI. We believe that AI Agents will be the dominant topic for AI in the near future and that appliedAI with its partner ecosystem will impact how this technology is being used in industry and beyond in Europe.Your missionAs a Principal AI Engineer in Professional Services, you set the technical bar and lead the delivery of mission-critical AI solutions at enterprise scale. You define engineering standards, de-risk complex programs, and remain hands-on where it matters most. The focus is software engineering and heavy-duty enterprise solutions.Your responsibilities will include:Own end-to-end technical strategy for complex engagements; ensure architectural coherence, quality, and operational excellence; delivery for critical AI programs, making key decisions on frameworks, tools, and technical patterns to deliver high-quality, production-ready software and systemsDesign, review, and harden services integrating ML/LLM components with strict SLOs, security guardrails, and observability. Proactively experiment with and integrate state-of-the-art AI technologies (such as agent frameworks, RAG architectures, and cloud-native solutions) to continuously improve performance and reliabilityScale solutions from PoC to multi-tenant, production deployments; drive cost, latency, and reliability optimizationsCreate and maintain reusable accelerators, templates, and reference implementations to speed up delivery across clientsPartner with customers, strategists, and PMs in pre-sales and delivery (workshops, solution options, estimations, and statements of work)Mentor and coach engineers; uplift engineering practices, testing rigor, CI/CD, and documentation standards across teamsProvide technical leadership for large customer engagements with measurable outcomesYour profileSTEM degree (preferably Computer Science or Engineering)10+ years of professional software engineering experience, including shipping and operating production systems with AI/LLM componentsExpert Python skills and proficiency in at least two additional language (e.g., C, C++, Go, Java, or TypeScript/Node.js)Deep experience with APIs/microservices, event-driven systems, Docker/Kubernetes, CI/CD, and at least two major clouds.Proven track record owning SLOs/SLAs, observability, cost/performance optimization, and incident managementStrong ML/LLM integration experience (serving, retrieval/RAG, evaluation) and applied security/safety guardrailsProven experience technically leading projects and large customer engagements with measurable outcomesExcellent communication, stakeholder management, and documentation skillsFluent English, ideally fluent in GermanWhat We OfferA highly qualified and motivated team of ~90 people on a journey to change the rapidly evolving European AI Landscape.Experience the best of both worlds with our hybrid work model: You can choose to work from our vibrant offices - either at the IPAI in Heilbronn or the House of Communication in Munich - while also enjoying the flexibility to work remotely a few days each weekOpportunity to shape a variety of projects and the development of new, original content based on the latest developments in AI and its adoption in businessesAn atmosphere that encourages to think and experiment in new ways with software, hardware, and processesHottest topics of the next decade and freedom and trust to initiate own activitiesA highly visible initiative that helps you build a large and high-level network of start-ups, partners, and tech companiesSports membership with Wellpass to access thousands of sports facilities all over Germany (and beyond)JobRad leasing optionYou can take a sabbatical of up to 3 months after 3 years of employment - because sometimes 30 vacation days are not enough to explore the beauty of this world.ContactLucas Fernandes - Senior Talent Acquisition SpecialistappliedAI Initiative GmbH, August-Everding-Str. 25, 81671 MünchenAbout UsFind out more on https://www.appliedai.de/ and https://www.appliedai-institute.de/",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGXVucS8wEt2A/company-logo_100_100/company-logo_100_100/0/1682066957381/applied_ai_initiative_logo?e=2147483647&v=beta&t=co--mTBNdfpe71nldDw79LNlDSsqAgEhKc0V_P3YVls",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339622676",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Frankfurt am Main, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339573008",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Hamburg, Hamburg, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339592829",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Cologne, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339553098",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Bonn, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339533251",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Forward Deployed AI Engineer (m/w/d)",
    "company": "One Thousand",
    "location": "Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/forward-deployed-ai-engineer-m-w-d-at-one-thousand-4339573903",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHvRkrtHtg2Lg/company-logo_100_100/company-logo_100_100/0/1695197985935?e=2147483647&v=beta&t=iAbLtHIDJIrhPft54GxSAyENAOUmy3m-7aL4ZPFYwl4",
    "description": "We are looking for you to complement our team of round pegs in square holes!AI is transforming everything, and we make sure the right people are ahead of the curve. We do so by creating AI breakthroughs with our clients.For us, creating breakthroughs is an irresistible adventure that we want to do 1000 times over. That’s why we are called One Thousand. And as a profitable, fast-growing company, we are on track as never before!To create AI breakthroughs, our team of 30 friendly nerds identifies pain points and solves them with fast-paced MVPs. And: We enable the broader transformation of our clients into an AI powerhouse. If you are keen to help Europe finally speed up in AI and would love to have warm outliers around you, join us now!We are looking for aForward Deployed AI Engineer(m/w/d) who identifies with most of the following:What we care about:Inherent Drive for Greatness:Our world-class team of outliers ships AI breakthroughs extremely fast while ensuring quality standards are met. We are people who feel like they still have something to prove – and we do so by working on something 1000x greater than us.Relentless Resourcefulness:Creating AI breakthroughs requires the ability to thrive in uncertainty. We have the strength to bounce back and a tenacity to keep pushing to go where it hurts. We balance persistence with lightness.Infectious Enthusiasm:We care about making AI a blast for everyone involved. With electrifying empathy, we propel our clients forward in understanding, building, and thriving with AI and boost our team with the opportunity to shape our future.What the role is about:You will have the chance to shape fast-paced AI breakthrough projects. You will ensure our Proof-of-Concepts (PoCs) are productionized as MVPs to generate business value.You will be responsible for building data pipelines, running ML workflows, developing web services, deploying them on cloud environments, and supporting integration with our clients’ systems.You will be a key contributor in growing our high-impact start-up and shaping our identity – both internally and externally.You will be working not only with corporates but also be bringing AI to large international NGOs, the “Mittelstand,” scale-ups, unions, or the public sector.You will have the chance to fully be yourself and will be embraced if you respect the others. :-)What we would love to see:Knowing how to execute real-life software projects:You have significant work experience in building scalable software projects in a professional manner.Leveraging AI Expertise:You have hands-on experience implementing AI in challenging production environments. You thrive on solving practical AI tasks and are comfortable working within a team to deliver impactful solutions.Bringing technical depth:You can solve diverse software engineering challenges with a vast toolbox and love fostering good quality code. You have a strong foundation in Python.Being dedicated:You don't have to master everything, yet you fully support the team to reach our goals in a resultoriented way of working while fostering a culture of caring.Dealing with ambiguity:Even if some challenges are vaguely defined, you make sense of what needs to be done.Conversing in German:Ability to communicate in German with our clients with level B1 or higher.Ideally, you also bring the followingExperience with data science tools (pandas, matplotlib, scikit-learn, ...).Experience working with LLMs (OpenAI / Claude API / ...).Experience in building front-end solutions.Experience with Docker.Experience integrating web services with SAP.Openness to travel to clients location 2-3 times a month.What we offer:Ascension – as we are going to push and enable you to do the best work of your life.Anti-mimeticism – as we are on the journey to 1000 AI breakthroughs since long before the recent hype.Captivating AI breakthrough projects with a lot of room for personal development, experimentation, continuous learning, and growth.A unique role in a pioneering AI company with autonomy in shaping and leading key endeavors that contribute to the advancement of AI applications.A professional, yet flexible work environment, innovative work practices along “No rules rules,” and continuous mutual support.A value-driven business with top-of-market pay for a Machine Learning Engineer.All the other start-up stuff such as free drinks and snacks, game nights, ...We care: Flexible hours & remote work, Family-friendly policiesFemale Empowerment: Equal opportunities & diversity, mentorship & career development, leadership support for womenWe are determined to foster and embrace diversity – not just among our clients but especially within our own walls. We believe that this will make our organization and quality of work better, but more importantly, we strongly believe it is the right thing to do.Sounds like a “wow” opportunity? You would like to get to know us and the One Thousand better? Great – we can’t wait to hear from you!Don't meet all the criteria?Apply anyway - we look forward to hearing from you!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHvRkrtHtg2Lg/company-logo_100_100/company-logo_100_100/0/1695197985935?e=2147483647&v=beta&t=iAbLtHIDJIrhPft54GxSAyENAOUmy3m-7aL4ZPFYwl4",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior AI Engineer, Device Intelligence (m/f/d) - Jobbird.com",
    "company": "Jobster",
    "location": "Düsseldorf, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-ai-engineer-device-intelligence-m-f-d-jobbird-com-at-jobster-4321609416",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "description": "Bring more to life.At Danaher, our work saves lives. And each of us plays a part. Fueled by our culture of continuous improvement, we turn ideas into impact – innovating at the speed of life.Our 63,000+ associates work across the globe at more than 15 unique businesses within life sciences, diagnostics, and biotechnology.Are you ready to accelerate your potential and make a real difference? At Danaher, you can build an incredible career at a leading science and technology company, where we’re committed to hiring and developing from within. You’ll thrive in a culture of belonging where you and your unique viewpoint matter.Learn about the Danaher Business System which makes everything possible.TheSenior AI Engineer, Device Intelligence(m/f/d)will be a key member of the AI Product and Imaging Innovation team, reporting to its Senior Director. This new role is instrumental in the implementation of cutting-edge AI systems that leverage data created by Danaher devices to extract meaningful insights and dramatically improve user experience, with the goal of upleveling Danaher's devices across Life Sciences, Diagnostics and Biotechnology sectors. This position is remote in Germany.In this role, you will have the opportunity to:Collaborate with the Senior Director and the broader team to develop AI-driven product improvements and create new products for Danaher devices, with an initial focus on imaging devices and the aim of extracting more valuable insights.Design and implement advanced AI systems, including next-generation agentic workflows, LLMs and computer vision technologies, to enhance instrument automation and uplevel user capabilities.Work closely with cross-functional and cross company teams to translate product concepts into concrete AI architectures, ensuring alignment with product success criteria and measurable KPIs.Lead the technical implementation of AI projects of notable complexity, involving multiple functions and typically spanning multi-quarter timelines.Drive innovation in the AI software stack, focusing on maximizing value extraction from instruments for customers through AI systems.Collaborate with business stakeholders, technical experts, and subject matter experts to build comprehensive AI roadmaps for imaging products across various verticals.The essential requirements of the job include:Bachelor's degree in computer science, electrical engineering, life sciences or a related field. An advanced degree (MS or PhD) in a relevant area (i.e. Neural Networks, Foundation Model, Agentic Workflows, Machine Learning, Computer Vision) is preferred.Long standing experience in the Life Science, Diagnostics, Biotechnology or Tech Industry, including multiple years of experience with Agentic Systems, LLMs, and/or Multimodal AI.Demonstrable expertise with at least 3 of the following: convolutional neural networks, foundation models, vector databases, AI evaluation methods, RAG approaches, agentic frameworks.Proven track record of successful end-to-end implementation of AI projects in imaging applications, particularly in life sciences or healthcare domains.Strong programming skills in languages such as Python or C++, and extensive experience with deep learning frameworks (e.g., TensorFlow, PyTorch, OpenCV) and containerization technologies (e.g., Docker, Kubernetes).Demonstrated ability to work effectively with cross-functional teams, communicate complex technical concepts to both technical and non-technical stakeholders, and align AI development with product goals and roadmaps.Experience with cloud platforms (e.g., AWS, Google Cloud, Azure) for large-scale image processing and familiarity with hardware acceleration technologies (e.g. TPUs, GPUs, ARM-CPUs).It would be a plus if you also possess previous experience in:Experience with regulatory processes, especially for medical devices and AI/ML-based software as a medical device (SaMD).Familiarity with quality management systems and standards relevant to the life sciences and diagnostics industries.Knowledge of instrument control mechanisms and how they integrate with AI systems for enhanced automation.Join our winning team today. Together, we’ll accelerate the real-life impact of tomorrow’s science and technology. We partner with customers across the globe to help them solve their most complex challenges, architecting solutions that bring the power of science to life.For more information, visit www.danaher.com.#Jobster",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQG8RYPpCRg91Q/company-logo_100_100/company-logo_100_100/0/1706010083340/jobster_com_logo?e=2147483647&v=beta&t=Nj4F3Y3dBRhXmFgJZSlCL1Wstr19hBmaI8ngQ-gYXoA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Lead AI Software Engineer / Architect (m/f/d)",
    "company": "Simon-Kucher",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/lead-ai-software-engineer-architect-m-f-d-at-simon-kucher-4339602839",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "description": "In Germany- Berlin | Bonn | Cologne | Frankfurt/Main | Hamburg | MunichWe are seeking an experienced Lead AI Software Engineer/Architect to design and build scalable AI and GenAI products to transform our clients’ business models and enable their growth. In this role, you’ll combine deep technical expertise with strategic vision to build AI-powered solutions that are scalable, impactful, and business-driven.Simon-Kucher is at the forefront of innovation in our space, inventing business models, algorithms, solutions, and methodologies for unlocking better growth of our clients. And Simon-Kucher Engine’s digital end-to-end solutions deliver sustained top-line impact for our clients. Are you interested in working in a team of digital evangelists with a can-do attitude? Want to experience the dynamics of agile processes in open-minded teams? How about getting creative in a startup atmosphere with a steep development curve and flat hierarchies? And most importantly, do you want to make a difference? Then you've come to the right place.What Makes Us SpecialAdvance your career with exciting professional opportunities in our thriving company with a startup feelInnovate by transforming ideas into cutting-edge AI products, championing Generative AI through creative experimentation to push boundaries and deliver transformative solutionsAdd to your experience with our projects that focus on growth, have a positive impact, and truly matterVoice your unique ideas in a corporate culture defined by our entrepreneurial spirit, openness, and integrityFeel at home working with our helpful, enthusiastic colleagues who have great team spiritBroaden your perspective with our extensive training curriculum and learning programs (e.g. LinkedIn Learning)Speak your mind in our holistic feedback and development processes (e.g. 360-degree feedback)Satisfy your need for adventure with our opportunities to live and work abroad in one of our many international officesEnjoy our benefits, such as hybrid working, daycare allowance, corporate discounts, and wellbeing support (e.g. Headspace)Unwind in our break areas where you can help yourself to the healthy snacks and beverages providedSee another side of your coworkers at our frequent employee events and highly anticipated World Meeting and Holiday PartyHow You Will Create An ImpactAI Solution Engineering LeadDesign and lead development of AI products for business-specific use cases.Mentor and guide the software engineering team, setting clear technical directions and providing architectural oversight.Lead development of RAG and/or fine-tuning for LLMs and data pipelines for internal and external data sources (e.g., pricing databases, market benchmarks, CRM exports).Set engineering standards and code quality guidelines for the AI team.Work with MLOps engineers to deploy and maintain models.Optimize performance, latency, and cost of AI/GenAI solutions.Architecture & InfrastructureDesign scalable architectures for AI/GenAI products.Evaluate, select, and integrate third-party libraries and open-source frameworks.Set up databases and LLM frameworksWork with cloud platform (AWS) to deploy and manage services securely.MVP Delivery & ExperimentationRapidly prototype new ideas and iterate based on user feedback (consultants or clients).Lead technical PoCs and MVP development and evaluate build-vs-buy decisions for GenAI components.Stay ahead of AI/GenAI developments and assess new models/tools for adoption.About YouYou have 8+ years in software engineering, with at least 2 years focused on AI/ML.A standout university degree in a relevant field, with fluency in business English.Proven leadership in managing teams through complex infrastructure and data-centric projects, encouraging collaboration and innovation.Proven experience in designing and building applications using GenAI models, including opensource ad code generating models.Strong Python skills and experience with AI frameworks like Hugging Face Transformers, LangChain, and PyTorch.Experience with building and querying vector stores and knowledge retrieval systems.Working experience with cloud platformsWorking knowledge of MLOps, CI/CD for ML, and model monitoring.Familiarity with data privacy, model safety, and responsible AI practices.Excellent communication skills, with the ability to convey technical concepts clearly to diverse audiences.Have we sparked your interest? Simply click the 'Apply now' button to submit your application. Please note that, for data protection reasons, we cannot accept applications via email.Would you like to learn more about us and our company culture? Click here to watch our recruitment video.About Simon-KucherSimon-Kucher is a global consultancy with more than 2,000 employees in 30+ countries.Our sole focus is on unlocking better growth that drives measurable revenue and profit for our clients. We achieve this by optimizing every lever of their commercial strategy – product, price, innovation, marketing, and sales – based on deep insights into what customers want and value. With 40 years of experience in monetization topics of all kinds, we are regarded as the world’s leading pricing and growth specialist. simon-kucher.comWe believe in building a culture that embraces diversity, equity, and inclusion, creating an environment in which our people feel valued, are able to be themselves and feel their contribution matters. If we get that right, remarkable things will happen; people will grow faster, innovate, feel valued, and create better outcomes for everyone – our people, our clients and, of course, our business..Your Personal ContactMaria Weiningerrecruitment.germany(at)simon-kucher.comPlease submit your application exclusively via the“Apply now”button!Better growth starts here. With you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQE3BKkKJed3Uw/company-logo_100_100/company-logo_100_100/0/1688374962412/simon_kucher_logo?e=2147483647&v=beta&t=aZc-rzP9S0_e-LyplAZQeJI0xAzog7f-Uku3MpX0aXs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Software Engineer in Test (f/m/d)",
    "company": "Orbem",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-software-engineer-in-test-f-m-d-at-orbem-4317070949",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQEZeTccU5y7nw/company-logo_100_100/company-logo_100_100/0/1637160940545/orbem_ai_logo?e=2147483647&v=beta&t=EwQrA8QagPUuMcH_S2_wCkAG4grLS1Jgj9m1w2AAKac",
    "description": "Job DescriptionOrbem is an impact-driven deep-tech scaleup with global reach, founded in Munich, Germany, and now expanding internationally with our newest office in Houston, Texas. We develop fast, accurate, and accessible imaging solutions that provide access to otherwise unattainable sources of knowledge.We seek to make a difference – and develop solutions to sustainably feed the world, accelerate the transition to a green economy, and transform disease detection.Join us on our mission to unleash AI-powered imaging for everything and everyone.Senior Software Engineer in Test (f/m/d)Starting date:As soon as possibleSalary:€70,000 - €75,000 (fixed range, annual gross)Equity:€20,000 - €40,000Work model:Full-time, Remote / Hybrid in MunichYour RoleAs a Senior Software Engineer in Test, you'll join a multidisciplinary team with MRI and Software Engineers. You'll help to innovate and refine our cutting-edge scanning software for maximum precision and efficiency.Your expertise will enhance our testing capabilities, improve performance, and ensure the robustness and reliability of our systems.From unit testing to all the way through E2E testing and system health monitoring,your contributions will drive transformative advancements within our team.In this role, you'll play a key part in redefining software testing by delivering high-quality software.Your day-to-dayYour Responsibilities IncludeDesign and execute contract, integration and E2E tests, focusing on microservices communication between AI models, MRI systems, and Hardware components.Conduct thorough unit test reviews at code review stage to improve its quality and effectiveness to make them more impactful and valuable at capturing bugs.Expertise in designing and implementing mocks, stubs, and fakes with mocking frameworks such as Python's unittest.mock, pytest-mock, or equivalent tools to isolate testing, and mock hardware components.Developing reusable and modular test cases using tools like Pytest, Unittest, and rabbitMQ.Work closely with the Head of Quality Engineering to support your role and collaborate on testing strategies, ensuring the development of robust, scalable, and future-proof testing frameworks aligned with the global quality and testing framework practices.Own the testing framework within the team from unit testing, integration, contract and E2E testing to CI/CD pipeline, grafana, sentry monitoring, and maintainability and scalability of the testing framework.Design, implement, and maintain robust CI/CD pipelines that integrate with the overall test strategy to ensure efficient, high-quality software releases.Job requirementsYour Experiences And SkillsFit to our valuesWe own every challenge: we enjoy complexity and thrive under uncertainty.We strive for better: we seize any opportunity for growth and challenge the status quo. We are constantly learning and improving.We imagine new frontiers: we think beyond ‘doable’ and ‘reasonable.’ We design a sustainable and healthy future together.Experience And SkillsProficiency in Python, Pytest, Unittest.Expertise in designing and implementing mocks, stubs, and fakes with mocking frameworks such as Python's unittest.mock, pytest-mock, or equivalent tools to isolate testing.Experience in developing and maintaining scalable testing frameworks and managing CI/CD pipelines.Expertise in designing robust architecture while applying best practices in software development.Proficiency in working with messaging systems like RabbitMQ or RESTful APIs to design, test, and validate reliable communication between distributed services.Strong debugging skills to trace issues.Proficiency in designing and implementing unit test and TDD approaches.We look for people to join us in our journey towards a culture focused on the following principles:A friendly environment where collaboration and inclusivity empower everyone to do their best work.A commitment to scalability and great testing practices, designing solutions that are robust, efficient, and future-proof.The ability to see the big picture while addressing specific needs, balancing strategic thinking with tactical execution.A mindset that embraces challenges and does the hard work to eliminate testing bottlenecks and drive innovation.The confidence to say “no” when needed and the wisdom to work smarter, not harder, prioritizing impactful solutions.Eager to learn.What Makes You Stand Out From Other CandidatesYou’re a professional who brings Software Testing clarity to the team.You’re a professional who is seeking to deliver impact to the team and Customers.You’re proactive and resourceful, and someone who can transform an idea into solutions.Passionate about building software with the best practices, and curious about doing things differently and better.Passionate about mentoring developers to implement effective unit testing practices and write clean, maintainable code.A natural collaborator who fosters a friendly environment, inspiring others to grow and improve.Most importantly, you share our values of owning every challenge, strive for better and imagine new frontiers.What We OfferInternational Environment:Join a team with 40+ nationalities across 5 continents, all driven by a shared purpose: shedding light on the world’s toughest challenges.Attractive Compensation PackageStock Options: Share in Orbem’s success.Visa & Relocation Support: Seamless support for your move to Germany.Learning & Development: €1,750 annual budget for personal growth.Fitness Membership: Access to Urban Sports Club or Wellpass.Childcare Reimbursement: Support for Kita/Kindergarten fees.Deutschland Ticket: Full coverage of public transportation.Work-Life IntegrationFlexible Hours & Home Office: Work when and where it suits you.WFH Perks: Get €185 to upgrade your home office + a sleek external monitor on us!30 Days Paid Leave: Plenty of time to recharge.Personal Leave: Flexibility for life’s important moments.Work from Anywhere: Experience new cultures and environments for up to 60 days per year.Your teamAs a Senior Software Engineer in Test, you become part of our diverse and international team. Learn more about the team members, their work, and challenges here: www.orbem.ai",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQEZeTccU5y7nw/company-logo_100_100/company-logo_100_100/0/1637160940545/orbem_ai_logo?e=2147483647&v=beta&t=EwQrA8QagPUuMcH_S2_wCkAG4grLS1Jgj9m1w2AAKac",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Electrical Engineer – $200K",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-electrical-engineer-%E2%80%93-%24200k-at-mercor-4335162368",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:AI Tutor – Electrical and Computer Engineering SpecialistType:Full-timeCompensation:$90,000–$200,000/yearLocation:RemoteorIn-office (Palo Alto, CA)Commitment:40 hours/weekRole ResponsibilitiesUse proprietary software tools to label, annotate, and evaluate AI-generated outputs related to electrical and computer engineering topics.Contribute to the training and evaluation of advanced AI systems, ensuring the delivery of high-quality, structured data.Collaborate with research and technical teams to improve annotation tools and model performance.Interpret and execute evolving task instructions with precision and sound technical judgment.Support the creation of innovative training datasets that help AI systems reason effectively about circuit design, embedded systems, machine architecture, and signal processing.QualificationsMust-HaveMaster’s degree or PhD in Electrical Engineering, Computer Engineering, or a closely related field.Strong reading comprehension, analytical reasoning, and attention to technical detail.Excellent written and verbal English communication skills.Demonstrated ability to work independently and synthesize complex engineering information.Passion for technological advancement and AI innovation.PreferredPhD in Electrical or Computer Engineering.Published research or industry experience in areas such as systems design, robotics, or computational modeling.Prior experience as an AI Tutor, engineer, or technical educator.Teaching or mentoring background in engineering or computer science.Experience in technical writing or professional documentation.Compensation & Legal$90,000–$200,000/year for U.S.-based professionals, depending on experience and location.International pay scales available upon request.Comprehensive benefits available for full-time employees, with specifics varying by country of residence.U.S.-based applicants must reside outside of Wyoming and Illinois.Visa sponsorship is not available for this position.Application Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Software Engineer AI/RAG (m/w/x)",
    "company": "FoxBase GmbH",
    "location": "Greater Dusseldorf Area",
    "job_link": "https://de.linkedin.com/jobs/view/software-engineer-ai-rag-m-w-x-at-foxbase-gmbh-4335135442",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQH1F7c-mkpvLA/company-logo_100_100/company-logo_100_100/0/1630524658651/foxbase_logo?e=2147483647&v=beta&t=uIHhH8jr-kI9zK5jIMpetv47UzL3F_csANJtY-8CDNI",
    "description": "AI that makes complex B2B sales simple.With FoxBase’s AI Sales Advisor platform, companies can set up their own AI Product Expert, built for the real world of enterprise and “Mittelstand” companies.We help companies turn complex product portfolios and consultation-heavy sales into fully digital, AI-powered experiences — without compromising on quality, compliance, or control.Our platform combinesretrieval-augmented generation (RAG)with provenselection, configuration, and calculationtechnology to deliver precise, explainable, and compliant answers — across websites, chatbots, and digital channels.Unlike most AI tools built for big tech budgets, FoxBase empowers every company to deployhigh-impact, trustworthy AIthat meetsGDPR and ISO 27001 standardsfrom day one.We make cutting-edge AI accessible, secure, and enterprise-ready — strengthening the competitiveness of Germany and Europe in the new AI era.Who we areFounded in Düsseldorf, we’ve grown into a fast-moving team of engineers, product minds, and builders driven by curiosity and precision.We valuespeed, ownership, and quality, but alsoteam spirit, flexibility, and foresight— our five FoxBase core values that shape how we build, ship, and grow.Our customers include some of Europe’s most innovative industrial and technology leaders. Together, we’re redefining what “AI-driven sales” means in highly regulated environments — combining enterprise-grade security with modern AI orchestration.Who are we looking forWe’re looking for aSoftware Engineer AI/RAG, who’s passionate about building production-grade AI systems. Someone who thrives on solving complex technical problems, thinks in systems, and ships solutions that are both elegant and efficient.This isn’t just about writing code. It’s about designing the backbone of AI systems that European enterprises cantrust.What you’ll doOwn and evolve ourRetrieval-Augmented Generation (RAG)stack – from data ingestion and indexing to LLM integration and feedback loops.Build and optimize pipelines that combinevector databases, embeddings, and re-ranking modelsfor reliable, explainable outputs.Design monitoring andquality assurance frameworksto ensure consistent, measurable AI performance.Collaborate closely with product and development teams to translate business complexity into scalable, maintainable architectures.ManageAWS infrastructureusing Terraform and ensure cost-efficient, secure, and highly available deployments.Support our continuous improvement process by experimenting with new models, frameworks, and architectural patterns.Mentor junior engineers and contribute to a culture of learning, responsibility, and craftsmanshipWhat you’ll bring2+ years of experience in software engineering — ideally inPython-based SaaS or AI systems.Deep knowledge ofLLM and RAG concepts(retrieval pipelines, embeddings, prompt orchestration, evaluation).Solid understanding ofPostgreSQLand data modeling; experience withQdrantis a plus.Hands-on experience withAWS(RDS, S3, Lambda) andInfrastructure as Code(Terraform).Strong debugging and observability mindset, you care about uptime, latency, and real-world performance.Familiarity secure architectures andGDPR-compliant environments.Curiosity and initiative, you love learning, sharing, and applying new concepts to improve our platform.Fluent in English (German is a plus, but not required).Nice to haveExperience buildingenterprise AI applications(RAG, knowledge bases, LLM integrations).Background incloud cost optimization, observability (Prometheus, Grafana), or performance engineering.Contributions to open-source AI tools or frameworks.Interest in explainable AI, evaluation pipelines, or model observability tooling.Our tech stackBackend Framework:FastAPI for high-performance APIs and servicesData Modelling & Validation:Pydantic and Pydantic-AI for structured LLM interactions and schema enforcementCloud & Infrastructure:AWS Lambda (serverless microservices) integrated with API Gateway, Terraform for infrastructure provisioning and deployment automationData & Workflow Orchestration:Apache Airflow for managing and scheduling data pipelinesDatabases:Qdrant (vector database) for semantic search and RAG systems,  PostgreSQL for structured relational dataLarge Language Models:Integration with multiple LLM providers (OpenAI, Bedrock, etc.) for retrieval-augmented and agentic applications - model-agnostic and vendor-flexibleVisualisation & Monitoring:Plotly Dash for interactive dashboards and data visualizations, Grafana for system telemetry, metrics, and performance monitoringWhy you’ll love working hereReal impact:Your work powers AI systems used by leading European enterprises in chemicals, construction, and machinery.End-to-end ownership:you’ll design, build, and ship your own features, from concept to production.AI that matters:We don’t build hype demos; we build trusted, explainable AI that improves real business decisions.Freedom & flexibility:Work remotely or from our Düsseldorf HQ, we trust you to manage your time.Learning culture:Dedicated budget for conferences, courses, and coaching.Strong team spirit:We meet on a weekly or monthly basis in our Düsseldorf HQ for creative exchange and to stay connected. We take work seriously, but not ourselves — think quiz nights, good music, GeoGuessr, and darts.Compliance & security mindset:Build with peace of mind — in a GDPR and ISO 27001-certified environment.How we workAt FoxBase, engineers are problem-solvers, not just coders. We build with purpose — connecting data, AI, and people to deliver measurable results.We move fast, stay curious, and design with compliance and performance in mind.We keep things pragmatic — shipping high-quality, cost-efficient, and scalable solutions while continuously improving the product with measurable increments.Our journey so farBuilt one of the firstenterprise-ready RAG frameworkstailored for regulated B2B environmentsDelivered AI Product Experts forindustry leaders in telecomunications, chemicals, and constructionIntegratedAI quality assurance and feedback loopsthat keep models explainable and auditableEstablished afully GDPR-compliant infrastructure, hosted in the EU and certified toISO 27001standardsAnd built a team culture that loves solving hard problems — with good music, quiz nights, and the occasional game of darts.The next chapterWe’re in a defining moment for AI in B2B sales. Now we’re looking for builders, engineers, and creators who want to shape how businesses sell and support their customers with intelligent, transparent, and controllable AI.If you’re ready to buildthe most reliable AI Sales Platform in Europe, come join us.Let’s make complex sales simple together.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQH1F7c-mkpvLA/company-logo_100_100/company-logo_100_100/0/1630524658651/foxbase_logo?e=2147483647&v=beta&t=uIHhH8jr-kI9zK5jIMpetv47UzL3F_csANJtY-8CDNI",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Software Engineer, Backend (Berlin)",
    "company": "Cresta",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-software-engineer-backend-berlin-at-cresta-4219208648",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQHdfq5NX-XSDw/company-logo_100_100/B56ZgJWEscHMAQ-/0/1752503438463/cresta_inc_logo?e=2147483647&v=beta&t=8uZ5Cd8DAc6umxsl1xpUgBRE71qQSPg4hEniIwDxNUE",
    "description": "Cresta is on a mission to turn every customer conversation into a competitive advantage by unlocking the true potential of the contact center. Our platform combines the best of AI and human intelligence to help contact centers discover customer insights and behavioral best practices, automate conversations and inefficient processes, and empower every team member to work smarter and faster. Born from the prestigious Stanford AI lab, Cresta's co-founder and chairman is the German Sebastian Thrun, the genius behind Google X, Waymo, Udacity, and more. Our leadership also includes CEO, Ping Wu, the co-founder of Google Contact Center AI and Vertex AI platform, and co-founder, Tim Shi, an early member of Open AI.We’ve assembled a world-class team of AI and ML experts, go-to-market leaders, and top-tier investors including Andreessen Horowitz, Greylock Partners, Sequoia, and former AT&T CEO John Donovan. Our valued customers include brands like Intuit, Cox Communications, Hilton, and Carmax and we’ve been recognized by Forbes and Bain Consulting as one of the top private AI companies in the world.Join us on this thrilling journey to revolutionize the contact center workforce with AI. The future of work is here, and it's at Cresta.About The RoleAs a Senior full-stack engineer, with a backend focus, you will be at the forefront of shaping the future of customer engagement! As we work towards our vision, you'll be instrumental in delivering timely, actionable insights that drive business growth from day one. We're building a state-of-the-art Customer Data Platform, visualizing relevant insights for businesses post-onboarding and guiding customer engagement across all touch-points. Be part of the team that's redefining the way businesses connect with their customers!ResponsibilitiesDesign, implement, and maintain backend services and APIs to support applications.Build and optimize data storage solutions using Postgres, ClickHouse and Elasticsearch to ensure high performance and scalability.Collaborate with cross-functional teams, including frontend engineers, data scientists, and machine learning engineers, to deliver end-to-end solutions.Monitor and troubleshoot performance issues in distributed systems and databases.Write clean, maintainable, and efficient code following best practices for backend development.Participate in code reviews, testing, and continuous integration efforts.Ensure security, scalability, and reliability of backend services.Analyze and improve system architecture, focusing on performance bottlenecks, scaling, and security.Qualifications We ValueProven experience as a Backend Engineer with a focus on database design and system architecture.Strong expertise in ClickHouse or similar columnar databases for managing large-scale, real-time analytical queries.Hands-on experience with Elasticsearch for indexing and searching large datasets.Proficient in backend programming languages such as Python, Go.Experience with RESTful API design and development.Solid understanding of distributed systems, microservices architecture, and cloud infrastructure.Experience with performance tuning, data modeling, and query optimization.Strong problem-solving skills and attention to detail.Excellent communication and teamwork abilities.Perks & BenefitsPaid parental leave to support you and your familyMonthly Health & Wellness allowanceWork from home office stipend to help you succeed in a remote environmentLunch reimbursement for in-office employeesPTO: 28 days in GermanyCompensation for this position includes a base salary, equity, and a variety of benefits. Actual base salaries will be based on candidate-specific factors, including experience, skillset, and location, and local minimum pay requirements as applicable. Your recruiter can provide further details.We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates' personal and financial information through fake interviews and offers. All Cresta recruiting email communications will always come from the @cresta.ai domain. Any outreach claiming to be from Cresta via other sources should be ignored. If you are uncertain whether you have been contacted by an official Cresta employee, reach out to recruiting@cresta.ai",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQHdfq5NX-XSDw/company-logo_100_100/B56ZgJWEscHMAQ-/0/1752503438463/cresta_inc_logo?e=2147483647&v=beta&t=8uZ5Cd8DAc6umxsl1xpUgBRE71qQSPg4hEniIwDxNUE",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Mathematiker / Aktuar / Data Scientist (m/w/d) im Finanzwesen",
    "company": "Swiss Life Deutschland",
    "location": "Garching, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/mathematiker-aktuar-data-scientist-m-w-d-im-finanzwesen-at-swiss-life-deutschland-4311458429",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQEYmFW6hxKtWg/company-logo_100_100/company-logo_100_100/0/1630518342410/swiss_life_deutschland_logo?e=2147483647&v=beta&t=2ZheMcXNDXm9QNiGF71P1B2jxNPylBw0cyF_Nm4KcTE",
    "description": "Dein VerantwortungsbereichDu liebst den Umgang mit großen Datenmengen, analysiert gerne komplexe Zusammenhänge und kannst den Zahlen eine ökonomische Bedeutung geben? Dann bist du in unserem interdisziplinären Team genau richtig!Als Mathematiker, Aktuar oder Data Scientist (m/w/d) unterstützt du bei der Erstellung von Quartals- und Jahresabschlüssen der Swiss Life Versicherungsgesellschaften unter HGB und IFRSDu verfolgst die bilanzielle Würdigung und Umsetzung von versicherungstechnischen Geschäftsvorfällen und bist auf diesem Gebiet Ansprechpartner für den WirtschaftsprüferAuch ein Einarbeiten in Gesetzestexte bereitet dir Freude, sodass du im Rahmen von Projekten an der Umsetzung neuer aufsichtsrechtlicher Anforderungen mitarbeitestDu zeigst Teamgeist und starke kommunikative Fähigkeiten bei Sonderthemen wie z.B. bei der Einführung von neuen IT-Anwendungen oder bei ProzessautomatisierungenDeine StärkenDu hast dein (wirtschafts-)mathematisches oder ein vergleichbares Studium (Physik, Data Science o.ä.) erfolgreich abgeschlossenMehrjährige Berufserfahrung im Versicherungsbereich mit Kenntnissen in der Bilanzierung nach HGB und IFRS bringst du idealerweise mitDu hast Freude an Projektarbeit und kannst dort deine konzeptionellen und analytischen Fähigkeiten einbringenDu strebst die Aktuarsausbildung oder CERA-Weiterbildung an, oder hast diese bereits erfolgreich absolviertDeine guten MS-Office Kenntnisse kannst du neben der Erfahrung mit Datenbanken (SQL und Python) gezielt einsetzenDu hast kreative Ideen, zeigst hohe Eigeninitiative beim Lernen neuer Sachverhalte, und hast Freude daran, gemeinsam im Team Lösungen zu finden.BenefitsFamilieKostenfreie Beratungs- und Vermittlungsangebote durch den pme-FamilienserviceZulagen und Sonderurlaub für besondere Ereignisse, z.B. Hochzeit, GeburtKulturStärkung des Wir-Gefühls, u.a. mit Mittagsroulette, Walk and TalksFörderung einer diversen Arbeitswelt, z.B. mit dem Frauennetzwerk Female CareersFlache HierachienProfessionelle Vorsorgeberatung (z.B. Berufsunfähigkeit, Pflegeversicherung oder betriebliche Altervorsorge)Umwandlung von Sonderzahlungen in FreizeitVielfältige Varianten der betrieblichen AltersvorsorgeEntwicklungsmöglichkeitenGroßes internes \"Lernbar\"-Angebot mit vielfältigen Themen zur persönlichen und fachlichen Weiterbildung, auch über eine digitale LernplattformUnterstützung bei externer Aus- und WeiterbildungIndividuelle Karriereplanung (360 Grad-Feedback, jährliche Performancegespräche, Talentförderprogramm)New WorkFlexible ArbeitszeitenMobile Working Quote von 60%Bürokonzept Flex-OfficeSabbaticalsModerne Führungskonzepte z.B. Shared LeadershipGesundheitVeranstaltungen und Kurse zum Thema Gesundheit, wie z.B. Gesundheitstage, Rückencheck-ups, Grippeschutzimpfungen und vieles mehrSwiss Life Sport Club: Angebote von Yoga und Pilates bis Badminton, Fußball und SegelnErgonomische BüroausstattungBetriebsrestaurant (eine der 25 besten Kantinen in Deutschland)30 UrlaubstageMobilitätZuschuss zum Jobticket für die öffentlichen Verkehrsmittel oder ParkplatzLadestationen für E-Autos & E-BikesJobRad: Möglichkeit ein Fahrrad, Pedelec oder E-Bike zu leasenNachhaltigkeitSwiss Life Stiftung für Chancenreichtum und Zukunft100% Strom aus erneuerbaren EnergieFörderung des Jugend- und BehindertensportsDein KontaktJulia StobbeHR-ManagerinWir haben dein Interesse geweckt? Dominik Schwab als verantwortliche Führungskraft und sein Team freuen sich auf deine Bewerbung. Dafür reichen uns dein Lebenslauf sowie relevante Zeugnisse vollkommen aus.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQEYmFW6hxKtWg/company-logo_100_100/company-logo_100_100/0/1630518342410/swiss_life_deutschland_logo?e=2147483647&v=beta&t=2ZheMcXNDXm9QNiGF71P1B2jxNPylBw0cyF_Nm4KcTE",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Go Backend Engineer – AI Systems",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/go-backend-engineer-%E2%80%93-ai-systems-at-mercor-4335152480",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Go EngineerType:FreelanceCompensation:$200/hourLocation:RemoteDuration:1 monthCommitment:15–20 hours/weekRole ResponsibilitiesDevelop and validate coding benchmarks in Go by curating issues, solutions, and test suites from real-world repositories.Ensure benchmark tasks include comprehensive unit and integration tests for solution verification.Maintain consistency and scalability of benchmark task distribution.Provide structured feedback on solution quality and clarity.Debug, optimize, and document benchmark code for reliability and reproducibility.Work independently and asynchronously with flexible hours to improve AI systems.QualificationsMust-Have3–10 years of experience as a backend software engineer, ML engineer, or applied data scientist.Degree in Software Engineering, Computer Science, or a related field.Strong proficiency in Go.Experience with debugging, testing, and validating code.Comfortable with technical writing and attention to detail.Start DateImmediateCompensation & LegalIndependent contractorDaily payment via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resumeAI interview: A short, 15-minute conversational session to understand your background, experience, and interest in the roleBrief assessment testing real-world coding ability, technical depth, and debugging approachFollow-up communication within a few days with next steps and onboarding detailsResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Mechanical Engineer | $200K/year",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-mechanical-engineer-%24200k-year-at-mercor-4335142567",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:AI Tutor – Mechanical Engineering SpecialistType:Full-timeCompensation:$90,000–$200,000/yearLocation:Based in Palo Alto, CA (in-office, 5 days per week) or fully RemoteCommitment:Typical hours: 9:00am–5:30pm PST during training, then aligned with your local timezoneRole ResponsibilitiesUse proprietary tools to label, annotate, and evaluate AI-generated data related to mechanical engineering.Provide expert feedback on technical problems and ensure the delivery of high-quality, curated datasets.Collaborate with research and engineering teams to refine annotation tools and data collection methods.Interpret evolving instructions accurately and apply sound professional judgment.Contribute to AI model improvement through rigorous analysis and expert input.QualificationsMust-HaveMaster’s or PhD in Mechanical Engineering or a closely related field.Strong ability to read and write both formal and informal English.Skilled in using online databases, research tools, and technical resources.Excellent communication, analytical, and organizational skills.Ability to work independently and make well-reasoned decisions with limited guidance.Demonstrated passion for technology, innovation, and scientific advancement.PreferredPhD in Mechanical Engineering with substantial professional or research experience.At least one publication in a recognized scientific or engineering journal.Teaching or tutoring experience in engineering or technical subjects.Prior experience in AI data annotation or technical writing.Professional background as a mechanical engineer.Compensation & LegalCompetitive pay ranging from $90,000 to $200,000 annually for U.S.-based professionals, depending on experience and location.Access to medical benefits, subject to your country of residence.Application Process (Takes 20–30 mins to complete)Submit your resume.Complete a 20-minute introductory interview.Selected candidates will move on to a focused mechanical engineering data evaluation exercise.Finalists will participate in a team discussion and review of their expertise.The full process typically concludes within one week.Resources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Electrical Design Engineer | Up to $200K",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/electrical-design-engineer-up-to-%24200k-at-mercor-4335272044",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:AI Tutor – Electrical and Computer Engineering SpecialistType:Full-timeCompensation:$90,000–$200,000/yearLocation:RemoteorIn-office (Palo Alto, CA)Commitment:40 hours/weekRole ResponsibilitiesUse proprietary software tools to label, annotate, and evaluate AI-generated outputs related to electrical and computer engineering topics.Contribute to the training and evaluation of advanced AI systems, ensuring the delivery of high-quality, structured data.Collaborate with research and technical teams to improve annotation tools and model performance.Interpret and execute evolving task instructions with precision and sound technical judgment.Support the creation of innovative training datasets that help AI systems reason effectively about circuit design, embedded systems, machine architecture, and signal processing.QualificationsMust-HaveMaster’s degree or PhD in Electrical Engineering, Computer Engineering, or a closely related field.Strong reading comprehension, analytical reasoning, and attention to technical detail.Excellent written and verbal English communication skills.Demonstrated ability to work independently and synthesize complex engineering information.Passion for technological advancement and AI innovation.PreferredPhD in Electrical or Computer Engineering.Published research or industry experience in areas such as systems design, robotics, or computational modeling.Prior experience as an AI Tutor, engineer, or technical educator.Teaching or mentoring background in engineering or computer science.Experience in technical writing or professional documentation.Compensation & Legal$90,000–$200,000/year for U.S.-based professionals, depending on experience and location.International pay scales available upon request.Comprehensive benefits available for full-time employees, with specifics varying by country of residence.U.S.-based applicants must reside outside of Wyoming and Illinois.Visa sponsorship is not available for this position.Application Process (Takes 20–30 mins to complete)Upload resumeAI interview based on your resumeSubmit formResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Mechanical Engineering Advisor",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/mechanical-engineering-advisor-at-mercor-4335242084",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:Engineering ProfessionalType:Independent contractorCompensation:$70–$90/hourLocation:RemoteDuration:1–2 monthsCommitment:20–40 hours/weekRole ResponsibilitiesCreate and assess complex problems in engineering across subdomains such as civil, mechanical, electrical, chemical, materials, and systems engineering.Evaluate AI-generated responses for conceptual accuracy, technical rigor, and domain relevance.Provide clear written feedback on engineering problem sets, designs, and solutions.Collaborate asynchronously with AI researchers and engineers to iterate and improve model performance.Ensure technical accuracy and academic precision in all engineering content used to train or evaluate AI systems.QualificationsMust-HavePhD in Engineering (e.g., Mechanical, Electrical, Civil, Chemical, Materials, Aerospace, or Systems) or a closely related discipline from a top-tier university.2+ years of academic experience (research, publication, teaching) or professional experience (engineer, researcher, or technical specialist).Deep subject-matter expertise across core areas of mathematics.Exceptional written and verbal communication skills.Strong attention to detail and analytical thinking.Start DateImmediateCompensation & LegalIndependent contractorDaily payment via Stripe ConnectApplication Process (Takes 20–30 mins to complete)Upload resume (and portfolio/notebook links if available) and application formAI interview: A short, 15-minute conversational session to understand your background, experience, and interest in the roleWork trial: A paid, 4-hour assessment evaluating your ability to interpret project guidelines and deliver math-specific outputResources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Mechanical Engineer – Product Dev",
    "company": "Mercor",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/mechanical-engineer-%E2%80%93-product-dev-at-mercor-4335340556",
    "posted_date": "N/A",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "description": "About The JobMercorconnects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors includeBenchmark,General Catalyst,Peter Thiel,Adam D'Angelo,Larry Summers, andJack Dorsey.Position:AI Tutor – Mechanical Engineering SpecialistType:Full-timeCompensation:$90,000–$200,000/yearLocation:Based in Palo Alto, CA (in-office, 5 days per week) or fully RemoteCommitment:Typical hours: 9:00am–5:30pm PST during training, then aligned with your local timezoneRole ResponsibilitiesUse proprietary tools to label, annotate, and evaluate AI-generated data related to mechanical engineering.Provide expert feedback on technical problems and ensure the delivery of high-quality, curated datasets.Collaborate with research and engineering teams to refine annotation tools and data collection methods.Interpret evolving instructions accurately and apply sound professional judgment.Contribute to AI model improvement through rigorous analysis and expert input.QualificationsMust-HaveMaster’s or PhD in Mechanical Engineering or a closely related field.Strong ability to read and write both formal and informal English.Skilled in using online databases, research tools, and technical resources.Excellent communication, analytical, and organizational skills.Ability to work independently and make well-reasoned decisions with limited guidance.Demonstrated passion for technology, innovation, and scientific advancement.PreferredPhD in Mechanical Engineering with substantial professional or research experience.At least one publication in a recognized scientific or engineering journal.Teaching or tutoring experience in engineering or technical subjects.Prior experience in AI data annotation or technical writing.Professional background as a mechanical engineer.Compensation & LegalCompetitive pay ranging from $90,000 to $200,000 annually for U.S.-based professionals, depending on experience and location.Access to medical benefits, subject to your country of residence.Application Process (Takes 20–30 mins to complete)Submit your resume.Complete a 20-minute introductory interview.Selected candidates will move on to a focused mechanical engineering data evaluation exercise.Finalists will participate in a team discussion and review of their expertise.The full process typically concludes within one week.Resources & SupportFor details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcomeFor any help or support, reach out to: support@mercor.comPS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity.,",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=2147483647&v=beta&t=cpUXGkaxCmU_aMXDBhGHPvUQNQ5X6fjwL35Xx2sFTo0",
    "in_time_range": true,
    "time_note": ""
  }
]