[
  {
    "title": "Data Scientist",
    "company": "Instaffo",
    "location": "Weiden, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-at-instaffo-4318274946",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQHavKSx4m9UQg/company-logo_100_100/company-logo_100_100/0/1630565302253/instaffo_gmbh_logo?e=2147483647&v=beta&t=hajWxmogZTM9iX-EUafV4ExWeuRjZoytk4Pg8De9Odg",
    "description": "Data Scientist bei openpack GmbHAnforderungenWohnsitz:Nur für Bewerber aus DeutschlandAbgeschlossenes Studium der Mathematik, Physik, Informatik, Datenwissenschaft oder vergleichbare QualifikationErfahrung in der Entwicklung von IIoT-Lösungen und der Anwendung von Machine Learning-TechnikenKenntnisse in Large Language Models (LLM) und die Bereitschaft zur kontinuierlichen WeiterbildungProgrammierkenntnisse in Sprachen wie Python oder JavaHohe Motivation, Projekte selbst zu gestalten und voranzutreibenErfahrung im Umgang mit Big Data-Technologien und DatenbankenTeamfähigkeit, Eigeninitiative und kreatives ProblemlösungsvermögenTätigkeitenDatenmanagementEntwicklung von Strategien für effiziente Datenakquise, -verarbeitung und -speicherung.Sicherstellung der Datenqualität und -integrität.Entwicklung von IIoT-LösungenAnalyse und Auswertung von IIoT-Daten zur Identifizierung von OptimierungsmöglichkeitenKonzeption und Umsetzung von IIoT-Anwendungen zur Steigerung der Effizienz und ProduktivitätMachine LearningAnwendung von fortgeschrittenen Machine Learning-Algorithmen zur Vorhersage von Anomalien, Ausfällen und zur Optimierung von ProzessenErstellung von Modellen für predictive Maintenance und vorausschauende Analysen bzw. SimulationenLarge Language Models (LLM)Integration von LLM-Technologien zur kontinuierlichen Verbesserung der Modelle und AlgorithmenTeamMit einer Teamgröße von ca. 25 Personen bietet openpack ein Umfeld, in dem mit kurzen Entscheidungswegen schnell Projekte und Themen vorangetrieben werden können. Selbständiges Arbeiten in den Teams ist selbstverständlich. Als Data Scientist unterstützt du in deiner Querschnittsfunktion alle Teams und entwickelst gemeinsam Strategien, wie die vorliegeneden Daten der Kunden genutzt werden können, um die Kundenbedürfnisse zu unterstützen.Über das UnternehmenDie openpack GmbH entwickelt mit openpack eine digitale Plattform für die Wellpappen- & Verpackungsindustrie. In der Plattform verbinden wir Hersteller, Dienstleister und Kunden in einem einzigartigen digitalen Ökosystem und fungieren als innovative Drehscheibe für die gesamte Value Chain. Neben der Digitalisierung und Vernetzung von Industriemaschinen (Industrie 4.0 bzw. IIoT) gehen wir neue Wege und optimieren Branchenprozesse (z.B. Einkauf, Vertrieb, Logistik etc.) durch digitale Lösungen. Hierfür nutzen wir die gesamte Bandbreite von bestehenden Web- und Cloudtechnologien und integrieren auch zahlreiche Partner oder Plattformen. Unser Ziel ist es, die Teilnehmer von openpack produktiver und das Leben der Mitarbeiter einfacher zu machen.Klicke auf \"Bewerben\" für Details zu den Benefits, dem Team und dem Bewerbungsprozess.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQHavKSx4m9UQg/company-logo_100_100/company-logo_100_100/0/1630565302253/instaffo_gmbh_logo?e=2147483647&v=beta&t=hajWxmogZTM9iX-EUafV4ExWeuRjZoytk4Pg8De9Odg",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Developer (m/w/d)",
    "company": "CGI",
    "location": "Eschborn, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-developer-m-w-d-at-cgi-4077742801",
    "posted_date": "9 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQErzXWSFkn9tQ/company-logo_100_100/company-logo_100_100/0/1663664110809/cgi_logo?e=2147483647&v=beta&t=ij1LHgnuOsTNPdqx4ZbUQN5MAamZh85SdKfWcRfMVt4",
    "description": "StellenbeschreibungAus 1 mach mehr als 91.000 – so beginnt unsere Unternehmensgeschichte. Und sie ist noch lange nicht zu Ende erzählt: Inhabergeführt, in den vergangenen Jahrzehnten kontinuierlich gewachsen und heute einer der größten unabhängigen IT- und Businessdienstleister der Welt. Durch unsere Kundennähe entstehen vertrauensvolle Beziehungen und unsere Branchen- und Technologiekompetenz ermöglicht es, die Bedürfnisse unserer Zielgruppen zu erfüllen.Dein Herz schlägt für Daten und Machine-Learning? Du hast Erfahrungen mit Projekten im Data Science oder KI-Umfeld gesammelt? Und du suchst nach einer sinnstiftenden Tätigkeit sowie der Chance, einen echten Mehrwert für die Gesellschaft zu schaffen? Dann werde Teil unserer Erfolgsgeschichte und gestalte mit uns in anspruchsvollen Projekten die digitale Zukunft Deutschlands!AlsAI Developer(m/w/d) unterstützt du ein hochdynamisches Team bei der Implementierung anspruchsvoller KI-Projekte bei Kunden im öffentlichen Dienst. Du hilfst uns bei der Umsetzung innovativer Projekte, insbesondere in der Verwendung von Large Language Models und anderen Foundation Models zur Steigerung der Effizienz der Verwaltungsarbeit. Gemeinsam schaffen wir die Verwaltung des 21. Jahrhunderts, zum Beispiel durch die Bereitstellung digitaler Assistenten oder bei der Digitalisierung von Verwaltungsvorgängen.Unser hybrides Arbeitsmodell ermöglicht dir eine gesunde Mischung aus Home-Office und Einsätzen am Kundenstandort. Natürlich stehen Dir auch unsere Büros in Kaiserslautern, Eschborn (bei Frankfurt am Main) und Alsfeld zur Verfügung.AufgabenDu identifizierst Muster, Zusammenhänge und Ansätze für Prozessoptimierungen.Du übernimmst Management und Governance von TrainingsdatenDu bist zuständig für eine verantwortungsvolle und ethische KI-Entwicklung, insbesondere unter Einhaltung der Vorgaben des AI ActsFür unsere Kunden konzipierst und entwickelst du KI-Lösungen, die Data Engineering, Modellentwicklung und Bereitstellung der Modelle umfassen.Du arbeitest mit verschiedenen IT- und Fachbereichen zusammen und befindest dich in einem anspruchsvollen und abwechslungsreichen Projektumfeld.QualifikationDu hast ein Studium im Bereich (Wirtschafts-) Informatik, Mathematik, Statistik abgeschlossen oder verfügst über eine vergleichbare Qualifikation.Du kennst dich gut mit den verschiedenen Machine Learning Verfahren und Modellarten aus.Du hast bereits drei oder mehr Jahre Berufserfahrung im Bereich Data Science oder mit Anwendungen von KI.Du bist mit dem einschlägigen Software-Stack vertraut und hast damit bereits Erfahrungen in Projekten gesammelt.Zudem hast du Erfahrungen in der Aufbereitung und Analyse von Daten sowie in der Konzeption und Implementierung von Daten-Pipelines.Erfahrungen mit Natural Language Processing, insbesondere im Umgang mit großen Sprachmodellen sind von großem VorteilDu löst mit Begeisterung komplexe Aufgaben und eine bereichsübergreifende Denkweise zeichnet dich aus.Teamfähigkeit, Zuverlässigkeit und Engagement zählen zu deinen Stärken.Deutsch und Englisch beherrschst du fließend in Wort und Schrift (Deutsch mindestens auf B2-Niveau).Was wir dir bieten:Bei uns findest du Kolleg:innen, mit denen die Zusammenarbeit Spaß macht. Wir begegnen uns offen, duzen uns über alle Positionen hinweg und denken nicht in Hierarchien oder Silos.Du arbeitest meist direkt an deinem Heimatort – weil wir Kundennähe wörtlich nehmen und uns Work-Life-Balance am Herzen liegt.Du profitierst von flexiblen Arbeitszeiten und hast je nach Kundensituation die Möglichkeit, von zuhause zu arbeiten.Die richtigen Trainings und Zertifikate bringen deine Weiterbildung voran. Unsere E-Learning-Plattform Academia ermöglicht dir das Lernen, wo und wann du willst.Einen Teil deines Bruttogehalts kannst du in CGI Aktien investieren – bis maximal 3 % des Monatsgehalts geben wir für jeden Euro einen weiteren hinzu.Außerdem beteiligen wir dich am Unternehmenserfolg: Du erhältst eine Gewinnbeteiligung, die sich nach deiner individuellen Leistung richtet, sowie danach, wie wir als Unternehmen unsere finanziellen Ziele erreichen konnten.Wir bieten verschiedene Modelle, damit du mobil sein kannstSabbatical oder Elternzeit werden unterstützt. Sie sind bei uns kein Karriere-Stopper!Wir sind an deiner Seite, auch wenn es einmal nicht so gut läuft: Du kannst Sonderurlaub nehmen, und unsere Beratungshotline steht dir immer zur Verfügung.Eine Vielzahl an gemeinsamen Events und Freizeitaktivitäten stärkt deine Verbundenheit mit deinen Kolleg:innen.Together, as owners, let’s turn meaningful insights into action.1976 gegründet und nach wie vor familiengeführt, ist CGI heute einer der weltweit größten unabhängigen Anbieter von IT und Business Consulting. Ein hohes Maß an Eigenverantwortung, Teamwork, Respekt und Zusammenhalt machen das Arbeiten bei uns besonders. Bei uns kannst du dein volles Potenzial entfalten!Du darfst dich vom ersten Tag an als Miteigentümer:in von CGI verstehen. Wir lassen unsere Vision gemeinsam Wirklichkeit werden. Wir profitieren von unserem gemeinsamen Erfolg und haben die Möglichkeit und die Verantwortung, die Strategie und Ausrichtung unseres Unternehmens aktiv mitzugestalten.Deine Arbeit schafft Mehrwert. Du findest innovative Lösungen und stärkst dein Netzwerk aus Kolleg:innen und Kunden. Gleichzeitig hast du Zugang zu globalen Ressourcen, um große Ideen zu verwirklichen, neue Chancen zu nutzen und von der immensen Branchen- und Technologie-Kompetenz zu profitieren.Du bringst deine Karriere voran, da du in einem Unternehmen arbeitest, das auf Wachstum und Langlebigkeit ausgelegt ist. Du wirst von Führungskräften unterstützt, die deine Gesundheit und Zufriedenheit fördern – und dir Möglichkeiten bieten, deine Fähigkeiten zu vertiefen und deinen Horizont zu erweitern.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQErzXWSFkn9tQ/company-logo_100_100/company-logo_100_100/0/1663664110809/cgi_logo?e=2147483647&v=beta&t=ij1LHgnuOsTNPdqx4ZbUQN5MAamZh85SdKfWcRfMVt4",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Calyptus",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-at-calyptus-4335888378",
    "posted_date": "13 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHuoSQR3JM5oA/company-logo_100_100/B4EZem3TsxGwAY-/0/1750851206908/calyptus_web3_logo?e=2147483647&v=beta&t=fRd5xxAIb3c7qfZ9BSQBDPv3TulICV5ratSr_KEf_Zg",
    "description": "Want to put your job search on autopilot? Join our platform, complete a 6-minute AI screening interview, and get auto-applied to 100s of high-paying roles.Sign up now at https://app.calyptus.co/auth/candidate/sign-up and let the opportunities come to you.____________________________________________________________What You’ll DoLead the design and deployment of end-to-end ML systems for enterprise applications, from experimentation to production.Apply large language models (LLMs) effectively by:Fine-tuning and evaluating domain-specific modelsDeveloping robust prompt engineering and orchestration strategiesOptimizing inference pipelines for latency, throughput, and cost efficiencyWrite production-quality software with strong engineering rigor, including clean APIs and reliable systems, while collaborating closely with product engineers.Build high-reliability ML infrastructure, including training pipelines, model registries, observability, and CI/CD for ML.Ensure ML solutions meet enterprise standards for security, compliance, data privacy (e.g., SOC2, GDPR), explainability, and auditability.Develop evaluation and monitoring frameworks to measure accuracy, fairness, robustness, and drift in deployed models.Partner with product and GTM teams to identify high-value enterprise use cases for ML and translate them into scalable solutions.Collaborate directly with customer-facing teams to deliver high-impact enterprise projects.Mentor engineers and raise the bar for technical excellence across the organization.Influence technical strategy and help define the company’s long-term AI roadmap.Who You’ll BeAn experiencedPython developerwith strong knowledge of data structures, algorithms, and CI/CD pipelines.AMachine Learning professionalskilled in data wrangling (SQL, pandas, NumPy), supervised and unsupervised learning, model evaluation, and feature engineering.Knowledgeable inDeep Learning frameworkssuch as PyTorch, with experience in neural networks and NLP models; exposure to generative and multi-modal models is a plus.Experienced inMLOps, including model serving, orchestration (Kubernetes), and experiment tracking, with the ability to design and deliver large-scale ML systems focused on cost optimization and reproducibility.Equipped with a solid foundation inlinear algebra, probability, statistics, and calculus.An effective communicator who can translate technical concepts into clear business value and collaborate with non-technical stakeholders.A mentor and leader who provides guidance through code reviews, architectural decisions, and technical direction.____________________________________________________________Want to put your job search on autopilot? Join our platform, complete a 6-minute AI screening interview, and get auto-applied to 100s of high-paying roles.Sign up now at https://app.calyptus.co/auth/candidate/sign-up and let the opportunities come to you.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQHuoSQR3JM5oA/company-logo_100_100/B4EZem3TsxGwAY-/0/1750851206908/calyptus_web3_logo?e=2147483647&v=beta&t=fRd5xxAIb3c7qfZ9BSQBDPv3TulICV5ratSr_KEf_Zg",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Databricks and/or AWS ML engineers wanted",
    "company": "Würth IT GmbH",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/databricks-and-or-aws-ml-engineers-wanted-at-w%C3%BCrth-it-gmbh-4340591113",
    "posted_date": "5 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFk7VkqULJTJw/company-logo_100_100/company-logo_100_100/0/1676280823742/wrth_it_logo?e=2147483647&v=beta&t=Yhr5A2vODEkOc257e5u6LSqvrAwWxRA6jRY9q05IeJU",
    "description": "Company DescriptionWürth IT GmbH is an internationally active, medium-sized family business and a proud member of the Würth Group. With over 1,600 employees across 8 countries, we provide a wide range of IT solutions and services to medium-sized and large companies. Our expertise spans more than 20 years and includes SAP applications (ERP systems), e-business solutions, cloud services, IT security, and IT compliance services. As a company, we prioritize delivering exceptional service with the help of highly skilled and dedicated professionals. We offer numerous career development opportunities for both experienced professionals and graduates, as well as practical experience for students through internships and graduation projects.Role DescriptionThis is a full-time on-site position located in Berlin for skilled engineers specializing in Databricks and/or AWS Machine Learning (ML). The role involves designing, developing, and deploying ML models on Databricks or AWS platforms. You will collaborate with cross-functional teams to analyze data, implement pattern recognition techniques, develop algorithms, and apply advanced machine learning techniques like neural networks. Additionally, you will ensure the performance, security, and maintenance of deployed models and applications.QualificationsStrong knowledge of Pattern Recognition and Neural NetworksA solid foundation in Computer Science and proficiency in designing and implementing AlgorithmsProficiency in Statistics and an analytical mindset for data-driven decision-makingExperience working with Databricks and/or AWS Machine Learning servicesBachelor’s or master’s degree in Computer Science, Data Science, or a related fieldAbility to work collaboratively within cross-functional teamsStrong problem-solving skills and attention to detailFamiliarity with cloud platforms and their implementation is an advantageOffice can be in Berlin, Würzburg, Bad Mergentheim or Waldzimmern (Head Quarter)",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFk7VkqULJTJw/company-logo_100_100/company-logo_100_100/0/1676280823742/wrth_it_logo?e=2147483647&v=beta&t=Yhr5A2vODEkOc257e5u6LSqvrAwWxRA6jRY9q05IeJU",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Product Engineer (junior, m/f/d) – Berlin | Full-Time",
    "company": "Forgent",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-product-engineer-junior-m-f-d-%E2%80%93-berlin-full-time-at-forgent-4340580436",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHulGuX9dWjFQ/company-logo_100_100/B4DZeEKH1RHMAU-/0/1750268937120?e=2147483647&v=beta&t=FBe9njAQIG1B-r4RVQhBhGurBZ1Hs_rTHiwqg-QIE34",
    "description": "About the roleWe’re looking for an exceptional early-career Product Engineer — someone who combines strong coding foundations with deep curiosity, high ambition, and the drive to grow fast in a high-performance environment.You’ll work directly with the founding team to build and ship real products that integrate LLMs into production systems — building software that helps make democracy more efficient. This isn’t a typical “junior” role. You’ll take ownership early, work on technically challenging problems, and learn at startup speed. You will also have contact with mentors from leading AI companies (DeepMind, Anthropic, OpenAI) and Tech veterans (Unicorn Co CTOs) all while being exposed to frontier research (e.g. early-access partnerships).You’ll be a great fit ifYou’re a high-agency, full-stack problem solver.You can get to the core of any problem fast — flexing seamlessly from backend to frontend, from architecture discussions to product polish. You don’t need a playbook; you find a way to make things work, fast and well. You believe that a high velocity is the core to success.You’re an ambitious overachiever.You have a track record of excellence — whether through top-tier academic results, open-source impact, hackathon wins, or building impressive side projects. You hold yourself to a very high standard and thrive in elite, high-expectation environments.You’re a low-ego team player.You communicate clearly, take feedback well, and raise the bar for those around you. We believe a small team of A-players is exponentially greater than the sum of its parts.You’re deeply curious about AI systems and product engineering.You’re excited by the challenge of building real products with LLMs, and you learn and adapt quickly.What you’ll doBuild and ship features end-to-end using our stack:Frontend: Vite, TypeScript, React, TailwindBackend: Python (FastAPI, SQLAlchemy)Infra: AWSCollaborate closely with founders and users to translate real-world problems into elegant, reliable systems.Contribute to architectural decisions and gradually take ownership of well-scoped components.Iterate fast — improve functionality, refactor for performance, and maintain quality in a fast-moving environment.Leverage AI tools like Cursor, Claude Code, and others to supercharge your development workflow.This role isn’t for you ifYou want a predictable 9-to-5. We’re building ambitiously and fast. The work is intense and deeply rewarding - but not for those seeking comfort or routine.You need a highly structured environment. This is 0-to-1. You’ll be creating the structure, not following one.You think some work is “beneath you.” We all do what’s needed — from deep architectural decisions to debugging an edge-case API call.You prefer working fully remotely. We’re building an in-person culture because collaboration and speed are core to our DNA. Our team works together from our Berlin office three days a week, with flexibility for personal matters as and when needed.The perksWe want you to succeed and will give you everything you need to fully focus and commit to your work.Competitive compensation in the top 10%+ market ratesMeaningful equity in a fast-growing startupWork on cutting-edge technologyDirect access to top tier mentorshipTeam lunches, dinners, and other eventsYou should apply ifYou’ve spent multiple years coding (including in production environments — e.g., as Werkstudent, intern, or on side projects).You’ve shown strong signals of excellence: top academic record (e.g., Oxford, Cambridge, TUM, ETH, etc.), hackathon wins, selective scholarships, or open-source contributions.You want to work in an environment where craftsmanship, speed, and impact matter equally.You’re ready to learn fast, take ownership early, and become world-class.We encourage you to apply even if you do not believe you meet every single qualification.Not all strong candidates will meet every single qualification as listed. we urge you not to exclude yourself prematurely and to submit an application if you're interested in this work.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQHulGuX9dWjFQ/company-logo_100_100/B4DZeEKH1RHMAU-/0/1750268937120?e=2147483647&v=beta&t=FBe9njAQIG1B-r4RVQhBhGurBZ1Hs_rTHiwqg-QIE34",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Product Engineer (mwd)",
    "company": "Optimyze Consulting",
    "location": "Frankfurt Rhine-Main Metropolitan Area",
    "job_link": "https://de.linkedin.com/jobs/view/ai-product-engineer-mwd-at-optimyze-consulting-4335969643",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQFTreXn05QSeQ/company-logo_100_100/company-logo_100_100/0/1737378923384/optimyze_consulting_logo?e=2147483647&v=beta&t=Lyc7g5GLI2DGaIpT4d5M5tfORwikqNsVTlcxPuimJeA",
    "description": "UNSER KUNDE ISTUnser Kunde ist eine innovative Plattform für Customer-Service-Automation im E-Commerce. Mit über 100 Kund:innen setzt das Unternehmen auf Generative KI, AI Agents und Automatisierung, um den Kundenservice effizienter, skalierbar und zukunftsorientiert zu gestalten. Das Team verbindet Marketing, Tech und KI mit echter Leidenschaft und arbeitet datengetrieben sowie produktorientiert an der Weiterentwicklung der Plattform.STANDORTFrankfurt am Main, HybridSTACKNode.js, TypeScript, MongoDB, Redis (BullMQ, Pub/Sub, Cache), Docker, Kubernetes, Jest, Git/GitHub, LLMs, Prompt Engineering, RAG-Konzepte, Vektordatenbanken, CI/CD, DevOps, NestJS (optional), LangChain, PostgreSQL (optional), Azure (optional)GEHALT70.000 – 80.000 €SPRACHENDeutsch und EnglischANSTELLUNGSARTFestanstellungDEINE AUFGABENProdukt- & Funktionsentwicklung: Konzepte gemeinsam mit dem Führungsteam entwickeln, Features priorisieren, Testing & QA neuer Funktionen, iterative Verbesserung auf Basis von Nutzungsdaten und Kundenfeedback.AI Engineering: Entwicklung und Training von Agentic AI-Modellen, intelligente AI-Segmentierung von Tickets, Entwicklung von Action Assist Agenten, Integration externer Datenquellen (CRM, ERP, Shop-Systeme).Interface Development: Aufbau der Kernarchitektur der Inbox, Anbindung von Chat, Mail & Social Channels, Benutzer- und Rechteverwaltung, Analyse- & Reporting-Funktionen, Sicherheit & Compliance, System Performance & Skalierbarkeit.TECHNISCHE SKILLSDu arbeitest intensiv mit Node.js und TypeScript, gestaltest Datenmodelle in MongoDB, nutzt Redis für Messaging und Caching, orchestrierst Container via Docker und Kubernetes und schreibst Unit- und Integrationstests mit Jest. Du wendest Clean Code Development an, beherrschst Git/GitHub und hast Erfahrung mit LLMs, Prompt Engineering, RAG-Konzepten und Vektordatenbanken. Kenntnisse in DevOps, CI/CD und Observability runden dein Profil ab.DEIN PROFIL3–5 Jahre Berufserfahrung im Software- oder AI-EngineeringSehr gute Kenntnisse in Node.js, TypeScript, MongoDB, RedisErfahrung mit Containerisierung (Docker) und Orchestrierung (Kubernetes)Praxiswissen in Unit- & Integrationstests, Clean Code DevelopmentVerständnis von LLMs, Prompt Engineering, RAG und VektordatenbankenGrundkenntnisse in DevOps, CI/CD und ObservabilityNice-to-Have: NestJS, LangChain, PostgreSQL, Weaviate, Automated AI Evaluation Pipelines, Cloud-Infrastructure (Azure), Product AnalyticsWAS GEBOTEN WIRDModernes Büro im Herzen von SachsenhausenRemote-First-Kultur für maximale FlexibilitätSodexo-Gutscheine, kostenlose Getränke & Snacks, Mini-TischtennisAfter-Work-Events und Team-EventsArbeit in einem kreativen, ambitionierten Team auf AugenhöheDirekter Einfluss auf die Produktentwicklung im AI-SaaS Bereich",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQFTreXn05QSeQ/company-logo_100_100/company-logo_100_100/0/1737378923384/optimyze_consulting_logo?e=2147483647&v=beta&t=Lyc7g5GLI2DGaIpT4d5M5tfORwikqNsVTlcxPuimJeA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Artificial Intelligence Specialist (m/w/d) | Machine Learning Engineer",
    "company": "PartSpace",
    "location": "Nuremberg, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/artificial-intelligence-specialist-m-w-d-machine-learning-engineer-at-partspace-4340690768",
    "posted_date": "6 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQHZmzrpYlG5rw/company-logo_100_100/B56ZfGSY.1GQAU-/0/1751378399560/part_space_logo?e=2147483647&v=beta&t=XSyE6p1W07y4-cA8d1fIFeoh5GOGScSGxy9e7FQSSkA",
    "description": "Easy2Partsist einwachstumsstarkes, innovatives Unternehmen.Mit unserem ProduktPartSpacehaben wir eine klare Mission: Mit Künstlicher Intelligenz revolutionieren wir die Beschaffung von Bauteilen und Baugruppen. Dafür suchen wir motivierte Leute, die Lust haben, Verantwortung zu übernehmen und echte Veränderungen voranzutreiben.Bei uns bekommst du nicht nur Gestaltungsfreiraum und Mitspracherecht – du wirst Teil eines ambitionierten Teams, das täglich mit Leidenschaft daran arbeitet, unsere Kunden zu begeistern - und das ist unser Anspruch.Um unser weitere Wachstum gezielt zu unterstützen, suchen wir dich alsAI Spezialisten (m/w/d),der mit systemischem Denken und technischem Verständnis spezialisierte Tools wie CAD-Auswertungen, Simulationen, ERP-Systeme und Datenbanken sinnvoll mit LLM-basierten Anwendungen verbindet. In dieser Rolle gestaltest du keine Prompt-UIs oder Chatbots, sondern entwickelst durchdachte, robuste Informationsflüsse und Schnittstellen, die unseren Kunden echten Mehrwert bieten.Wenn du mit uns etwas bewegen willst, freuen wir uns,Dichkennenzulernen!AufgabenIdentifikation und Analyse von Dritt-Tools, deren Ergebnisse in LLM-Anwendungen eingebunden werden sollenKonzeption und Umsetzung robuster Schnittstellen und Pipelines zur Übergabe dieser Informationen an LLM-SystemeGestaltung von LLM-augmented Interfaces, bei denen Nutzende gezielt geführt statt gepromptet werdenExtraktion strukturierter Daten aus unstrukturiertem Text, z. B. mithilfe von LLM-gestützter NachverarbeitungZusammenarbeit mit Backend-, ML- und Produktteams, um vollständige End-to-End-Flows zu schaffenEvaluation der Antwortqualität anhand klar definierter Benchmarks, Nutzerfeedback und Usage-LoggingQualifikationDu hast ein abgeschlossenes technisches oder wirtschaftswissenschaftliches Studium im Bereich Informatik, Mathematik, Physik, Maschinenbau oder eine alternative AusbildungDu hast mehrjährige Erfahrung im Umgang mit Python und der Entwicklung neuer Machine Learning ModelleDu besitzt fundiertes Wissen im Umgang mit API's und DatenmodellierungErfahrungen mit OpenAI, LLama, LangChain oder ähnlichen Toolkits von VorteilDu verfügst über gute Deutschkenntnisse und wohnst in Nürnberg oder UmgebungBenefitsAttraktives Vergütungsmodell mit verschiedenen Bausteinen (Betriebliche Altersvorsorge, Weiterbildungen)Vergünstigungen über Corporate Benefits (Firmenfitness, Jobrad, uvm.)Hybrides Arbeiten ermöglicht flexibles Arbeiten aus dem Homeoffice sowie aus unserem BüroVerantwortung ab Tag 1 in einem ambitionierten Deep-Tech-UmfeldEin wachsendes Unternehmen mit viel Drive, Offenheit und TeamspiritWeiterbildungsmöglichkeiten und Raum für deine IdeenDu bist neugierig geworden?Dann bewirb dich jetzt!Be part of PartSpace.Lass uns gemeinsam wachsen!Wir freuen uns auf Dich.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQHZmzrpYlG5rw/company-logo_100_100/B56ZfGSY.1GQAU-/0/1751378399560/part_space_logo?e=2147483647&v=beta&t=XSyE6p1W07y4-cA8d1fIFeoh5GOGScSGxy9e7FQSSkA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning & Data Engineer (m/f/d) - AI for Autonomous Systems",
    "company": "Airbus Defence and Space",
    "location": "Stuttgart, Baden-Württemberg, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-data-engineer-m-f-d-ai-for-autonomous-systems-at-airbus-defence-and-space-4340527652",
    "posted_date": "14 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQHiVUv4_8Usqw/company-logo_100_100/company-logo_100_100/0/1631362043684/airbus_defence_and_space_logo?e=2147483647&v=beta&t=grtHyvLMSBtITdc8PsJzG5II76zPjAdFjb44rCGyzFA",
    "description": "Job Description:Airbus Defence and Space is looking multipleMachine Learning & Data Engineer (d/f/m) - AI for Autonomous SystemsTo shape the future of autonomous systems, Airbus is pooling its strengths in artificial intelligence and autonomy. For this purpose, we are establishing a new, agile Competence and Development Center at the traditional technology site of Tesat in Backnang. In this environment, which combines decades of expertise in space technology with the dynamism of a startup, we are developing the next generation of AI-powered defense and dual-use applications.As a Machine Learning & Data Engineer, you are at the heart of our AI development. You not only develop the intelligent algorithms that enable our systems to understand and act but also build the robust data infrastructure required to do so. Your work lays the entire foundation for a successful \"Data-Driven Defence.\"Your locationBacknang is a thriving town located just 30 kilometres northeast of Stuttgart, offering an ideal blend of urban convenience and natural beauty. With excellent transport connections, a strong local economy, and a high quality of life, it is an attractive place to work and live. The town boasts a rich industrial heritage and a growing tech and innovation scene, making it perfect for highly qualified professionals.Your BenefitsThe unique opportunity to shape the future of autonomous systems at a world-leading aerospace companyAn inspiring work environment that combines the innovative power of a startup with the expertise of an established technology siteA team of brilliant minds working together on a grand vision for Europe's technological sovereigntyAn attractive salary, flexible working hours, and excellent professional development opportunities within the Airbus groupYour Tasks And ResponsibilitiesModel Development: Design, implement, and train state-of-the-art machine learning models, particularly in the areas of computer vision and sensor fusionData Infrastructure: Conceptualize, build, and maintain scalable ETL/ELT data pipelines for processing multimodal sensor data. Data Platform Management: Build and optimize our central data platform (Data Lake/Warehouse) to ensure data availability and qualityOptimization & Validation: Continuously improve model performance and conduct rigorous validations under real and simulated conditionsMLOps & Integration: Collaborate closely with our engineers to seamlessly integrate models and data processes into our CI/CD pipelinesDesired Skills And QualificationsA completed Master's degree or PhD in Computer Science, Data Science, or a related fieldProven experience (approx. 4-8 years) in developing deep learning models as well as in data engineering (big data technologies, cloud platforms)Excellent programming skills in Python, SQL, and proficiency with common ML frameworks (e.g., PyTorch) and data tools (e.g., Spark, Databricks) -A proactive, solution-oriented work ethic and the ability to thrive in an agile, interdisciplinary teamFluent in German and EnglishPlease note that interviews likely will take place in December.Not a 100% match? No worries! Airbus supports your personal growth with customized development solutions.This job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth.Company:Airbus Defence and Space GmbHEmployment Type:PermanentExperience Level:ProfessionalJob Family:Qualification & OperabilityBy submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus.Airbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief.Airbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com .At Airbus, we support you to work, connect and collaborate more easily and flexibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking.#YESPOST",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQHiVUv4_8Usqw/company-logo_100_100/company-logo_100_100/0/1631362043684/airbus_defence_and_space_logo?e=2147483647&v=beta&t=grtHyvLMSBtITdc8PsJzG5II76zPjAdFjb44rCGyzFA",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Machine Learning Engineer (w/m/d)",
    "company": "WetterOnline GmbH",
    "location": "North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/machine-learning-engineer-w-m-d-at-wetteronline-gmbh-4307232658",
    "posted_date": "9 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFVTByKbhFU5Q/company-logo_100_100/company-logo_100_100/0/1630473464191/wetteronline_gmbh_logo?e=2147483647&v=beta&t=MKRjAvDte4qPgs7AVZQfDIxDidKYIofsjgds4zm8pUI",
    "description": "WO bist du!Du interessierst dich für den Einsatz von ML-Verfahren bei der Analyse und Verarbeitung von Wetterdaten mit Python, PyTorch, NumPy und OpenCV?Du möchtest dazu beitragen, die Visualisierung von Radar- und Satellitendaten mithilfe neuronaler Netze zu verbessern?Du möchtest dein Expertenwissen im Bereich Machine Learning gezielt einbringen und gemeinsam mit uns Projekte vorantreiben?Die Analyse und Verarbeitung großer Datenmengen fallen dir leicht?Wir haben den passenden Job für dich!Machine Learning Engineer(w/m/d)Wetter ist mehrRund 160 Mitarbeiter sorgen weltweit bei WetterOnline nicht nur für eine besonders präzise Wettervorhersage, sondern auch für ein gutes Arbeitsklima. Als Machine Learning Engineer (w/m/d) sorgst du mit deinem Know-how für den zielgerichteten Einsatz ML-Verfahren in der Objekterkennung, Bilderzeugung und -segmentierung von diversen Wetterdaten.Ob an einem unserer vier Standorte – Bonn, Bornheim, Coventry oder Miami – oder remote nach Absprache: Wir freuen uns auf deine Unterstützung!Um mit uns erfolgreich zu sein, brauchst du:Ein erfolgreich abgeschlossenes Studium in Informatik, Physik, Mathematik oder in einem vergleichbaren Studiengang.Fundierte Programmierkenntnisse in Python sowie Erfahrung in der performanten Verarbeitung großer Datenmengen.Erfahrung im Design und Training von ML-Modellen, insbesondere aus dem Bereich Computer Vision.Verständnis physikalischer Zusammenhänge und Interesse an deren datenbasierter Modellierung.Idealerweise Grundkenntnisse in C++ und erste Erfahrungen im High-Performance Computing.Folgende Entwicklungsumgebung erwartet dich bei uns:Betriebssystem: Ubuntu Linux mit eigenem BuildsystemEntwicklungsumgebung: Jupyter Notebook / JupyterLab, VSCodeTechnologien / Frameworks: Python, PyTorch, NumPy, OpenCV, C++, OpenMPVersionierung: Git/Gitlab.Was wir dir bieten:Interdisziplinäre Zusammenarbeit:Du bringst dich in bereichsübergreifende Projekte ein und arbeitest eng mit Kolleg*innen aus Entwicklung, Produkt, Marketing und weiteren Teams zusammen.Innovationsfreude und Gestaltungsfreiheit:Bei uns hast du die Möglichkeit, neue Ideen einzubringen und moderne Technologien aktiv mitzugestalten.Flexibel und lebensnah:Ob im Büro, remote oder hybrid – wir achten darauf, dass dein Job in Einklang mit deinem Alltag, deinen Bedürfnissen und deiner Lebensphase steht.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQFVTByKbhFU5Q/company-logo_100_100/company-logo_100_100/0/1630473464191/wetteronline_gmbh_logo?e=2147483647&v=beta&t=MKRjAvDte4qPgs7AVZQfDIxDidKYIofsjgds4zm8pUI",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Research Engineer",
    "company": "Enigma",
    "location": "North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-research-engineer-at-enigma-4322573737",
    "posted_date": "5 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "description": "AI Research Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDKAI Research Engineer / ResearcherYour MissionYou'll be a key contributor translating cutting-edge multimodal AI research into robust, production-grade agentic systems. By integrating vision models, large language models (LLMs), and advanced retrieval pipelines, your work will power real-world automation workflows and significantly boost productivity across complex domains.You'll be working at a well-funded, early-stage venture led by a technical founding team with deep expertise in AI, engineering, and startup execution. They value engineering rigor, scientific innovation, and building impactful products that solve real operational problems.What You’ll Do1. Agentic SystemsDesign, build, and refine agentic systems using frameworks like LangGraph.Integrate LLM-based reasoning with multimodal models and domain-specific tool use.Rapidly transition validated concepts into reliable, production-ready solutions.2. Data Retrieval and OrganizationBuild and optimize multimodal data retrieval pipelines.Work with structured and unstructured documents such as technical drawings, plans, and visual datasets.3. EvaluationOffline Evaluation: Develop high-quality benchmarks and use-case-specific evaluation metrics.Online Evaluation: Monitor live system performance and implement learnings for continual improvement.Must-Have Qualifications5+ years of experience building production-grade ML systems OR 2+ years in a top-tier AI startup focused on agentic or multimodal systems.Expert Python development skills.Experience with agentic frameworks like LangGraph, CrewAI, or Agents SDK.Demonstrated ability to translate complex AI research into scalable, real-world systems.Nice-to-Have QualificationsFamiliarity with technical or visual domain-specific data types (e.g., CAD, IFC, point clouds).Experience with vector search technologies (FAISS, Weaviate, Pinecone, etc.).Previous work in an early-stage startup with fast iteration cycles.Experience training or fine-tuning cutting-edge multimodal or vision-language models.AI Engineer | Multimodal AI | LLM | RAG | Retrieval Augmented Generation | LangGraph | CrewAI | Agents SDK",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFEqpNFpIoqsQ/company-logo_100_100/company-logo_100_100/0/1713259859209/enigma_rec_logo?e=2147483647&v=beta&t=VibBiUNUOjp9qLb0JtkvwS1SDXMUDq_aeMkuK_OjT78",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Machine Learning Engineer (AI Platform)",
    "company": "Smartly",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-machine-learning-engineer-ai-platform-at-smartly-4331138060",
    "posted_date": "7 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQFMy-MjKFr23A/company-logo_100_100/company-logo_100_100/0/1722960278885/smartly_io_logo?e=2147483647&v=beta&t=mqP32G87GFDpAPMYAVvU2Gwvpv6tA116sYnaMR2uXq4",
    "description": "We are looking for aSeniorMachine Learning Engineerto join theAI Platform Teamat Smartly! Our team works on helping marketers make the most of their ad creatives (images, video, text) and campaigns (product and performance data). We build and experiment with AI-based solutions across the media and creative workflows.You will have the opportunity to take ownership of and work on high impact projects.Join us in building high impact ML-based solutions to help our customers to build better and more effective advertising experiences for their consumers. If you’re a growth minded individual who has a passion for ML and the marketing space, this team is for you!As a Senior Machine Learning Engineer, you’ll:Build ML-based software systems that enable our users to craft great advertising experiences and campaignsWork with a large span of datasets from image to video to audio to text to structured performance data.Contribute to and strengthen Smartly’s MLOps + data platform. You’ll work alongside our stellar senior machine learning engineers, data scientists, and software engineers to enable us to productionize AI/ML applications more robustly and efficiently.Be a core contributor of our team and our ways of working to build high impact products. You’ll actively be involved in work planning, retrospectives, and overall team improvement.Impact the daily life of the staff of the hundreds of advertisers using SmartlyWork with our stakeholders - be them product, engineering, infrastructure - to ensure we meet customers where they are. As with most ML-related roles, being able to translate business/product needs to viable solutions is a must.Apply and enhance your soft skills through working closely with your colleagues and our customers. Doing knowledge shares, running productive meetings, and pair programming/debugging are just some ways we grow our soft skills.Keep up to date with the latest ML innovations, especially in areas such as generative AI, computer vision, natural language processing and explainability.What we are looking for:5+ years of experience developing and deploying production-quality software2+ years of experience delivering software services powered by machine learning2+ years of experience working with cloud infrastructure such as AWS or GCPFluent in Python; experience with C++ or Java is a plusHands-on experience with modern ML frameworks (e.g., PyTorch, TensorFlow)Knowledge of MLOps concepts and tools (e.g., MLflow, Kubeflow)Experience in feature engineering, model evaluation, diagnostics, and monitoringStrong foundation in linear algebra, statistics, and calculusExperience building scalable data pipelines for ML-based data processingExperience developing and maintaining services under SLAAnalytical mindset with a problem-solving approachPassion for solving customer challenges quickly while making thoughtful architectural decisionsAdaptability and resilience when facing new or ambiguous challengesStrong written and verbal communication skills in EnglishM.Sc. in a relevant field is preferredAbility and willingness to work in a hybrid capacity from our office 3 days a weekWhat We Offer You:Inclusive Culture: Join a team of over 750 Smartlies representing more than 60 nationalities across 24 locations in 13 countries, we foster a culture built on trust, transparency, and open feedback.Global Impact: Be part of a company making a global impact, directly influencing our customers and business growth.Wellbeing Focus: Enjoy generous healthcare packages, mental health services, and a healthy work-life balance with paid holidays and family leave.Total Rewards: Benefit from equity options, performance-based rewards, competitive compensation, and ample career development opportunities.Hybrid Workplace: We work in a hybrid model, balancing office and remote work, with the option to work abroad for up to 30 days.Smartly is committed to being the best place to work for growth-minded individuals to thrive - explore more in our Culture Handbook!About SmartlySmartly is the AI-powered advertising technology company transforming ad experiences for brands and their consumers. Our comprehensive advertising platform seamlessly integrates the capabilities of media, creative, and intelligence to power more than 800 billion impressions and generate more than 300 billion creatives annually, delivering tangible business outcomes for brands and advertisers.Smartly is the only company in the industry recognized as a Leader in The Forrester Wave: Creative Advertising Technologies with PwC validating the results it delivers for brands. We manage creative and media for 700+ brands worldwide and $6B in ad spend across the largest media platforms, including Facebook, Google, Instagram, Pinterest, Snap, and TikTok. Our end-to-end technology, unmatched access to media platforms and exceptional customer service help Fortune 500 brands to reach and engage consumers and learn what performs best.Smartly is a multinational and diverse team of 750+ Smartlies from 60+ nationalities, working in 13 countries. Together, we want to create and maintain an inclusive environment where everyone feels respected and heard. Our Diversity, Equity & Inclusion approach is at the heart of it.Visit Smartly to learn more.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQFMy-MjKFr23A/company-logo_100_100/company-logo_100_100/0/1722960278885/smartly_io_logo?e=2147483647&v=beta&t=mqP32G87GFDpAPMYAVvU2Gwvpv6tA116sYnaMR2uXq4",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior AI/ML Research Engineer (m/f/d)",
    "company": "Agile Robots SE",
    "location": "Greater Munich Metropolitan Area",
    "job_link": "https://de.linkedin.com/jobs/view/senior-ai-ml-research-engineer-m-f-d-at-agile-robots-se-4340611464",
    "posted_date": "3 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGIg6yD26xg9Q/company-logo_100_100/company-logo_100_100/0/1714988285777/agile_robots_ag_logo?e=2147483647&v=beta&t=uxqrBedDhkNOGzX55nSl87ombvAS_UM7PDxV2wgFDNs",
    "description": "About The RoleWe are seeking a Senior AI/ML Research Engineer to shape the next generation of intelligent robotic systems that combine perception, reasoning, and control.In this role, you will develop deep learning, reinforcement learning, and multi-modal foundation models — from LLMs and VLMs to Vision-Language-Action (VLA) systems — and bring them to life in robotic contexts.You will bridge the gap between cutting-edge AI research and high-performance engineering, ensuring that models trained on vast data and complex architectures can act effectively in the real world.If you thrive at the intersection of AI, robotics, and software architecture, and you’re passionate about building robots that understand, reason, and act intelligently, this role is for you.Your ResponsibilitiesMulti-Modal AI for Robotics Design and train foundation models that integrate vision, language, and actions for embodied intelligence. Adapt LLMs and VLMs for robotic control, planning, and interactive behavior — enabling robots to perceive, reason, and respond in natural, context-aware ways.Control and Manipulation Intelligence Develop AI-driven control policies for robotic manipulation, grasping, and motion planning. Combine reinforcement learning, imitation learning, and foundation model prompting to enable generalizable, transferable robotic behaviors.Optimization Implement efficient distributed training, parallelization, and hardware-aware optimizations (GPU/TPU).Software Engineering & System Integration Design modular, maintainable, and high-performance AI data processing, training and inference pipelines that can work at scale on large and diverse data. Ability to work across the full stack– taking ideas together with the team, from research and prototyping all the way to the final product.Evaluation, Benchmarking, and Experimentation Establish reproducible pipelines for training, evaluation, and deployment. Develop benchmarking frameworks to assess model generalization, safety, and task success.Technology Innovation Stay ahead of the latest advancements in AI, multi-modal learning, and robotics by innovating with new ideas and novel approaches. Translate academic breakthroughs into production-ready systems and contribute to papers, patents, or open-source initiatives.Essential SkillsMSc (and 6+ years of industry experience) or PhD (and 2+ years of industry experience; or combined equivalent experience) in Computer Science, Robotics, Electrical Engineering, AI, or related fieldStrong knowledge of machine learning, deep learning, and optimizationHands-on experience with transformer-based architectures, including LLMs, VLMs, and multi-modal modelsStrong expertise in Python and proficiency in C++Experience with PyTorch (and/or TensorFlow, JAX) and distributed training frameworksSolid software engineering foundation — architecture design, clean code, testing, and CI/CDStrong understanding of mathematics, statistics, and numerical optimizationExcellent analytical problem-solving skills and ability to translate research into robust implementationsExperience working in Linux environments and with containerization (Docker/Kubernetes)High curiosity and motivation to solve challenging tasks, deliver on time, and shape the forefront of robotics and AI.Beneficial SkillsFamiliarity with control theory and robotic middleware (ROS2, MoveIt, Gazebo, Isaac Sim)Experience with reinforcement learning, imitation learning, or embodied foundation modelsFamiliarity with VLA frameworks, robotic reasoning with LLMs, or multi-agent learningKnowledge of CUDA, Tensor RT, or hardware acceleration for real-time inferenceExperience with distributed training, simulation frameworks, and data-centric AI pipelinesUnderstanding of multi-modal fusion(e.g., vision, speech, tactile sensing)Contributions to academic publications, patents, or open-source projects in AI or roboticsWhat we offerA dynamic, highly qualified and diverse team in which your contributions are reflected directly in our products and used by our international customer baseFlat hierarchies and short decision-making processesExciting and varying tasks for our product portfolioExcellent working environment, modern office space, and flexible working hours with the option of mobile workingClose connection to academic research (EU and national projects) and a highly innovative companyApply for this jobAbout UsAgile Robots SEis an international high-tech company based in Munich, Germany with a production site in Kaufbeuren and more than 2300 employees worldwide. Our mission is to bridge the gap between artificial intelligence and robotics by developing systems that combine state-of-the-art force-moment-sensing and world-leading image-processing technology. This unique combination of technologies allows us to provide user-friendly and affordable robotic solutions that enable intelligent precision assembly.This is made possible by our employees, who bring out the best in each and every day with creativity and enthusiasm. Become part of this team and shape the future of robotics with us!We are proud of our diversity and welcome your application regardless of gender and sexual identity, nationality, ethnicity, religion, age, or disability.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQGIg6yD26xg9Q/company-logo_100_100/company-logo_100_100/0/1714988285777/agile_robots_ag_logo?e=2147483647&v=beta&t=uxqrBedDhkNOGzX55nSl87ombvAS_UM7PDxV2wgFDNs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Integration Engineer (d/f/m)",
    "company": "mobile.de",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-integration-engineer-d-f-m-at-mobile-de-4318080660",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGlYQzPl1EWMw/company-logo_100_100/B4DZkzVGTlJkAQ-/0/1757502793436/mobile_de_gmbh_logo?e=2147483647&v=beta&t=B8D-d51U6dsoSG8emhiHjUD-ifWy56X7JA8VysN6_gs",
    "description": "Founded in 1996, mobile.de disrupted the status quo of buying and selling cars as the first online vehicle marketplace.Today, we are Germany's largest vehicle marketplace with around 1.4 million listed cars, commercial vehicles, motorcycles and e-bikes. Both private customers and more than 40,000 registered vehicle dealers use the platform and benefit from 108 million customer visits per month. As a “one-stop shop”, mobile.de's offering includes financing and leasing solutions in addition to buying and selling - and we will not stop innovating. If you are driven by an eagerness to learn and a passion for collaboration then we should get to know each other.mobile.de is an equal opportunity employer and we value diversity. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability status.If you feel like you don’t meet all of the requirements for this role but are interested, please consider applying anyway. We strongly encourage people from historically excluded groups to apply.What We OfferMeaningful Work: We are a diverse, international, highly skilled and passionate team committed to a world where people share more and waste less. Every day you will have the opportunity to make a huge difference for our users, customers as well as shape the future.Embracing AI: We're at the forefront of integrating cutting-edge AI technologies into our operations. Being part of mobile.de you will work with and learn about AI tools, contributing to projects that leverage AI to enhance efficiency, improve customer experiences, and drive our mission forward. With an AI-first mindset, we foster a culture of continuous learning and experimentation, empowering our team to explore and apply AI in meaningful ways for the company and themselves.Growth and Development: We are a global organisation who truly believes in growing our people. To support this we offer lots of development and training opportunities and provide a budget for our team members.Connection and Inclusion: Our culture is the glue that holds us together. We believe in making meaningful connections and creating an inclusive atmosphere with lots of opportunities to connect both in your day to day work and through social team activities (online and offline).What You’ll Do & Who You AreThis AI Integration Engineer (d/f/m) role is your opportunity to shape how AI transforms the way our teams work at mobile.de. You’ll be part of our Product & Technology Team, reporting to the Director of Technology.You will be at the forefront of bringing the latest AI productivity tools and innovations into our business, with a strong focus on enabling non-technical functions (such as Sales, Customer Service, HR, Finance, Marketing, and Operations) to unlock efficiency and value through AI. You will not only advise but also drive and execute the end-to-end implementation of AI solutions, using existing technologies and building new integrations where necessary. Wherever possible, you will enable business functions to take ownership of the solutions after initial implementation. You will act as an AI Entrepreneur, proactively scouting trends, identifying opportunities, and driving measurable business impact.You will regularly collaborate with our GenAI Strategy Group, AI Tech Champions, and the Tech Leadership Team to ensure alignment, share learnings, and drive company-wide AI adoption.What You'll DoPartner with business stakeholders across non-technical domains to understand workflows, pain points, and potential for AI-driven improvement.Facilitate ideation workshops and discovery sessions to identify high-impact use cases.Drive the initial end-to-end implementation of AI integrations: from requirements gathering and tool selection, through technical implementation, rollout, and measurement. Where feasible, you will design solutions to be handed over to business functions for ongoing ownership.Implement solutions hands-on, leveraging existing tech and infrastructure (APIs, cloud platforms, automation tools) or building new components as needed.Ensure solutions are secure, compliant, and scalable, working closely with IT, Legal, and Data Privacy teams.Continuously scout and assess new AI technologies, trends, and best practices; introduce relevant innovations to the company.Create clear documentation, templates, and enablement materials to support business users in adopting and scaling AI solutions.Measure and communicate the impact of AI integrations (efficiency, adoption, ROI).Foster a culture of innovation and responsible AI adoption across the organization.Work closely with the GenAI Strategy Group, AI Tech Champions, and Tech Leadership Team to align on strategy and share best practices.Who You AreYou have a strong entrepreneurial mindset and passion for driving change with AI and you champion the use of AI in your own work.You thrive at the intersection of business and technology, with a proven track record of delivering end-to-end AI or automation solutions (not just advisory).You are a proactive self-starter who identifies opportunities and drives them to execution, iterating quickly.You are an excellent communicator and facilitator, able to bridge the gap between business stakeholders and technical teams.You are committed to continuous learning, staying up-to-date with the latest advancements, trends, and best practices in AI and productivity tooling.You are comfortable working independently with Legal, Privacy, and IT to ensure compliance and security.What You BringExperience integrating and scaling AI productivity tools (e.g., generative AI, automation platforms, SaaS solutions) in enterprise environments.Proficient with APIs, webhooks, and workflow automation tools (e.g., Google Workspace Automations, Slack Workflows, n8n, Zapier, Make, UiPath).Hands-on scripting and prototyping skills (e.g., Python, JavaScript, Google Apps Script) for automating processes and integrating AI tools.Familiarity with cloud platforms (ideally AWS and/or GCP) and collaboration/productivity tools.Solid understanding of AI-related compliance requirements, especially regarding the EU AI Act and AI privacy regulations in Germany; able to independently collaborate with Legal/Privacy as needed.Experience in solution design, technical requirements gathering, and implementation.Basic skills in data integration, transformation, and visualization (e.g., Google Sheets, Coda, simple dashboards).Strong documentation and enablement skills for non-technical users.Bonus:Experience with GenAI APIs (e.g., OpenAI, Google Vertex AI, AWS Bedrock, etc.), AI Tech Radar, or running pilots in regulated environments.BenefitsWorking at mobile.de comes with its perks! Enjoy the following benefits:Recharge with 28 days of paid time off.Stay mobile with a €50 monthly transportation/mobility allowance.Keep growing with a development budget and access to coaching.Family first - enjoy up to 12 (non-birth parent) or 20 (birth parent) weeks of fully paid parental leave.Learn anytime, anywhere with our online and offline library.Get rewarded with an attractive base salary and participation in our annual incentive plans.Work from anywhere - up to 20 days per year from wherever you feel most productive.Prioritize your well-being with a 24/7 Employee Assistance Programme for you and your immediate family.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQGlYQzPl1EWMw/company-logo_100_100/B4DZkzVGTlJkAQ-/0/1757502793436/mobile_de_gmbh_logo?e=2147483647&v=beta&t=B8D-d51U6dsoSG8emhiHjUD-ifWy56X7JA8VysN6_gs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist — MLOps & Analytics Platform (all genders)",
    "company": "meteocontrol",
    "location": "Augsburg, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-%E2%80%94-mlops-analytics-platform-all-genders-at-meteocontrol-4340820730",
    "posted_date": "5 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQH-0ovhi6nWZw/company-logo_100_100/company-logo_100_100/0/1630563066001/meteocontrol_logo?e=2147483647&v=beta&t=gCj2DdovKr2vvUw2v7mZygjYYPoODQT-H2lHhfwPunE",
    "description": "Das erwartet dich:Aufbau und Pflege von MLOps-Pipelines für Deployment, Monitoring und Versionierung von ML-ModellenEntwicklung skalierbarer, produktionsreifer Daten-Workflows (z. B. mit Apache Airflow, FastAPI)Mitwirkung beim Aufbau einer zentralen Analytics-Plattform für interne und externe NutzungErstellung modularer Komponenten, APIs und Dashboards für Analytics-ServicesImplementierung von Evaluierungs-Frameworks für Prognosen und SimulationenEntwicklung von ML-Modellen für Zeitreihenvorhersagen im Bereich erneuerbarer EnergienImplementierung automatisierter Anomalie- und MustererkennungDatengetriebene Lösungen für Performance-Analysen und Komponenten-GesundheitsbewertungenZusammenarbeit mit Software-Entwicklung, Produktmanagement und anderen TeamsMentoring von Junior-Teammitgliedern, Wissensaustausch und Code ReviewsDas bringst du mit:Bachelor- oder Masterabschluss in Data Science, Informatik, Mathematik, Physik oder ähnlichem2–4 Jahre Erfahrung in Data Science, Analytics oder Machine LearningSehr gute Python-Kenntnisse und Erfahrung mit mindestens einem ML-Framework (scikit-learn, TensorFlow, PyTorch)Erfahrung mit Datenpipelines, Workflow-Orchestrierung und Software-Development-Best-Practices (Versionierung, Testing, Dokumentation)Kenntnisse in SQL und relationalen DatenbankenTechnische Konzepte klar kommunizierenFließend Deutsch und EnglischFolgende Skills sind ein Plus:Erfahrung mit MLOps, Model Deployment und CI/CDKenntnisse in Zeitreihenanalyse, Forecasting und API-Entwicklung (FastAPI, Flask o. ä.)Erfahrung mit Docker, Kubernetes oder Cloud-Plattformen (AWS)Hintergrund in Energie-, Ingenieur- oder technischen ProjektenEngagement in Open-Source-Projekten oder technischen CommunitiesDarauf kannst du dich auch freuen:6 Gründe für deinen Einstieg bei meteocontrol (und mehr):Arbeiten für eine bessere Zukunft: Mit uns schaffst du eine bessere Zukunft für uns und alle Generationen nach unsMehr Flexibilität: Wir wissen, wie wichtig eine ausgewogene Work-Life-Balance ist. Deshalb bieten wir flexible Arbeitszeiten und ein Home-Office-Modell, das sich an deine Bedürfnisse anpasst.Urlaub, der wächst: Starte mit 30 Tagen Urlaub und deine Treue wird alle zwei Jahre mit einem zusätzlichen Urlaubstag belohnt – bis zu 35 Tage für noch mehr Auszeit!Kontinuierliches Lernen & Weiterentwicklung: Deine Weiterentwicklung liegt uns am Herzen – mit vielfältigen Angeboten unterstützen wir dich bei deiner Karriereplanung im Unternehmen.Geld on top: Neben deinem Gehalt erhältst du eine monatliche SpenditCard im Wert von 50 € sowie einen Zuschuss zum Deutschlandticket.Fitness: Trainiere mit unserem attraktiven Arbeitgeberzuschuss bei EGYM Wellpass, nimm an unserem JobRad Leasing teil oder power dich bei unserem jährlichen Firmenlauf aus.... viele weitere Gründe findest du auf unserer Karrierewebseite!Dein/e Ansprechpartner:in:Camilla GeismarTalent Acquisition Managerc.geismar@meteocontrol.comÜber unsWir von meteocontrol haben uns seit 1998 den erneuerbaren Energien verschrieben und sind einer der weltweit führenden Entwickler von unabhängigen Energiemanagementsystemen. Mit unseren ganzheitlichen Lösungen begleiten wir den gesamten Lebenszyklus von Energiesystemen. Von der Planung bis zur Inbetriebnahme unterstützen wir unsere Kund:innen als unabhängige technische Berater. Dafür brauchen wir ein Team von hochqualifizierten und motivierten Mitarbeiter:innen.Willst du Teil unseres vielfältigen Teams aus verschiedenen Fachbereichen werden und gemeinsam die Zukunft der erneuerbaren Energien vorantreiben?Mit Energie in die Zukunft. Wir freuen uns auf dich!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQH-0ovhi6nWZw/company-logo_100_100/company-logo_100_100/0/1630563066001/meteocontrol_logo?e=2147483647&v=beta&t=gCj2DdovKr2vvUw2v7mZygjYYPoODQT-H2lHhfwPunE",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientists (m/f/d) – Computer Vision",
    "company": "Deutsches Primatenzentrum GmbH",
    "location": "Göttingen, Lower Saxony, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientists-m-f-d-%E2%80%93-computer-vision-at-deutsches-primatenzentrum-gmbh-4335959636",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQExNC1wgZ_vRg/company-logo_100_100/company-logo_100_100/0/1659004365200/deutsches_primatenzentrum_gmbh_logo?e=2147483647&v=beta&t=GwPqS29k751jztI_-c83fQ8nKVjcqFPS2FBGcX3pLNw",
    "description": "The German Primate Center (DPZ) – Leibniz Institute for Primate Research in Göttingen is a world-renowned competence and reference center for research on and with primates. It pursues cutting-edge research on the physiology, behavior, welfare, and genetics of non-human primates. In addition to its laboratories in Goettingen, it manages five field stations in the tropics. The DPZ is one of 96 research and infrastructure facilities of the Leibniz Association.The DPZ’s Primate Data Science (PRIDAS) platform seeks to fill several positions forData Scientists (m/f/div) – Computer VisionThe position is suitable for part-time work.Our research with primates at the DPZ involves a combination of behavioral, physiological, imaging, and genetic data. Such data sets allow categorically novel questions and scientific approaches. The central task of PRIDAS is developing and providing data science services in support of the DPZ’s mission. This includes methods for data processing and analysis methods, as well as the management of highly complex multimodal data.This role will focus on providing, developing, evaluating, and productizing computer vision methods for the analysis of video and imaging data that are generated as part of the research at the DPZ.Candidates Ideally Fulfil The Following RequirementsMinimum of a Ph.D. (or exceptional M.Sc. plus 4 years experience) in computer science, data science, machine learning, mathematics, physics, or similar fieldExperience in Python and at least one deep learning framework, like PyTorch or TensorFlowExperience with analyzing large data sets or in advanced computer visionVery good communication skillsHigh motivation to support scientific research by implementing innovative data science approaches in a wide range of scientific questionsVery good English skills (written and spoken)We offer the opportunity to expand one’s skills in an attractive scientific environment with modern IT infrastructure, flexible and family-friendly working hours, and the opportunity to be directly involved in multiple research projects. We adhere to the Leibniz diversity standards and welcome applications from all qualified persons, regardless of their ethnic, cultural, social background, gender, religion, ideology, disability, age, or sexual identity. Registered disabled applicants with equal aptitude and qualifications will be given preferential consideration. We kindly ask you to indicate a disability in your application.Employment at the DPZ is based on the civil service rules and regulations. The salary scale is in accordance with TV-L, with VBL pension scheme.Please send your written application under the keyword “PRIDAS data scientist – computer vision” with a CV, motivation letter, and list of references via E-Mail to bewerbung@dpz.eu. Applications arriving until November 28th, 2025, are considered for this position.For more information about the DPZ, please visit http://www.dpz.eu or call 0551 3851-105.Further information on the Leibniz Association can be found at www.leibniz-gemeinschaft.de.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQExNC1wgZ_vRg/company-logo_100_100/company-logo_100_100/0/1659004365200/deutsches_primatenzentrum_gmbh_logo?e=2147483647&v=beta&t=GwPqS29k751jztI_-c83fQ8nKVjcqFPS2FBGcX3pLNw",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist (m/w/d) mit Schwerpunkt LLMOps Engineering",
    "company": "OneCareer GmbH",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-m-w-d-mit-schwerpunkt-llmops-engineering-at-onecareer-gmbh-4340288707",
    "posted_date": "12 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGAo2BhhdioYQ/company-logo_100_100/company-logo_100_100/0/1693670216065/onecareer_gmbh_logo?e=2147483647&v=beta&t=UWUT9FwltwaSdt4YFf-UbHPN3Asw3f5WW_YltjGRJ4I",
    "description": "Deine AufgabenAls Data Scientist (m/w/d) mit Schwerpunkt Large Language Models (LLMs) und MLOps bist du Teil unseres Core-Teams und arbeitest an der Weiterentwicklung unserer KI-gestützten Weiterbildungsplattform.Du konzipierst, entwickelst und betreibst skalierbare KI- und Datenlösungen, die es uns ermöglichen, Lerninhalte intelligent zu personalisieren und Prozesse zu automatisieren. Dabei verbindest du Datenanalyse, Softwareentwicklung und Machine Learning zu innovativen, produktionsreifen Anwendungen.Deine AufgabenEntwicklung und Optimierung von KI-Lösungen mit Fokus auf Large Language Models (OpenAI, Anthropic, Gemini u. a.)Aufbau, Orchestrierung und Automatisierung von Datenpipelines (z. B. mit Airflow, dbt oder Prefect)Entwicklung von Machine-Learning-Modellen und datengetriebenen Features in Python (pandas, NumPy, scikit-learn, LangChain, LMQL)Integration von LLMs in bestehende Softwarelösungen und ToolsMonitoring, Evaluierung und kontinuierliche Verbesserung von Modell-Performance und DatenqualitätNutzung von Cloud-Computing-Umgebungen (Google Cloud, BigQuery, Terraform) für Deployment, Skalierung und ObservabilityEnge Zusammenarbeit mit Product, Engineering und Bildungsteams zur Umsetzung datenbasierter EntscheidungenProjektmanagement und Verantwortung für komplette Entwicklungszyklen – von der Idee bis zum DeploymentDein ProfilAbgeschlossenes Studium in Informatik, Statistik, Mathematik, Data Science oder vergleichbare Qualifikation (auch Quereinsteiger willkommen)Mindestens 3 Jahre Berufserfahrung im Bereich Data Science, Machine Learning oder Data EngineeringSehr gute Programmierkenntnisse in Python und SQLErfahrung im Umgang mit LangChain, OpenAI-/Anthropic-APIs und gängigen ML-BibliothekenKenntnisse in Cloud-Infrastruktur (GCP), ETL-/ELT-Prozessen und Infrastructure as Code (Terraform)Erfahrung mit Versionierung (GitHub) und CI/CD-PipelinesAnalytisches Denken, strukturierte Arbeitsweise und hohe EigenverantwortungKommunikationsstärke und Fähigkeit, komplexe Sachverhalte verständlich zu vermittelnBegeisterung für neue Technologien, insbesondere im Bereich KI, LLMs und AutomatisierungWas dich auszeichnetDu denkst in Systemen: von Datenarchitektur über Modelloptimierung bis zur Skalierung in der CloudDu liebst es, Konzepte zu entwerfen und diese technisch umzusetzenDu bist lernfreudig, innovationsgetrieben und bringst neue Tools aktiv in den Entwicklungsprozess einDu arbeitest interdisziplinär, teilst Wissen im Team und unterstützt Kolleg:innen beim SkillaufbauWarum wir?Arbeit an zukunftsweisenden KI-Lösungen für die digitale WeiterbildungOffene, innovationsfreudige Unternehmenskultur mit GestaltungsspielraumAgile Arbeitsweise mit modernem Tech Stack und Fokus auf EigenverantwortungFlexible Arbeitszeiten, Remote-Setup und kontinuierliche WeiterbildungsmöglichkeitenHochwertige Apple Ausstattung und moderne Tools.100 € Benefitbudget pro Monat für Gutscheine, Urban Sports, Internetpauschale, Essenszuschuss und mehrUnbefristeter Arbeitsvertrag & 30 UrlaubstageTeamevents, die dir in Erinnerung bleiben werden!Eine langfristige Zusammenarbeit mit einem Team, das sich gegenseitig zur Bestleistung pushtÜber unsWir sind ein Bildungsträger für staatlich geförderte Online-Weiterbildungen - vor allem aber sind wir ein richtig gutes Team.Was du in der Arbeit tust, ist immer auch ein großer Teil davon, was du mit deinem Leben tust, denn Arbeitszeit ist Lebenszeit.Bei derOneCareer GmbHerlebst du jeden Tag, wie unglaublich es ist, wenn ein Team für ein gemeinsames Ziel brennt. Wir sind mehr als nur Kollegen – wir sind eine Einheit, die an das Gleiche glaubt und alles gibt. Das ist nicht nur ein Job, das ist eine Mission. Wer das nachempfinden kann, ist hier richtig. Hier entsteht etwas Großes, und das soll erst mal einer nachmachen!Wenn du gleich tickst, freuen wir uns, dich bald bei uns wilkommen zu heißen!",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGAo2BhhdioYQ/company-logo_100_100/company-logo_100_100/0/1693670216065/onecareer_gmbh_logo?e=2147483647&v=beta&t=UWUT9FwltwaSdt4YFf-UbHPN3Asw3f5WW_YltjGRJ4I",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data & AI Engineer",
    "company": "COCUS",
    "location": "Greater Dusseldorf Area",
    "job_link": "https://de.linkedin.com/jobs/view/data-ai-engineer-at-cocus-4292751577",
    "posted_date": "5 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFq2gs1oKNeEA/company-logo_100_100/company-logo_100_100/0/1634020508729/cocus_logo?e=2147483647&v=beta&t=1kqzLrpQE71i2o0xnV_IU5cngUagsNLYpd6-nrc9o70",
    "description": "COCUSis all about People! We are proud to deliver skilled services and products developed by great talent, with attitude and ambition to work in innovative IT solutions.We are partnering with worldwide industry leaders and always looking for the brightest minds to have fun working Digital & Cloud Solutions, Data Services, Connectivity and Security. Emotions are part of us, we encourage everyone to be what they truly are in our collaborative, informal, transparent, and open environment where everyone can contribute to the path to achieve our goals as a Team!What you will be doing:Designing & building ETL & AI utilitiesDesigning & implementing data models for relational and graph databasesGraph modelling, relationship extraction, queryingExploratory data analysis, prototyping, model evaluationPrompt design, vector store setup, inference service orchestrationCI/CD & Automation: Docker build, image tagging, automated testing via \"make\"Creating detailed documentation of the solutionAnalyzing various documents in different formats to use as a source for the knowledge graph solutionCollaborate with subject matter experts and data scientists in the team to design and build the solution.What we are looking for:Several years of experience as Data Engineer & Data Scientist, building tailored pipelines and analyzing complex data sets for various use casesExcellent knowledge of PythonPractical experience with local LLMs, including embedding engineeringAbility to integrate LLM services (OpenAI, local LLMs) and vector storesStrong background in Airflow DAG development and orchestration, other ETL tools would be a plusComfortable with Docker Compose and building custom imagesVery good hands-on knowledge of PostgreSQL, Neo4j & Cypher, Redis, and CeleryFamiliar with Jupyter for rapid experimentationProven track record of secure data handling (encryption, git-secret) and CI/CD pipeline setupExcellent documentation skillsExcellent communication skillsFluent German and English, excellent written and verbalMaster's degree in applied mathematics and computer scienceWhat will be a plus:Practical experience (implemented use cases) with RAG﻿Knowledge of various ETL/ELT tools like dbt, NiFi, Knime etc Practical experience with ML tools (real business use cases)What we can offer you:Informal and friendly culture that rewards innovation and teamwork with global projects in a fast-paced environment, having a direct impact on the solution/applicationPermanent work contract and salary according to experienceTwo pet friendly offices in GermanyCompany phone for personal useEnjoy up to 30 vacation daysEmployee Assistance ProgramCompany ticket for public transportation and parking spots availableBenefit from a company-financed pension planTake advantage of a leasing option for bikes and shop for personal use, with company contributionReferral program with bonus - invite a friend to join the team.Interested?Apply through the link: https://talent.sage.hr/jobs/07ee523e-4996-43e5-8fb8-efd6eb43401c",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4D0BAQFq2gs1oKNeEA/company-logo_100_100/company-logo_100_100/0/1634020508729/cocus_logo?e=2147483647&v=beta&t=1kqzLrpQE71i2o0xnV_IU5cngUagsNLYpd6-nrc9o70",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist als Wissenschaftlicher Mitarbeiter (m/w/d)- Bundeskriminalamt",
    "company": "Bundeskriminalamt",
    "location": "Wiesbaden, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-als-wissenschaftlicher-mitarbeiter-m-w-d-bundeskriminalamt-at-bundeskriminalamt-4336112782",
    "posted_date": "1 hour ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQEimpph7Hbuzw/company-logo_100_100/B4EZk.A1wfGcAU-/0/1757682032335?e=2147483647&v=beta&t=lqGk0yys27SfWQBaytXKpXDUYhLdLwz-K7uz60cxDB4",
    "description": "Wissenschaftliche Mitarbeit (Künstliche Intelligenz/Data Science) im Bereich kriminaltechnische Biometrie (DNA-Analytik) (w/m/d)Personenkreis: Tarifbeschäftigte und BeamteArbeitsort: WiesbadenArbeitsumfang: Vollzeit/TeilzeitVergütung: EG 14 TV EntgO Bund mit dem Ziel der Verbeamtung bzw. A13h / A14 BBesG (Bundesbesoldungsgesetz)Bewerbungsfrist: 13.12.2025Dienstbeginn: zum nächstmöglichen ZeitpunktJoblevel: FachkraftBerufsgruppe: Wissenschaft und Forschung2. Berufsgruppe: IT und TechnikKennziffer: T-2025-85Unterstützen Sie uns als Wissenschaftliche Mitarbeiterin/Wissenschaftlicher Mitarbeiter (w/m/d) im Bereich Biometrie im Kriminaltechnischen Institut des Bundeskriminalamtes, dort hauptsächlich im Fachbereich DNA-Analytik. Wir führen wissenschaftliche Untersuchungen mit dem Ziel der Ermittlungsunterstützung sowie der Erstellung kriminaltechnischer Gutachten für Strafverfahren durch. So tragen wir zur Kriminalitätsbekämpfung, aber auch zur Prävention von Straftaten durch Anwendung wissenschaftlicher Methoden bei. Werden Sie Teil eines wissenschaftlichen Teams und erbringen Dienstleistungen, die bei der Aufklärung von Verbrechen im nationalen und internationalen Kontext unterstützen.Machen auch Sie das Richtige und bewerben Sie sich jetzt!AufgabenVerantwortliche Planung, Konzeption, Entwicklung, Koordinierung und Überwachung von KI-Lösungen in der kriminaltechnischen Biometrie mit Schwerpunkt DNA-Analytik, insbesondere:Analyse und Bewertung bestehender Abläufe sowie Ableitung von Automatisierungs- und Optimierungspotenzialen durch KI und datengetriebene ToolsUmsetzung von Piloten und Begleitung der nachhaltigen Implementierung in der OrganisationSchnittstellenmanagement zwischen IT, Fachbereichen und Management; verständliche Kommunikation von Nutzen und Funktionsweise der KI-AnwendungenÜbernahme von Teilaufgaben beim Aufbau eines Netzwerks für KI-Kompetenzen und bedarfsgerechte Schulung von Mitarbeitenden der FachgruppeDie Bereitschaft zur flexiblen Arbeitszeitgestaltung wird aus folgenden Gründen vorausgesetzt:Dienstreisen, im Rahmen von nationaler und internationaler Zusammenarbeitplanbargelegentlich: ca. 3 - 5 Mal pro JahrLänge der Dienstreisen in der Regel bis zu einer WocheInland und AuslandPräsenz zu besonderen Anlässen im Zusammenhang mit Tagungen/KonferenzenDiese Rahmenbedingungen sind dynamisch. Veränderungen im Zusammenhang mit der Aufgabenwahrnehmung können Anpassungen oder Verschiebungen erforderlich machen.Unsere Erwartungen (zwingend erforderlich)Abgeschlossenes wissenschaftliches Hochschulstudium (universitäres Diplom, Magister oder Master) im Bereich angewandte Informatik, Künstliche Intelligenz, Data Science oder ein vergleichbarer technik- und datenorientierter Studiengang mit Schwerpunkt KI oder maschinelles LernenEine mindestens 2-jährige Erfahrung in der Entwicklung und Anwendung von KI-Methodiken, maschinellem Lernen, Datenanalyse und aktuell gängigen Tools und Frameworks (z. B. Python, TensorFlow, PyTorch, Scikit, Keras)Eine mindestens 2-jährige Praxiserfahrung in der Konzeption und/oder Implementierung von KI-Projekten bzw. datengetriebenen AnwendungenOn TopSie bringen ein Grundverständnis für rechtliche Vorgaben (insbesondere EU AI Act), Datenschutz, Risikoabschätzung und ethische Implikationen beim Einsatz von KI-Lösungen mit.Sie bringen ein Grundverständnis für Geschäftsprozesse und deren Transformation durch neue Technologien mit.Sie verfügen über die Fähigkeit des analytischen Denkens sowie ein hohes Maß an Eigeninitiative.Sie verfügen über eine hohe Kommunikationskompetenz sowie Begeisterungs- und Überzeugungsfähigkeit bei der Vermittlung von KI-Potenzialen.Sie bringen die Bereitschaft zu kontinuierlichem Lernen und interdisziplinärer Zusammenarbeit mit.Sie haben eine sehr gute mündliche und schriftliche Ausdrucksweise, verfügen über gute kognitive und organisatorische Fähigkeiten, sind belastbar sowie selbstständig und flexibel bei der Aufgabenerledigung.Das bieten wir – Benefits für MitarbeitendeEin gutes Gefühl: sinnstiftender Job in einer oberen Bundesbehörde mit spannenden, vielseitigen und herausfordernden AufgabenWork-Life-Balance: 30 Tage Urlaub, Überstundenausgleich, 24. und 31.12. arbeitsfrei, flexible Arbeitszeitgestaltung, Teilzeit in verschiedenen Modellen und die Möglichkeit zum mobilen ArbeitenVergütung: Entgeltgruppe 14 TV EntgO Bund, Eingruppierung nach tariflichen Bestimmungen TV EntgO Bund und vorliegenden persönlichen Voraussetzungen, Planstelle A 13/14 BBesO hinterlegt, Verbeamtung bei Vorliegen der beamten- und laufbahnrechtlichen Voraussetzungen; Abordnung von Beamtinnen und Beamten mit dem Ziel der Versetzung ins BKA, BKA-Zulage",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQEimpph7Hbuzw/company-logo_100_100/B4EZk.A1wfGcAU-/0/1757682032335?e=2147483647&v=beta&t=lqGk0yys27SfWQBaytXKpXDUYhLdLwz-K7uz60cxDB4",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior Microsoft Azure AI Engineer (m/w/d)",
    "company": "Devoteam | Microsoft Partner",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-microsoft-azure-ai-engineer-m-w-d-at-devoteam-microsoft-partner-4317928859",
    "posted_date": "6 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "description": "Do you want to not only experience but actively shape the uniqueDNAofMicrosoft? ThenDevoteam MCloudis the right place for you!Our core business is cloud-based enterprise customer projects, where we drive the most modern Microsoft technologies.The building blocks that distinguish us:2,100 Microsoft certifications completed in 20221,000 Microsoft experts in EMEA600 customers25 years of industry experience18 Advanced Specializations - including \"Azure Virtual Desktop Advanced Specialization\" and \"Modernization of Web Applications to Microsoft Azure\"6 Solution Partner Designations3 MVPsImagine being part of one of the most successful IT companies in Europe, leveraging the latest technologies with its customers to elevate them to the next level. Apply now atDevoteam M Cloud!#Creative Tech For Better ChangeYour Benefits:In addition to our revolutionary New Way of Work culture, you'll enjoy:Modern offices in prime locations in Munich, Frankfurt, and StuttgartFlexible remote or hybrid working with the option to customize your working hours and locations to your individual needsOur Devoteam Academy offers a wide range of certified trainings and language coursesInternational development opportunities to boost your career at DevoteamGaming lounge for your creative break between meetings and callsGet-together parties and team events for regular exchange and fun with your colleaguesEmployee referral bonuses for attracting new employeesModern IT equipment - choose the product that suits you best from a variety of optionsCorporate benefits with a large selection of numerous offers for almost every area\"Jobrad\" (company bike) offer with attractive tax advantages for youCompany pension scheme, direct insurance, and capital-forming benefits are available to you as additional servicesIntegration Day including mentoring programs for your perfect start at DevoteamJob DescriptionAI Solution Development: Design and implement end-to-end AI solutions on Azure. This includes developing machine learning models (e.g. predictive algorithms, classification, anomaly detection) and integrating them into cloud applications. You will write code (primarily in Python) to build and train models, leveraging Azure Machine Learning, Azure Databricks, or custom frameworks as needed.Build and deploy intelligent applications using Azure AI Foundry, leveraging prompt orchestration, grounding with Azure AI Search, and agent orchestration features for enterprise-scale GenAI use cases. Independently implement GenAI workflows using Foundry.Generative AI & LLMs: Play a key role in developing Generative AI solutions for clients. Experiment with and implement large language model (LLM) based applications using Azure OpenAI Service and frameworks like LangChain for building conversational agents or Retrieval-Augmented Generation (RAG) pipelines. For example, you might build a chatbot that uses an LLM with enterprise data or create a summarization service for insurance documents. Ensure prompt engineering and fine-tuning are done in a robust, secure manner.Azure AI Services Integration: Utilize Azure Cognitive Services (e.g. for vision, speech, language) and Azure AI services to speed up solution development. For instance, integrate Azure Cognitive Search for semantic search in a knowledge retrieval solution, or use Form Recognizer in a document processing pipeline. Combine these services with custom ML where appropriate to meet client requirements.MLOps and Deployment: Take ownership of deploying and operationalizing ML models. You will containerize models or use Azure ML endpoints, set up CI/CD pipelines (using Azure DevOps or GitHub Actions) for automated model training and deployment, and implement monitoring for model performance drift. Ensure that the AI solutions can scale in production and adhere to DevOps best practices for reliability.Data Pipeline Collaboration: Work closely with Data Engineers to ensure the data needed for AI models is available, reliable, and well-prepared. Contribute to data pipeline design for ML – e.g., help define feature engineering processes or streaming data ingestion for real-time inference – so that models can be trained on and serve high-quality data.Cross-Functional Collaboration: Collaborate with Solution Architects (like the ML/AI Architect) to translate high-level architectural designs into concrete implementation tasks. Work alongside other specialists such as data scientists and cloud engineers to build secure, end-to-end AI solutions that integrate into the client’s ecosystem. This includes participating in code reviews, knowledge sharing, and troubleshooting sessions within the team.Client Support & Iteration: Support client teams in adopting and understanding the AI solutions. This could involve preparing technical documentation, demoing functionalities to stakeholders, and iterating on models based on user feedback or changing requirements. Ensure that AI solutions meet responsible AI guidelines and data privacy/security standards as expected by enterprise clients.QualificationsExperience: 5+ years of hands-on experience in AI/ML engineering or data science roles, with a focus on building and deploying solutions (not just research or academic projects). You should have taken multiple ML projects through the full lifecycle from data preparation to production deployment.Language Skills: fluent in german and englishAzure & Data Skills: Strong experience with the Azure AI/Data ecosystem. This includes proficiency with Azure Machine Learning (for running experiments, managing models), familiarity with Azure Databricks or Spark for big data processing, and usage of Azure data services like Data Factory, Azure Data Lake, or Synapse Analytics. Experience integrating Azure Cognitive Services or Azure OpenAI into applications is a big plus.Experience using Azure AI Foundry for building LLM-based applications or orchestrating AI workflows. Understanding of Foundry templates, grounding data sources, and integration with Azure OpenAI and Azure Search is expected.ML & Programming: Proficiency in Python and common ML/DL libraries (pandas, scikit-learn, TensorFlow or PyTorch, etc.). Ability to write clean, efficient code for data processing and model training. Experience with NLP or computer vision techniques is helpful. You should also be comfortable with Git and collaborative coding practices.MLOps Knowledge: Practical understanding of MLOps and model lifecycle management. Experience setting up automated training pipelines, model versioning, CI/CD for ML, and using tools like MLflow for tracking experiments. Knowledge of Docker and Kubernetes (e.g., Azure Kubernetes Service) for deploying ML services is advantageous.Generative AI & LLMs: Exposure to Large Language Models or other generative AI technologies. You should understand how to use pre-trained models (like GPT-based models) and fine-tune or prompt them for specific tasks. Direct experience with libraries/frameworks for LLMs (LangChain, Hugging Face Transformers, etc.) or vector databases for RAG is a strong plus, as many of our projects explore these emerging areas.Problem-Solving & Communication: Strong problem-solving skills with the ability to debug complex issues in data pipelines or model performance. Equally important are good communication skills – you can explain technical work to team members and occasionally to client technical staff. You work well in a team and can mentor more junior colleagues if they join (even though we currently hire only experienced professionals).Certifications: Azure and data/AI certifications are highly regarded. Ideally, you hold or are willing to obtain Microsoft Certified: Azure AI Engineer Associate (AI-102) certification, which demonstrates ability to design and implement Azure AI solutions. Other relevant certs like Azure Data Scientist (DP-100) or Databricks Generative AI Engineer certification are a bonus. Devoteam will support you with time and resources to achieve certifications.Education: Bachelor’s degree in Computer Science, Engineering, or related field (or equivalent work experience). A master’s in AI/Data Science is a plus but not required.Additional InformationYou will be part of a collaborative, remote-friendly team that values continuous learning anddelivering impact through modern cloud-native data solutions.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQECehpqOflUeg/company-logo_100_100/company-logo_100_100/0/1630667901230/devoteam_m_cloud_logo?e=2147483647&v=beta&t=fmGzTNisIURe3vcTKOOJaiEbPame6Xpxeo3fHZyo1NM",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist (m/w/d) bei der Sparkasse KölnBonn",
    "company": "Sparkasse KölnBonn",
    "location": "Cologne, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-m-w-d-bei-der-sparkasse-k%C3%B6lnbonn-at-sparkasse-k%C3%B6lnbonn-4331149045",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGGT6i77remtg/company-logo_100_100/B4EZiN30Q5HEAQ-/0/1754726876836?e=2147483647&v=beta&t=_yk7FNErF6Z82HnTVZY6kfpVjZi553SeOWwksgATFXw",
    "description": "Starte durch – mit deinem Job bei der Sparkasse KölnBonn.Als Sparkasse arbeiten wir in der Region und für die Region. Wir gehören zu Köln und Bonn, wie die Menschen, die hier leben. Und genau das macht auch unsere Kultur aus. Wir kümmern uns nicht nur um die Finanzen unserer Kundinnen und Kunden, sondern engagieren uns auch für gemeinnützige Projekte, soziale Initiativen und echte Vielfalt.Rund 3.500 Kolleginnen und Kollegen sind bereits Teil unseres Teams und gestalten mit ihrer Arbeit jeden Tag die Zukunft der Sparkasse KölnBonn und unserer Städte mit.Zukunft braucht Verantwortung – und dich!Als traditionsreiche Arbeitgeberin sind wir fest in der Region verankert. Wir gestalten mit Weitblick – transparent, fair und zukunftssicher.Werde Data Scientist (m/w/d) bei der Sparkasse KölnBonn – am Standort Köln.Entwickle mit uns die Anwendungsfälle von morgen! Als \"Gründungsmitglied\" der ersten Stunde sind wir Teil des kollaborativen Analyse Labors der Sparkassenorganisation, in dem wir auf einer gemeinsamen technischen Plattform mit anderen Großsparkassen und der S-Rating Risikosysteme GmbH (SR) arbeiten. Wir planen, konzipieren und entwickeln gemeinsam mit unseren Fachbereichen maßgeschneiderte Big-Data und Machine Learning Lösungen zur Unterstützung unseres vertrieblichen Erfolgs und unserer betrieblichen Optimierung.Deine Aufgaben – damit begeistern wir dichIm kollaborativen Analyse-Labor der Sparkassenfinanzgruppe arbeitest du an der Entwicklung weiterer Anwendungsfälle von Data Analytics für unsere Sparkasse, insbesondere in den Bereichen Customer (Journey) Experience, Zielgruppenanalysen und Process Mining.Du setzt Impulse für die Erschließung neuer Datenquellen (z.B. dem Online-Kunden-Verhalten) und den Aufbau von Business Intelligence Funktionen für die datenbasierte Entscheidungsunterstützung.Als Mitglied des kollaborativen Teams übernimmst du Aufgabenpakete und setzt sie gemeinsam mit den anderen Sparkassen und der Sparkassen Rating um.Du planst und leitest Projekte zum Themengebiet Advanced Analytics eigenverantwortlich.Ein Job – viele Extras#work-life-balance – du profitierst von flexiblen Arbeitszeitmodellen mit Arbeitszeiterfassung und Gleitzeit sowie der Möglichkeit, auch mobil zu arbeiten. 32 Urlaubstage und die Option auf weitere, zusätzliche Urlaubstage geben dir zudem ausreichend Zeit, dein Leben auch außerhalb des Jobs zu genießen.#zusammenhalt – wir leben eine offene und wertschätzende Unternehmenskultur, in der selbstständiges Arbeiten und die kompetente Unterstützung eines dynamischen Teams Hand in Hand gehen.#karriere – dich erwarten eine fundierte Einarbeitung sowie vielfältige Entwicklungsmöglichkeiten zur persönlichen, fachlichen und methodischen Weiterbildung.#haltung – als Unterzeichnerin der Charta der Vielfalt setzen wir uns für Diversität und Chancengerechtigkeit ein – für alle Beschäftigten und Managementebenen.#vergütung – neben einem unbefristeten Arbeitsvertrag sowie betrieblicher Altersvorsorge und vermögenswirksamen Leistungen erhältst du eine attraktive Vergütung gemäß TVöD mit bis zu 14 Gehältern.#zusatzleistungen – wir bieten dir zudem ein Jobticket, ein umfangreiches Gesundheitsmanagement, starke Mitarbeiterkonditionen bzw. -rabatte, unvergessliche Events und vieles mehr.Dein Profil – damit begeisterst du unsDu hast einen Studienabschluss in Natur- bzw. Wirtschaftswissenschaften mit quantitativem Schwerpunkt oder eine vergleichbare Qualifikation.Du verfügst über mehrjährige Berufserfahrung und ein fundiertes Fachwissen mit etablierten Data Mining-Methoden (Predictive Modeling, Classification, Random Forests etc.) sowie gute Kenntnisse in der Python Programmierung.Mit deinen guten konzeptionellen und analytischen Fähigkeiten hast du Freude daran, aus großen Datenmengen analytische Zusammenhänge zu identifizieren, Handlungsempfehlungen abzuleiten und diese verständlich sowie adressatengerecht zu kommunizieren.Du bist versiert im Umgang mit Analytics-Software (insbesondere Python, Git und Power BI) und auch der Umgang mit Datenbanken ist für Dich selbstverständlich.Mehr Vielfalt. Mehr Chancen. Mehr du.In unserer Kultur setzen wir auf Chancengleichheit und Vielfalt. Unabhängig von Geschlecht, Herkunft oder Beeinträchtigungen fördern wir die Potenzialentfaltung aller Mitarbeitenden. Teilzeit, Job-Sharing oder individuelle Anpassungen? Lass uns darüber sprechen! Gestalten wir gemeinsam Lösungen für eine bunte und inklusive Arbeitswelt, mit Fokus auf Frauen in Fach- und Führungskarrieren.Bereit für den nächsten Schritt?Lust auf einen Job bei einer mehrfach ausgezeichneten Arbeitgeberin? Dann sollten wir uns unbedingt kennenlernen. Bewirb dich jetzt online per Klick auf den untenstehenden Button als Data Scientist bei der Sparkasse KölnBonn.Wir freuen uns darauf, dich kennenzulernen.Du bist neugierig geworden, hast aber noch Fragen?Weitere Informationen findest du unter karriere.sparkasse-koelnbonn.de oder telefonisch bei Jacqueline Schmidt, 0221-226 52670, jacqueline.schmidt@sparkasse-koelnbonn.de.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGGT6i77remtg/company-logo_100_100/B4EZiN30Q5HEAQ-/0/1754726876836?e=2147483647&v=beta&t=_yk7FNErF6Z82HnTVZY6kfpVjZi553SeOWwksgATFXw",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Software Engineer",
    "company": "Oliver Bernard",
    "location": "Greater Munich Metropolitan Area",
    "job_link": "https://de.linkedin.com/jobs/view/software-engineer-at-oliver-bernard-4340429558",
    "posted_date": "11 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGWWcN6dIdUXA/company-logo_100_100/company-logo_100_100/0/1730212033840/oliverbernard_logo?e=2147483647&v=beta&t=cO__7DGpKFud_XCYfvz_D6rejF_HJC7xaIe_O7g3gTw",
    "description": "Founding Engineer | Agentic LLMs, Python, Next.JSLocation: Munich (Hybrid, 4–5 days on-site)Compensation: €80,000–€110,000 + EquityLanguage: German B2/C1 requiredOB’s is partnered with an exciting start-up that is redefining how complex industrial machines are sold. They are building AI-driven technical sales tools that automate the process of selling large manufacturing equipment.The Team:A small, fast-moving team (ex-Palantir, ex-Google), backed by Tier 1 investors, working directly with leading manufacturers. They are early-stage, nearly profitable, and preparing for its next major funding round.You will:Design and build new software features end-to-end.Develop and deploy AI systems that integrate into real industrial workflows using Agentic LLMs.Work across the stack from backend (Python) to frontend (Next.js) interfaces.Collaborate directly with customers and visit manufacturing sites to understand their needs.RequirementsGerman language proficiency (B2/C1)Experience with both frontend and backend systemsRelevant degree from a leading technical university (LMU, KIT, RWTH, TUM or equivalent)Founding Engineer | Agentic LLMs, Python, Next.JS",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGWWcN6dIdUXA/company-logo_100_100/company-logo_100_100/0/1730212033840/oliverbernard_logo?e=2147483647&v=beta&t=cO__7DGpKFud_XCYfvz_D6rejF_HJC7xaIe_O7g3gTw",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist / AI Consultant (m/w/d)",
    "company": "IBM",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-ai-consultant-m-w-d-at-ibm-4340670572",
    "posted_date": "6 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.You will work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.Curiosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you will be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground-breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.In this role, you will work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver deep technical and industry expertise to a wide range of public and private sector clients around the world. Our delivery centers offer our clients locally based skills and technical expertise to drive innovation and adoption of new technology.Your Role And ResponsibilitiesAs a Data Scientist / AI Consultant at IBM, you will work to solve business problems using leading edge and open-source tools such as Python, R, and TensorFlow, combined with IBM tools and our AI application suites. You will prepare, analyze, and understand data to deliver insights, predict emerging trends, and provide recommendations to stakeholders. In your role, you may be responsible for:Analysis, preparation and management of complex data sourcesImplementing and validating predictive and prescriptive models and creating and maintaining statistical models with a focus on big data & incorporating machine learning techniques in your projectsWriting programs to cleanse and integrate data in an efficient and reusable mannerDevelopment of scalable and robust data and machine learning pipelinesApplication of traditional machine learning algorithms as well as modern deep learning approaches (such as GenAI)Implementation, integration and monitoring of AI / ML modelsWorking in an agile, collaborative environment, partnering with other scientists, engineers, consultants and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behavioursDocumentation and communication with internal and external clients (e.g. business and IT departments) and stakeholders to understand and define business needs and appropriate modelling techniques to provide analytical solutions as well as presentation of proposed solutions and results.Evaluating modelling results and communicating the results to technical and non-technical audiences.Preferred EducationMaster's DegreeRequired Technical And Professional ExpertiseStrong fundamentals in Mathematics and/or Computer Science (algorithms)Proven knowledge and experience inAI and ML frameworks (e.g. PyTorch)GenAI and agentic AI architectures (RAG, agentic patterns, etc.)AI governance and monitoringStrong ability to communicate with and coach senior executives, translating technical insights into business strategyYou have strong technical and analytical abilities, a knack for driving impact and growth, and experience with programming/scripting in Python.You're great at solving problems by looking at things differently, debugging, troubleshooting, and designing & implementing solutions to complex technical issues.You thrive on teamwork and have excellent verbal and written communication skills.Excellent verbal and written German language skills (C1 level)Preferred Technical And Professional ExperienceAzure platform expertise, ideally with Azure Foundry and related AI/ML servicesExperience in DevOps and MLOps, including CI/CD pipelines, ML lifecycle management, and deploymentBackground in the chemical or process industry, with awareness of domain-specific challenges and dataUnderstanding of AI governance, safety, and ethical considerationsExperience in consulting or client-facing roles with a focus on value realization through AIDemonstrated ability to scale AI solutions from prototype to production and integrate across enterprise systems",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Founding AI Engineer",
    "company": "Omnora",
    "location": "Germany",
    "job_link": "https://de.linkedin.com/jobs/view/founding-ai-engineer-at-omnora-4340840200",
    "posted_date": "7 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQElv_A_srZx_w/company-logo_100_100/B4DZmGZvcEH0AQ-/0/1758896519418/omnora_logo?e=2147483647&v=beta&t=I2_Oz7JazgVWEw3-hkBqb4XRP4xvbRzv2-u20lbiqIs",
    "description": "Founding AI Engineer (LLM + UX) (m/w/d)Festanstellung, Vollzeit · Frankfurt am MainAbout The Role And Potential ProgressionMit unsererIntelligence Management Plattformlösen wir eine der größten Herausforderungen der kommenden Dekade:Wie Unternehmen ihr Expertenwissen bewahren, bevor es durch Ruhestand oder Fluktuation verloren geht.AlsFounding AI Engineerübernimmst du Verantwortung für ein visionäres Produkt an der Schnittstelle vonKI, UX und Wissensmanagement. Du entwirfst, implementierst und verbesserst ein KI-basiertes System, das Fachexperten vollautomatisiert interviewt, ihr implizites Wissen erfasst und dieses Wissen über verschiedene Formate und Schnittstellen im Unternehmen nutzbar macht.Du arbeitest eng mit internen Stakeholdern und Pilotkunden zusammen, um reale Bedürfnisse zu verstehen, Hypothesen zu testen und früh funktionierende Prototypen auf den Markt zu bringen. Diese Rolle istnicht einfach ein Job- sie ist eine Gelegenheit, ein Produkt mitgroßem Impact von Grund auf mitzugestalten.What's in it for meBeteiligung mit echtem Einfluss:Als Founding Engineer hast dudirekten Einfluss auf Produkt, Technologie und Strategieund profitierst durchechte Beteiligungsmöglichkeitenam Unternehmenserfolg.Dein Beitrag ist sichtbar, messbar und langfristig wertvoll.Wirkung statt Politik:Bei uns zählen Fakten mehr als Egos. Du bekommstunternehmerische Freiheitund die Verantwortung, dich an Ergebnissen messen zu lassen.Wachstum auf Augenhöhe:Entwicklung hört bei uns nicht an der Führungsebene auf. Individuelles Coaching, Sparring mit dem Leadership-Team oder Zugang zu Premium-Lernressourcen – du investierst nicht nur in das Unternehmen, sondern das Unternehmen investiert auch in dich.Kultur echter Exzellenz:Du arbeitest mitambitionierten Kolleginnen und Kollegenin einem mehrfach ausgezeichneten Unternehmen. Wir schaffen Raum für Leistung, Vertrauen und Wertschätzung und verzichten auf leere Phrasen.Flexibles Arbeiten mit Teamspirit:Wir kombinieren das Beste aus beiden Welten: Du arbeitest flexibel im Home Office, bist aber regelmäßig im Büro, um gemeinsam mit dem Team Ideen zu testen, Entscheidungen zu treffen und Tempo aufzubauen.Momentum trifft Vision:Wir stehen an einem strategischen Wendepunkt: mit einem marktreifen Produkt, klarer Positionierung und einem Setup, das auf Skalierung ausgelegt ist. Die nächsten Monate werden entscheidend und bieten den perfekten Moment, um einzusteigen und das nächste Kapitel aktiv mitzugestalten.How you can make an impactKonzipiere und implementiere denKI-Interviewprozess, der mithilfe von AI Voice Agents dynamisch sinnvolle Fragen stellt und tiefes Fachwissen erfasst.Baue und orchestriere eineTranscript-to-Knowledge-Pipeline, die in Interviews erfasstes Expertenwissen strukturiert, aufbereitet, nachhaltig speichert und bereitstellt.Entwerfe und implementiereKI-Agenten, um das erfasste Wissen über unterschiedliche Formate und Schnittstellen im Unternehmen verfügbar zu machen.FühreNutzerinterviewsmit Fachexperten und Wissensmanagern, um Bedürfnisse zu validieren und das System kontinuierlich zu verbessern.Übernimm die Verantwortung für dasEnd-to-End-Produkt– von KI-Agenten über Datenpipelines bis hin zu einem intuitiven Frontend.Arbeite eng mit dem Produkt- und Entwicklungsteam an Zielen, Experimenten und Vision. Du bist gleichzeitighands-on Entwicklerundproduktgetriebener Denker.Skills to be successfulTiefes technisches Verständnis: Du kannst komplexe KI- und Softwarelösungen eigenständig und End-to-End konzipieren, implementieren und skalierbar betreiben.(Tech Stack: Next.js, LiveKit, LangGraph/LangChain, Azure, OpenAI, TypeScript, Python)Konzeptionelle Stärke: Du kannst technische Lösungsansätze für anspruchsvolle Probleme entwerfen, bewerten und in tragfähige Architekturen überführen.Produktdenken: Du denkst nicht nur in Codezeilen, sondern in Nutzerbedürfnissen und Mehrwert.Ownership & Hands-on-Mentalität:Du arbeitest selbstständig und proaktiv, übernimmst Verantwortung und kommunizierst klar.User Empathy: Du hast bereits Erfahrung mit Nutzerinterviews und bringst echtes Interesse daran mit, wie Menschen denken und arbeiten.Bonus:Erfahrung mit Wissensgraphen, Wissensmanagement oder Knowledge Engineering.Über unsOmnora ist die führende Plattform für mitarbeitergeneriertes Wissen und KI-gestütztes Intelligence Management.Wir helfen Unternehmen dabei, ihr wertvollstes Kapital – Wissen – sichtbar, sicher und wirksam zu machen. So entstehen Resilienz, Geschwindigkeit und echte Wettbewerbsfähigkeit – gerade in Zeiten des Fachkräftemangels.Wir wachsen profitabel, sind unabhängig von Investoren und handeln mit langfristiger Perspektive. Unsere Lösungen sind in führenden Unternehmen im Einsatz – vom Mittelstand bis zum Großkonzern – und machen dort täglich den Unterschied.Unsere Unternehmenskultur ist geprägt von Verantwortung, Leistung, Lernfreude und Mut. Wir leben Prinzipien wie Extreme Ownership, Solution Orientation und Exzellenz – nicht auf dem Papier, sondern im Alltag.Bei uns triffst du auf ein hochambitioniertes Team mit klarem Fokus, schnellen Entscheidungswegen und echter Gestaltungskraft. Wir glauben an radikale Klarheit, gegenseitiges Vertrauen und das ständige Streben nach besser.Wenn du Lust auf echte Wirkung, viel Eigenverantwortung und ein Umfeld hast, das dich fordert und fördert, dann bist du bei Omnora genau richtig.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQElv_A_srZx_w/company-logo_100_100/B4DZmGZvcEH0AQ-/0/1758896519418/omnora_logo?e=2147483647&v=beta&t=I2_Oz7JazgVWEw3-hkBqb4XRP4xvbRzv2-u20lbiqIs",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist / AI Consultant (m/w/d)",
    "company": "IBM",
    "location": "Frankfurt, Hesse, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-ai-consultant-m-w-d-at-ibm-4340640767",
    "posted_date": "6 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.You will work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.Curiosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you will be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground-breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.In this role, you will work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver deep technical and industry expertise to a wide range of public and private sector clients around the world. Our delivery centers offer our clients locally based skills and technical expertise to drive innovation and adoption of new technology.Your Role And ResponsibilitiesAs a Data Scientist / AI Consultant at IBM, you will work to solve business problems using leading edge and open-source tools such as Python, R, and TensorFlow, combined with IBM tools and our AI application suites. You will prepare, analyze, and understand data to deliver insights, predict emerging trends, and provide recommendations to stakeholders. In your role, you may be responsible for:Analysis, preparation and management of complex data sourcesImplementing and validating predictive and prescriptive models and creating and maintaining statistical models with a focus on big data & incorporating machine learning techniques in your projectsWriting programs to cleanse and integrate data in an efficient and reusable mannerDevelopment of scalable and robust data and machine learning pipelinesApplication of traditional machine learning algorithms as well as modern deep learning approaches (such as GenAI)Implementation, integration and monitoring of AI / ML modelsWorking in an agile, collaborative environment, partnering with other scientists, engineers, consultants and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behavioursDocumentation and communication with internal and external clients (e.g. business and IT departments) and stakeholders to understand and define business needs and appropriate modelling techniques to provide analytical solutions as well as presentation of proposed solutions and results.Evaluating modelling results and communicating the results to technical and non-technical audiences.Preferred EducationMaster's DegreeRequired Technical And Professional ExpertiseStrong fundamentals in Mathematics and/or Computer Science (algorithms)Proven knowledge and experience inAI and ML frameworks (e.g. PyTorch)GenAI and agentic AI architectures (RAG, agentic patterns, etc.)AI governance and monitoringStrong ability to communicate with and coach senior executives, translating technical insights into business strategyYou have strong technical and analytical abilities, a knack for driving impact and growth, and experience with programming/scripting in Python.You're great at solving problems by looking at things differently, debugging, troubleshooting, and designing & implementing solutions to complex technical issues.You thrive on teamwork and have excellent verbal and written communication skills.Excellent verbal and written German language skills (C1 level)Preferred Technical And Professional ExperienceAzure platform expertise, ideally with Azure Foundry and related AI/ML servicesExperience in DevOps and MLOps, including CI/CD pipelines, ML lifecycle management, and deploymentBackground in the chemical or process industry, with awareness of domain-specific challenges and dataUnderstanding of AI governance, safety, and ethical considerationsExperience in consulting or client-facing roles with a focus on value realization through AIDemonstrated ability to scale AI solutions from prototype to production and integrate across enterprise systems",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist mit Schwerpunkt KI (w/m/d)",
    "company": "MAN Truck & Bus SE",
    "location": "Munich, Bavaria, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-mit-schwerpunkt-ki-w-m-d-at-man-truck-bus-se-4336211136",
    "posted_date": "4 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGe94ZHvYEgug/company-logo_100_100/company-logo_100_100/0/1714998947051/man_commercial_vehicles_logo?e=2147483647&v=beta&t=JuobakFIeHIee8YuVDUDMSNPvIYdojJutR2hn7KWFIk",
    "description": "Stellenbezeichnung: Data Scientist mit Schwerpunkt KI (w/m/d)Startdatum der Ausschreibung: 14.11.25Zu besetzen:ab sofortIhr ArbeitsumfeldDigital Production LabWir sind ein junges und dynamisches Team, das neue digitale Technologien und Ansätze im Bereich Advanced Data Analytics exploriert und damit Innovationen für unser Produktions- und Logistiknetzwerk vorantreibt. Gemeinsam mit anderen Unternehmensbereichen etablieren wir Prozesse und Systeme zur Analyse und Verarbeitung von Daten im gesamten Unternehmen. Unsere Mission ist es, einen Mehrwert durch die Nutzung von Daten zu schaffen. Dazu gestalten und etablieren wir die Domänen Data-Governance, Data-Architecture, Data-Engineering und Data-Science für den Bereich Produktion und Logistik. Weiter definieren wir aus Produktionssicht Rollenkonzepte und Organisationsstrukturen maßgeblich mit und bauen die nötigen Fähigkeiten sowie Kompetenzen im Fachbereich auf. Wir streben danach, Neues zu entdecken und zu erlernen. Darüber hinaus beschleunigen wir unsere Lernkurve, indem wir unsere Kräfte mit anderen Marken innerhalb der Traton Group und von VW bündeln und Synergien nutzen. Ein weiterer Teil unserer Arbeit ist die Realisierung von Data & Analytics UseCases für interne Kunden innerhalb von Produktion und Logistik mit unserem internationalen Team in Lissabon und Pune.Ziehen Sie mit uns an einem Strang. Als Teil unseres globalen Teams von über 36.000 Mitarbeitenden werden Sie Zukunftsvisionen mit uns gemeinsam Wirklichkeit werden lassen.Wir sehen Individualität unserer Mitarbeitenden als Stärke an und freuen uns über vielfältige Bewerbungen von Personen mit unterschiedlichen Hintergründen. Falls Sie während Ihrer Bewerbung Unterstützung benötigen, melden Sie sich bitte bei uns.Ihre AufgabenSie übernehmen als Product Owner eine Schlüsselrolle bei der Gestaltung der Zukunft von Data & Analytics und KI in der Produktion & Logistik von MAN.Gemeinsam mit Fachbereichen und Stakeholdern identifizieren und priorisieren Sie wertschöpfende UseCases und treiben deren Umsetzung voran.Sie begleiten den kompletten Lifecycle unserer UseCases (von Design über Build bis Operate) und und arbeiten dabei eng mit den Fachbereichen sowie unseren agilen Entwicklungsteams in Lissabon und Indien zusammen.Sie bringen Ihr Know-how in die Bewertung neuer KI-Technologien ein, insbesondere im Bereich NLP, LLMs und Botframeworks.Darüber hinaus übernehmen Sie die Durchführung von Proof-of-Concepts sowie MachbarkeitsstudienSie gestalten unsere KI-Strategie für Produktion & Logistik aktiv mit und treiben deren Umsetzung durch cross-funktionale Projekte (Infrastruktur, Governance, Plattformen) voran mit internen und externen Stakeholdern aus allen Funktionen innerhalb von MAN.Sie wirken in der konzernweiten Community mit und treiben den Wissens- und Erfahrungsaustausch voran.Ihre QualifikationenSie haben ein erfolgreich abgeschlossenes Studium im Bereich Informatik, Softwareentwicklung, Mathematik/Statistik mit Schwerpunkt Data Science/KI oder vergleichbare Qualifikation.Sie verfügen über Kenntnisse in Data Science und/oder Softwareentwicklung.Sie haben Kenntnisse in der Entwicklung, dem Training und der produktiven Umsetzung von KI-Modellen, idealerweise mit Fokus auf Generativer KI.Sie haben sehr gute Kenntnisse in Python und relevanten Frameworks wie PyTorch, TensorFlow oder HuggingFace sowie Erfahrung mit Cloud-Umgebungen (spezifisch AWS) sind von Vorteil.Sie sind vertraut mit allen Facetten des Datenmanagements (Data Engineering, Cleansing, Processing, Governance).Informationen zur StelleDiese Stelle ist bei MAN Truck & Bus SE in München (Abteilung PLF (65144404)) zu besetzen.Kennziffer: 4703Lina Krusche , , steht Ihnen für Fragen gerne zur Verfügung.Ansprechpartner für den Fachbereich ist Dr. Ing. Sebastian Bohr.Integrität und Compliance sind wesentliche Teile unserer Unternehmenskultur.Wir fördern Vielfalt und Chancengleichheit und freuen uns auf vielfältige Bewerbungen.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4E0BAQGe94ZHvYEgug/company-logo_100_100/company-logo_100_100/0/1714998947051/man_commercial_vehicles_logo?e=2147483647&v=beta&t=JuobakFIeHIee8YuVDUDMSNPvIYdojJutR2hn7KWFIk",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Data Scientist / AI Consultant (m/w/d)",
    "company": "IBM",
    "location": "Cologne, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/data-scientist-ai-consultant-m-w-d-at-ibm-4340620763",
    "posted_date": "6 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.You will work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.Curiosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you will be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground-breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.In this role, you will work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver deep technical and industry expertise to a wide range of public and private sector clients around the world. Our delivery centers offer our clients locally based skills and technical expertise to drive innovation and adoption of new technology.Your Role And ResponsibilitiesAs a Data Scientist / AI Consultant at IBM, you will work to solve business problems using leading edge and open-source tools such as Python, R, and TensorFlow, combined with IBM tools and our AI application suites. You will prepare, analyze, and understand data to deliver insights, predict emerging trends, and provide recommendations to stakeholders. In your role, you may be responsible for:Analysis, preparation and management of complex data sourcesImplementing and validating predictive and prescriptive models and creating and maintaining statistical models with a focus on big data & incorporating machine learning techniques in your projectsWriting programs to cleanse and integrate data in an efficient and reusable mannerDevelopment of scalable and robust data and machine learning pipelinesApplication of traditional machine learning algorithms as well as modern deep learning approaches (such as GenAI)Implementation, integration and monitoring of AI / ML modelsWorking in an agile, collaborative environment, partnering with other scientists, engineers, consultants and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behavioursDocumentation and communication with internal and external clients (e.g. business and IT departments) and stakeholders to understand and define business needs and appropriate modelling techniques to provide analytical solutions as well as presentation of proposed solutions and results.Evaluating modelling results and communicating the results to technical and non-technical audiences.Preferred EducationMaster's DegreeRequired Technical And Professional ExpertiseStrong fundamentals in Mathematics and/or Computer Science (algorithms)Proven knowledge and experience inAI and ML frameworks (e.g. PyTorch)GenAI and agentic AI architectures (RAG, agentic patterns, etc.)AI governance and monitoringStrong ability to communicate with and coach senior executives, translating technical insights into business strategyYou have strong technical and analytical abilities, a knack for driving impact and growth, and experience with programming/scripting in Python.You're great at solving problems by looking at things differently, debugging, troubleshooting, and designing & implementing solutions to complex technical issues.You thrive on teamwork and have excellent verbal and written communication skills.Excellent verbal and written German language skills (C1 level)Preferred Technical And Professional ExperienceAzure platform expertise, ideally with Azure Foundry and related AI/ML servicesExperience in DevOps and MLOps, including CI/CD pipelines, ML lifecycle management, and deploymentBackground in the chemical or process industry, with awareness of domain-specific challenges and dataUnderstanding of AI governance, safety, and ethical considerationsExperience in consulting or client-facing roles with a focus on value realization through AIDemonstrated ability to scale AI solutions from prototype to production and integrate across enterprise systems",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D560BAQGiz5ecgpCtkA/company-logo_100_100/company-logo_100_100/0/1688684715866/ibm_logo?e=2147483647&v=beta&t=HPSmWLOCvdPkWO1nRWwjjmCNpaCqww20rSJ4E54QtxQ",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Engineer (m/w/d)",
    "company": "BFS health finance GmbH",
    "location": "Dortmund, North Rhine-Westphalia, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-engineer-m-w-d-at-bfs-health-finance-gmbh-4340448776",
    "posted_date": "12 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFPA7gSuqHThQ/company-logo_100_100/company-logo_100_100/0/1660547961735/bfs_health_finance_gmbh_logo?e=2147483647&v=beta&t=LDcaHxZ6T2emCjE2pGlmyqgAZhgteJYqW3888vesYa0",
    "description": "Du möchtest die Speerspitze der KI-Entwicklung bei uns werden und auf einer grünen Wiese die Einbettung moderner KI-Modelle in die BFS-Systemlandschaft gestalten? Dann bewirb dich jetzt!Wir suchen Unterstützung alsAI Engineer (m/w/d)(unbefristet, Vollzeit) am Standort Dortmund mit der Möglichkeit von 80% Mobile OfficeDeine Aufgaben:Gestalten statt verwalten: Entwickle, trainiere und deploye robuste Machine-Learning- und Deep-Learning-Modelle – z. B. für Risikoklassifikation, Dokumentenanalyse oder Predictive Analytics.Innovation pur: Baue KI-basierte Wissensdatenbanken, Chatbots und Automatisierungslösungen – von Azure OpenAI über LangChain bis hin zu RAG-Systemen – und sorge für Stabilität und Performance.Data Engineering trifft KI: Konzipiere effiziente Datenpipelines und Workflows für OCR, NLP und Co. und bringe sie produktiv in unsere LandschaftAlways ahead: Evaluieren, integrieren, testen – du bringst neue KI-Technologien, Frameworks und Plattformen (Azure AI Services, Hugging Face, LangChain) in die PraxisTeamwork first: Arbeite eng mit Data Engineers, IT und Fachbereichen zusammen, um KI-Lösungen nachhaltig zu verankernDas bringst du mit:Sprache: Fließende Deutschkenntnisse (mindestens C1)Know-how: Abgeschlossenes Studium in (Wirtschafts-)Informatik, Data Science / KI oder vergleichbare Ausbildung mit relevanter ErfahrungTech-Skills:ML/DL-Entwicklung mit Python, TensorFlow, PyTorch, Scikit-LearnModell-Deployment & MLOps (Docker, CI/CD, Cloud, REST-APIs)Erfahrung mit LLMs (OpenAI, Hugging Face), Prompt Engineering, Chatbots & RAG-SystemenNice-to-have: Kenntnisse in NLP, OCR, Git, Azure, Atlassian, ETL-Prozessen, Datenintegration & DatenbankenPluspunkte: Grundwissen zu IT-Security, EU AI Act, DSGVO & ComplianceWas wir mitbringen?Wir sind voll motiviert: Bei uns findest du abwechslungsreiche Aufgaben und eine partnerschaftliche Arbeitsatmosphäre mit flachen Hierarchien & Duz-KulturWir leben flexibles Arbeiten: Du kannst deine Arbeitszeit selbst mitgestalten und flexibel einteilen! Auch deinen Arbeitsort kannst du im Rahmen unserer 80% Mobile Office-Regelung innerhalb Deutschlands frei wählenWir bieten vielfältige Weiterbildungsmöglichkeiten: Wir unterstützen dich dabei, bei uns deine individuellen Ziele zu verwirklichenWir fördern umweltfreundliches Verhalten: Bei uns gibt es ein Cash-Back-Programm für einen grünen Arbeitsweg. Passend hierzu befindet sich unser Bürogebäude in verkehrsgünstige Lage - von der Zug- & U-Bahn Haltestelle ist das Büro fußläufig in nur zwei Minuten zu erreichenUns liegt deine Gesundheit am Herzen: Unser ganzheitliches Gesundheitsmanagement bietet verschiedenste Angebote in den Bereichen Ernährung, Bewegung, Psyche, Vorsorge und ArbeitsumfeldAußerdem gibt’s bei uns: eine strukturierte, vollumfängliche Einarbeitung, sechs Wochen Jahresurlaub, Rundumversorgung mit Getränken und Obst (im Büro), einen Zuschuss zu deinen Lebensmitteleinkäufen, zahlreiche Mitarbeiterrabatte und einen MassageserviceDas klingt nach Deinem Traumjob? Dann freuen wir uns auf Deine aussagekräftige Online-Bewerbung mit Lebenslauf, Angaben zu Gehaltsvorstellung und frühestmöglichem Eintrittsdatum.Wer wir sind:BFS health finance nimmt Mediziner:innen alles ab, was Zeit frisst: Vom Zahlungsstrommanagement über die Sicherung von Honoraren bis hin zur Beratung im Praxismanagement. BFS vertrauen tausende Zahnärzt:innen, Ärzt:innen, Tierärzt:innen, Dentallabore, medizinische Versorgungszentren sowie Chefärzt:innen und Kliniken. Als Spezialist für Finanzdienstleistungen im Gesundheitswesen ist BFS health finance der Wegebereiter für das vernetze Gesundheitssystem der Zukunft in der Unternehmensgruppe Riverty. Riverty ist ein global tätiger Finanzdienstleister und zu Bertelsmann zugehörig.Wir halten was wir versprechen:Weitere Informationen findest du auf riverty.com/karriere. Bist du schon bereit, eine Entscheidung zu treffen? Dann bewirb dich mit wenigen Klicks - wir freuen uns auf deine Online Bewerbung.Wir freuen uns auf Bewerbungen von Menschen, die zu der Diversität bei Riverty beitragen. Dabei verstehen wir Vielfalt insbesondere in den Dimensionen kulturelle oder soziale Herkunft, Religion, Alter, Behinderung, Geschlecht und sexuelle Identität.Unternehmen:BFS Health Finance GmbH| Job ID:283418Benefits:Bei Riverty kannst du sein, wer du bist. Wir setzen uns dafür ein, eine inklusive Umgebung und eine wertschätzende Kultur zu schaffen, die durch unsere Mitarbeitenden-Netzwerke bereichert wird.Priorisiere deine Gesundheit mit unterstützten Sport- und Freizeitaktivitäten.Nutze unsere zahlreichen Aus- und Weiterbildungsmöglichkeiten! Entwickle deine Fähigkeiten mit Trainingsangeboten der Bertelsmann University, Sprachkursen oder Führungstrainings.Profitiere von unseren Rabatten auf Bertelsmann-Produkte und finanziellen ZusatzleistungenMit unseren vielfältigen Arbeitsmodellen kannst du deine Arbeit nach deinen Wünschen gestalten. Profitiere von mobile Office, flexiblen Arbeitszeiten und Teilzeitmodellen.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C4E0BAQFPA7gSuqHThQ/company-logo_100_100/company-logo_100_100/0/1660547961735/bfs_health_finance_gmbh_logo?e=2147483647&v=beta&t=LDcaHxZ6T2emCjE2pGlmyqgAZhgteJYqW3888vesYa0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Full Stack Engineer - AI Software Start-up",
    "company": "Glorya GmbH",
    "location": "Berlin, Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/full-stack-engineer-ai-software-start-up-at-glorya-gmbh-4340208438",
    "posted_date": "14 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQH4oH6CEnbV0g/company-logo_100_100/company-logo_100_100/0/1715364830317?e=2147483647&v=beta&t=G1wo-Ak26-nSOXeP-bzVSXhzEgdn3_c8J-uls3tloa0",
    "description": "We’re Glorya, a Berlin-based AI-powered marketing start-up, building Marketing Agents that automate generative performance-marketing. Our platform continually optimises campaigns, boosts results, and learns from every iteration, putting powerful, AI-driven performance marketing within every small business’s reach, at a price that’s a fraction of the norm.Location: Berlin, in-person onlyPotential forequity ownershipSkills: Building full-stack web apps, Next.js, TypeScript, being up to date with the latest AI frameworks and toolsTasksbuild tools to scale generative performance marketing to thousands of small businessestake full ownership of projects and bring ideas from 0 to 1work closely with our users to transform novel insights into effective featuresRequirements3+ years of experience being a software engineerbeing comfortable with fast-pace field and environmentbeing interested in the latest news in the AI fieldexcited to work in person from our office in Berlin Mitteif you join Glorya, you’ll get a lot of freedom. we expect you to be proactive and take ownershipBenefitswork at a fast growing startup at an early team (we grow ~20% MoM)you will have the opportunity to work on some of the most exciting AI topics in the field of marketingwe ship fast but don’t release junkwe like hard work and problems — challenges mean potential valuework closely with the team on the edge of what’s possible todayno meetings, highly writing and transparent culture",
    "logo_tag": "https://media.licdn.com/dms/image/v2/D4D0BAQH4oH6CEnbV0g/company-logo_100_100/company-logo_100_100/0/1715364830317?e=2147483647&v=beta&t=G1wo-Ak26-nSOXeP-bzVSXhzEgdn3_c8J-uls3tloa0",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "AI Engineer (m/w/d) für innovative Lösungen",
    "company": "Joseph Vögele AG",
    "location": "Ludwigshafen, Rhineland-Palatinate, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/ai-engineer-m-w-d-f%C3%BCr-innovative-l%C3%B6sungen-at-joseph-v%C3%B6gele-ag-4335897346",
    "posted_date": "18 hours ago",
    "logo": "https://static.licdn.com/aero-v1/sc/h/6puxblwmhnodu6fjircz4dn4h",
    "description": "Zur Verstärkung Unseres Teams Suchen WirIngenieur (m/w/d)Künstliche Intelligenz und WertanalyseDie JOSEPH VÖGELE AG ist ein Unternehmen der WIRTGEN GROUP, einem global tätigen Unternehmensverbund der Baumaschinenindustrie mit 5 Stammwerken in Deutschland, lokalen Produktionsstätten in Brasilien, China und Indien sowie einem weltweiten Vertriebs- und Servicenetz. Innerhalb der WIRTGEN GROUP ist die JOSEPH VÖGELE AG der Spezialist für Straßenfertiger und weltweiter Marktführer.AUFGABENAnwendung moderner KI-Methoden und Tools (z. B. Data Analytics, generative KI) zur Unterstützung bestehender WertanalysenEntwicklung, Priorisierung und Umsetzung neuer KI-basierter Ansätze, insbesondere zur Kostenoptimierung von Serien- und NeuentwicklungsproduktenEnge Zusammenarbeit mit den Bereichen Konstruktion, Fertigung, Supply Chain, Qualitätsmanagement und IT sowie externen PartnernErstellung von Wirtschaftlichkeitsanalysen und Handlungsempfehlungen und deren nachhaltige UmsetzungKoordination und Priorisierung verschiedenster Anforderungen an KI-Tools und deren Begleitung bis zur Umsetzung und ImplementierungANFORDERUNGSPROFILAbgeschlossenes Studium im Bereich Maschinenbau, Wirtschaftsingenieurwesen, Data Science oder vergleichbarKenntnisse in der Wertanalyse, Verständnis für Fertigungsprozesse in Klein- und MittelserienproduktionErfahrungen im Einsatz von KI-Methoden und -Tools (z. B. Data Mining, neuronale Netze)Kenntnisse in CAD/CAM und SAP sind von VorteilSehr gute Deutsch- und EnglischkenntnisseHohe Problemlösungskompetenz, Innovationsfähigkeit sowie die Fähigkeit, komplexe Sachverhalte verständlich darzustellenKommunikationsstärke, Einsatzbereitschaft, Teamfähigkeit, sehr gute analytische Fähigkeiten und eine strukturierte ArbeitsweiseANGEBOTSpannende Projekte an der Schnittstelle zwischen klassischen Ingenieurstätigkeiten und ZukunftstechnologienWeiterbildungsmöglichkeiten im Bereich KI, Wertanalyse und DigitalisierungEin motiviertes Team in einem modernen ArbeitsumfeldAttraktive Vergütung und flexible ArbeitszeitmodelleGestaltungsspielraum beim Aufbau von KI-basierten Wertanalyse-MethodenMitarbeit in internationalen und interdisziplinären TeamsFühlen Sie sich angesprochen? Dann freuen wir uns auf ein Kennenlernen und auf Ihre aussagekräftigen Bewerbungsunterlagen.JOSEPH VÖGELE AGPersonalabteilungJoseph-Vögele-Str. 167075 LudwigshafenT: +49 621 / 81 05-379www.voegele.infoSchicken Sie uns Ihre Online-Bewerbung über unser Karriereportal auf www.voegele.info.",
    "logo_tag": "https://static.licdn.com/aero-v1/sc/h/6puxblwmhnodu6fjircz4dn4h",
    "in_time_range": true,
    "time_note": ""
  },
  {
    "title": "Senior/Staff AI Engineer",
    "company": "Picsart",
    "location": "Berlin, Germany",
    "job_link": "https://de.linkedin.com/jobs/view/senior-staff-ai-engineer-at-picsart-4249719917",
    "posted_date": "8 hours ago",
    "logo": "https://media.licdn.com/dms/image/v2/C560BAQFDzSzptlwiOQ/company-logo_100_100/company-logo_100_100/0/1640024876057/picsart_photo_studio_logo?e=2147483647&v=beta&t=u9zACdn9xfqQN023Vtvb7QOU4Cr1aQLPsRpPwLIqRl8",
    "description": "At Picsart, our AI engineering team builds the core systems that power the creative tools used by hundreds of millions worldwide. As a Staff AI Engineer, you’ll lead the design and evolution of our model serving platform—enabling fast, scalable, and reliable deployment of cutting-edge AI models. Your work will shape the foundation of our AI infrastructure and accelerate innovation across teams.How You'll Make An ImpactArchitect and drive the development of a scalable, cost-efficient model serving platform.Lead optimization efforts for deploying machine learning models with high performance and low latency.Guide incident response, performance tuning, and reliability strategies to ensure 24/7 model availability.Establish secure, automated deployment pipelines and enforce best practices for compliance and observability.Design and maintain RESTful APIs with FastAPI for model inference.Partner with cross-functional teams to align serving architecture with evolving model needs.Evaluate and integrate emerging tools and frameworks to future-proof our AI infrastructure.What You'll BringBachelor’s or Master’s degree in Computer Science, Engineering, or a related field.Deep knowledge of Computer Science fundamentals: algorithms, data structures, distributed systems.7+ years of experience in engineering and 3+ years of experience in managing ML models in production environments.Expertise in containerization and orchestration (Docker, Kubernetes) and scalable system design.Experience with monitoring, alerting, and logging frameworks in production-grade services.Strong communication skills and a track record of technical leadership and cross-team collaboration.Good To HaveAdvanced Python programming expertise.Hands-on experience with inference engines like TensorRT, Triton, and Ray.Familiarity with AI/ML frameworks (e.g., PyTorch, TensorFlow).Experience with cloud platforms such as Google Cloud Platform (GCP).Exposure to distributed inference and hybrid model serving patterns.What we seek and value most in our candidatesProfessionalism in both soft and hard skills; motivation to grow, learn and share, positive attitude, flexibility, transparency, ownership and the most important - passion and commitment.Picsart is proud to be an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We are committed to providing reasonable accommodation to employees who have protected disabilities consistent with local law.Picsart, Inc. is an E-Verify Employer in the US. Please click here for the E-Verify Poster inEnglishorSpanish. For information regarding your Right To Work, please click here forEnglishorSpanish.For Applicants Based in California - California Job Applicant Privacy Notice(https://rb.gy/lqu5mv)About UsPicsart is the world’s largest digital creation platform and atop 20 most downloaded app. Every month, the Picsart community creates, remixes, and shares billions of visual stories using the company’s powerful and easy-to-use editing tools. Picsart has amassed one of the largest open-source content collections in the world, including free-to-edit photos, stickers, backgrounds, templates, and more. Picsart is available in 30 languages for free and as a subscription on iOS, Android, Windows devices and on the Web. Headquartered in Miami, with offices around the world, Picsart is backed by SoftBank, Sequoia Capital, DCM Ventures, Insight Partners, and others.Downloadthe app or visitpicsart.comfor more information.",
    "logo_tag": "https://media.licdn.com/dms/image/v2/C560BAQFDzSzptlwiOQ/company-logo_100_100/company-logo_100_100/0/1640024876057/picsart_photo_studio_logo?e=2147483647&v=beta&t=u9zACdn9xfqQN023Vtvb7QOU4Cr1aQLPsRpPwLIqRl8",
    "in_time_range": true,
    "time_note": ""
  }
]